[Killed] BlockStatement
src/zoomPlugin.ts:95:95
 /** Calls `fn` with `args` if it's a real function, otherwise a no-op —
  * see this file's own header comment for why this replaces
  * `chart.js/helpers`' own `callback()` here. */
-function invoke<R>(fn: ((...args: never[]) => R) | undefined, args: unknown[]): R | undefined {
-  return typeof fn === 'function' ? (fn as (...a: unknown[]) => R)(...args) : undefined;
-}
+function invoke<R>(fn: ((...args: never[]) => R) | undefined, args: unknown[]): R | undefined {}
 
 type ZoomDirection = 'x' | 'y';
killedBy: zoomPlugin wheel-zoom interaction rejects the wheel zoom (and calls onZoomRejected) when a required wheel modifier key is not held
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/zoomPlugin.ts:96:10
  * see this file's own header comment for why this replaces
  * `chart.js/helpers`' own `callback()` here. */
 function invoke<R>(fn: ((...args: never[]) => R) | undefined, args: unknown[]): R | undefined {
-  return typeof fn === 'function' ? (fn as (...a: unknown[]) => R)(...args) : undefined;
+  return false ? (fn as (...a: unknown[]) => R)(...args) : undefined;
 }
 
killedBy: zoomPlugin wheel-zoom interaction rejects the wheel zoom (and calls onZoomRejected) when a required wheel modifier key is not held
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/zoomPlugin.ts:96:10
  * see this file's own header comment for why this replaces
  * `chart.js/helpers`' own `callback()` here. */
 function invoke<R>(fn: ((...args: never[]) => R) | undefined, args: unknown[]): R | undefined {
-  return typeof fn === 'function' ? (fn as (...a: unknown[]) => R)(...args) : undefined;
+  return typeof fn !== 'function' ? (fn as (...a: unknown[]) => R)(...args) : undefined;
 }
 
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: fn is not a function

[Killed] BlockStatement
src/zoomPlugin.ts:191:50
 
 const chartStates = new WeakMap<Chart, ZoomPluginState>();
 
-function getState(chart: Chart): ZoomPluginState {
-  let state = chartStates.get(chart);
-  if (!state) {
-    state = {
-      originalScaleLimits: {},
-      updatedScaleLimits: {},
-      handlers: {},
-      panDelta: {},
-      dragging: false,
-      panning: false,
-      options: {},
-      pointers: new Map(),
-    };
-    chartStates.set(chart, state);
-  }
-  return state;
-}
+function getState(chart: Chart): ZoomPluginState {}
 
 function removeState(chart: Chart): void {
killedBy: zoomPlugin start attaches the full programmatic API onto the live chart instance
statusReason: Cannot set properties of undefined (setting 'options')

[Killed] ConditionalExpression
src/zoomPlugin.ts:193:7
 
 function getState(chart: Chart): ZoomPluginState {
   let state = chartStates.get(chart);
-  if (!state) {
+  if (false) {
     state = {
       originalScaleLimits: {},
killedBy: zoomPlugin start attaches the full programmatic API onto the live chart instance
statusReason: Cannot set properties of undefined (setting 'options')

[Killed] ConditionalExpression
src/zoomPlugin.ts:193:7
 
 function getState(chart: Chart): ZoomPluginState {
   let state = chartStates.get(chart);
-  if (!state) {
+  if (true) {
     state = {
       originalScaleLimits: {},
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'min')

[Killed] BooleanLiteral
src/zoomPlugin.ts:199:17
       updatedScaleLimits: {},
       handlers: {},
       panDelta: {},
-      dragging: false,
+      dragging: true,
       panning: false,
       options: {},
killedBy: zoomPlugin getZoomLevel / isZoomedOrPanned / isZoomingOrPanning reports isZoomingOrPanning false outside of an active drag
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/zoomPlugin.ts:200:16
       handlers: {},
       panDelta: {},
       dragging: false,
-      panning: false,
+      panning: true,
       options: {},
       pointers: new Map(),
killedBy: zoomPlugin getZoomLevel / isZoomedOrPanned / isZoomingOrPanning reports isZoomingOrPanning false outside of an active drag
statusReason: expected true to be false // Object.is equality

[Survived] BlockStatement
src/zoomPlugin.ts:209:42
   return state;
 }
 
-function removeState(chart: Chart): void {
-  chartStates.delete(chart);
-}
+function removeState(chart: Chart): void {}
 
 function liveScales(chart: Chart): LiveScale[] {

[Killed] BlockStatement
src/zoomPlugin.ts:213:48
   chartStates.delete(chart);
 }
 
-function liveScales(chart: Chart): LiveScale[] {
-  return Object.values(chart.scales as unknown as Record<string, LiveScale>);
-}
+function liveScales(chart: Chart): LiveScale[] {}
 
 // ---- direction/mode helpers ----
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: scales is not iterable

[Killed] BlockStatement
src/zoomPlugin.ts:219:122
 
 // ---- direction/mode helpers ----
 
-function getModifierKey(opts: { enabled?: boolean; modifierKey?: string | null } | undefined): string | null | undefined {
-  return opts && opts.enabled ? opts.modifierKey : undefined;
-}
+function getModifierKey(opts: { enabled?: boolean; modifierKey?: string | null } | undefined): string | null | undefined {}
 function keyPressed(key: string | null | undefined, event: MouseEvent): boolean {
   return !!key && !!(event as unknown as Record<string, boolean>)[`${key}Key`];
killedBy: zoomPlugin wheel-zoom interaction rejects the wheel zoom (and calls onZoomRejected) when a required wheel modifier key is not held
statusReason: expected NaN to be undefined

[Killed] LogicalOperator
src/zoomPlugin.ts:220:10
 // ---- direction/mode helpers ----
 
 function getModifierKey(opts: { enabled?: boolean; modifierKey?: string | null } | undefined): string | null | undefined {
-  return opts && opts.enabled ? opts.modifierKey : undefined;
+  return opts || opts.enabled ? opts.modifierKey : undefined;
 }
 function keyPressed(key: string | null | undefined, event: MouseEvent): boolean {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] ConditionalExpression
src/zoomPlugin.ts:220:10
 // ---- direction/mode helpers ----
 
 function getModifierKey(opts: { enabled?: boolean; modifierKey?: string | null } | undefined): string | null | undefined {
-  return opts && opts.enabled ? opts.modifierKey : undefined;
+  return false ? opts.modifierKey : undefined;
 }
 function keyPressed(key: string | null | undefined, event: MouseEvent): boolean {
killedBy: zoomPlugin wheel-zoom interaction rejects the wheel zoom (and calls onZoomRejected) when a required wheel modifier key is not held
statusReason: expected NaN to be undefined

[Killed] BlockStatement
src/zoomPlugin.ts:222:81
 function getModifierKey(opts: { enabled?: boolean; modifierKey?: string | null } | undefined): string | null | undefined {
   return opts && opts.enabled ? opts.modifierKey : undefined;
 }
-function keyPressed(key: string | null | undefined, event: MouseEvent): boolean {
-  return !!key && !!(event as unknown as Record<string, boolean>)[`${key}Key`];
-}
+function keyPressed(key: string | null | undefined, event: MouseEvent): boolean {}
 function keyNotPressed(key: string | null | undefined, event: MouseEvent): boolean {
   return !!key && !(event as unknown as Record<string, boolean>)[`${key}Key`];
killedBy: zoomPlugin drag-to-zoom-rectangle interaction rejects a drag-to-zoom start when the pan modifier key is held (pan takes priority over drag-zoom)
statusReason: expected 50 to be undefined

[Killed] BooleanLiteral
src/zoomPlugin.ts:223:11
   return opts && opts.enabled ? opts.modifierKey : undefined;
 }
 function keyPressed(key: string | null | undefined, event: MouseEvent): boolean {
-  return !!key && !!(event as unknown as Record<string, boolean>)[`${key}Key`];
+  return !key && !!(event as unknown as Record<string, boolean>)[`${key}Key`];
 }
 function keyNotPressed(key: string | null | undefined, event: MouseEvent): boolean {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction rejects a drag-to-zoom start when the pan modifier key is held (pan takes priority over drag-zoom)
statusReason: expected 50 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:223:10
   return opts && opts.enabled ? opts.modifierKey : undefined;
 }
 function keyPressed(key: string | null | undefined, event: MouseEvent): boolean {
-  return !!key && !!(event as unknown as Record<string, boolean>)[`${key}Key`];
+  return false;
 }
 function keyNotPressed(key: string | null | undefined, event: MouseEvent): boolean {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction rejects a drag-to-zoom start when the pan modifier key is held (pan takes priority over drag-zoom)
statusReason: expected 50 to be undefined

[Killed] BlockStatement
src/zoomPlugin.ts:225:84
 function keyPressed(key: string | null | undefined, event: MouseEvent): boolean {
   return !!key && !!(event as unknown as Record<string, boolean>)[`${key}Key`];
 }
-function keyNotPressed(key: string | null | undefined, event: MouseEvent): boolean {
-  return !!key && !(event as unknown as Record<string, boolean>)[`${key}Key`];
-}
+function keyNotPressed(key: string | null | undefined, event: MouseEvent): boolean {}
 function directionEnabled(mode: ZoomMode | undefined, dir: ZoomDirection, chart: Chart): boolean {
   if (mode === undefined) return true;
killedBy: zoomPlugin wheel-zoom interaction rejects the wheel zoom (and calls onZoomRejected) when a required wheel modifier key is not held
statusReason: expected NaN to be undefined

[Killed] LogicalOperator
src/zoomPlugin.ts:226:10
   return !!key && !!(event as unknown as Record<string, boolean>)[`${key}Key`];
 }
 function keyNotPressed(key: string | null | undefined, event: MouseEvent): boolean {
-  return !!key && !(event as unknown as Record<string, boolean>)[`${key}Key`];
+  return !!key || !(event as unknown as Record<string, boolean>)[`${key}Key`];
 }
 function directionEnabled(mode: ZoomMode | undefined, dir: ZoomDirection, chart: Chart): boolean {
killedBy: zoomPlugin wheel-zoom interaction zooms in on a real wheel event when wheel.enabled is true
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:226:10
   return !!key && !!(event as unknown as Record<string, boolean>)[`${key}Key`];
 }
 function keyNotPressed(key: string | null | undefined, event: MouseEvent): boolean {
-  return !!key && !(event as unknown as Record<string, boolean>)[`${key}Key`];
+  return false;
 }
 function directionEnabled(mode: ZoomMode | undefined, dir: ZoomDirection, chart: Chart): boolean {
killedBy: zoomPlugin wheel-zoom interaction rejects the wheel zoom (and calls onZoomRejected) when a required wheel modifier key is not held
statusReason: expected NaN to be undefined

[Killed] BlockStatement
src/zoomPlugin.ts:228:98
 function keyNotPressed(key: string | null | undefined, event: MouseEvent): boolean {
   return !!key && !(event as unknown as Record<string, boolean>)[`${key}Key`];
 }
-function directionEnabled(mode: ZoomMode | undefined, dir: ZoomDirection, chart: Chart): boolean {
-  if (mode === undefined) return true;
-  if (typeof mode === 'string') return mode.indexOf(dir) !== -1;
-  if (typeof mode === 'function') return mode({ chart }).indexOf(dir) !== -1;
-  return false;
-}
+function directionEnabled(mode: ZoomMode | undefined, dir: ZoomDirection, chart: Chart): boolean {}
 function directionsEnabled(mode: ZoomMode | undefined, chart: Chart): { x: boolean; y: boolean } {
   const resolved = typeof mode === 'function' ? mode({ chart }) : mode;
killedBy: zoomPlugin programmatic zoom() resolves mode as a function of the chart, not just a string literal
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/zoomPlugin.ts:229:7
   return !!key && !(event as unknown as Record<string, boolean>)[`${key}Key`];
 }
 function directionEnabled(mode: ZoomMode | undefined, dir: ZoomDirection, chart: Chart): boolean {
-  if (mode === undefined) return true;
+  if (mode !== undefined) return true;
   if (typeof mode === 'string') return mode.indexOf(dir) !== -1;
   if (typeof mode === 'function') return mode({ chart }).indexOf(dir) !== -1;
killedBy: zoomPlugin programmatic zoom() treats an unrecognized mode value as disabling every direction (the final false fallback)
statusReason: expected 100 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:229:7
   return !!key && !(event as unknown as Record<string, boolean>)[`${key}Key`];
 }
 function directionEnabled(mode: ZoomMode | undefined, dir: ZoomDirection, chart: Chart): boolean {
-  if (mode === undefined) return true;
+  if (true) return true;
   if (typeof mode === 'string') return mode.indexOf(dir) !== -1;
   if (typeof mode === 'function') return mode({ chart }).indexOf(dir) !== -1;
killedBy: zoomPlugin programmatic zoom() treats an unrecognized mode value as disabling every direction (the final false fallback)
statusReason: expected 100 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:230:7
 }
 function directionEnabled(mode: ZoomMode | undefined, dir: ZoomDirection, chart: Chart): boolean {
   if (mode === undefined) return true;
-  if (typeof mode === 'string') return mode.indexOf(dir) !== -1;
+  if (false) return mode.indexOf(dir) !== -1;
   if (typeof mode === 'function') return mode({ chart }).indexOf(dir) !== -1;
   return false;
killedBy: zoomPlugin programmatic zoom() treats an undefined zoom.mode as enabling every direction (directionEnabled's own default branch)
statusReason: expected undefined to be close to 100, received difference is NaN, but expected 0.000005

[Killed] ConditionalExpression
src/zoomPlugin.ts:230:7
 }
 function directionEnabled(mode: ZoomMode | undefined, dir: ZoomDirection, chart: Chart): boolean {
   if (mode === undefined) return true;
-  if (typeof mode === 'string') return mode.indexOf(dir) !== -1;
+  if (true) return mode.indexOf(dir) !== -1;
   if (typeof mode === 'function') return mode({ chart }).indexOf(dir) !== -1;
   return false;
killedBy: zoomPlugin programmatic zoom() resolves mode as a function of the chart, not just a string literal
statusReason: mode.indexOf is not a function

[Killed] ConditionalExpression
src/zoomPlugin.ts:231:7
 function directionEnabled(mode: ZoomMode | undefined, dir: ZoomDirection, chart: Chart): boolean {
   if (mode === undefined) return true;
   if (typeof mode === 'string') return mode.indexOf(dir) !== -1;
-  if (typeof mode === 'function') return mode({ chart }).indexOf(dir) !== -1;
+  if (false) return mode({ chart }).indexOf(dir) !== -1;
   return false;
 }
killedBy: zoomPlugin programmatic zoom() resolves mode as a function of the chart, not just a string literal
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:231:7
 function directionEnabled(mode: ZoomMode | undefined, dir: ZoomDirection, chart: Chart): boolean {
   if (mode === undefined) return true;
   if (typeof mode === 'string') return mode.indexOf(dir) !== -1;
-  if (typeof mode === 'function') return mode({ chart }).indexOf(dir) !== -1;
+  if (true) return mode({ chart }).indexOf(dir) !== -1;
   return false;
 }
killedBy: zoomPlugin programmatic zoom() treats an unrecognized mode value as disabling every direction (the final false fallback)
statusReason: mode is not a function

[Killed] BooleanLiteral
src/zoomPlugin.ts:232:10
   if (mode === undefined) return true;
   if (typeof mode === 'string') return mode.indexOf(dir) !== -1;
   if (typeof mode === 'function') return mode({ chart }).indexOf(dir) !== -1;
-  return false;
+  return true;
 }
 function directionsEnabled(mode: ZoomMode | undefined, chart: Chart): { x: boolean; y: boolean } {
killedBy: zoomPlugin programmatic zoom() treats an unrecognized mode value as disabling every direction (the final false fallback)
statusReason: expected 100 to be undefined

[Killed] BlockStatement
src/zoomPlugin.ts:234:98
   if (typeof mode === 'function') return mode({ chart }).indexOf(dir) !== -1;
   return false;
 }
-function directionsEnabled(mode: ZoomMode | undefined, chart: Chart): { x: boolean; y: boolean } {
-  const resolved = typeof mode === 'function' ? mode({ chart }) : mode;
-  if (typeof resolved === 'string') {
-    return { x: resolved.indexOf('x') !== -1, y: resolved.indexOf('y') !== -1 };
-  }
-  return { x: false, y: false };
-}
+function directionsEnabled(mode: ZoomMode | undefined, chart: Chart): { x: boolean; y: boolean } {}
 
 function debounce(fn: () => void, delay: number): () => number {
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] EqualityOperator
src/zoomPlugin.ts:235:20
   return false;
 }
 function directionsEnabled(mode: ZoomMode | undefined, chart: Chart): { x: boolean; y: boolean } {
-  const resolved = typeof mode === 'function' ? mode({ chart }) : mode;
+  const resolved = typeof mode !== 'function' ? mode({ chart }) : mode;
   if (typeof resolved === 'string') {
     return { x: resolved.indexOf('x') !== -1, y: resolved.indexOf('y') !== -1 };
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: mode is not a function

[Killed] ConditionalExpression
src/zoomPlugin.ts:235:20
   return false;
 }
 function directionsEnabled(mode: ZoomMode | undefined, chart: Chart): { x: boolean; y: boolean } {
-  const resolved = typeof mode === 'function' ? mode({ chart }) : mode;
+  const resolved = true ? mode({ chart }) : mode;
   if (typeof resolved === 'string') {
     return { x: resolved.indexOf('x') !== -1, y: resolved.indexOf('y') !== -1 };
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: mode is not a function

[Killed] ConditionalExpression
src/zoomPlugin.ts:236:7
 }
 function directionsEnabled(mode: ZoomMode | undefined, chart: Chart): { x: boolean; y: boolean } {
   const resolved = typeof mode === 'function' ? mode({ chart }) : mode;
-  if (typeof resolved === 'string') {
+  if (false) {
     return { x: resolved.indexOf('x') !== -1, y: resolved.indexOf('y') !== -1 };
   }
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/zoomPlugin.ts:236:7
 }
 function directionsEnabled(mode: ZoomMode | undefined, chart: Chart): { x: boolean; y: boolean } {
   const resolved = typeof mode === 'function' ? mode({ chart }) : mode;
-  if (typeof resolved === 'string') {
+  if (typeof resolved !== 'string') {
     return { x: resolved.indexOf('x') !== -1, y: resolved.indexOf('y') !== -1 };
   }
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'indexOf')

[Killed] ConditionalExpression
src/zoomPlugin.ts:237:50
 function directionsEnabled(mode: ZoomMode | undefined, chart: Chart): { x: boolean; y: boolean } {
   const resolved = typeof mode === 'function' ? mode({ chart }) : mode;
   if (typeof resolved === 'string') {
-    return { x: resolved.indexOf('x') !== -1, y: resolved.indexOf('y') !== -1 };
+    return { x: resolved.indexOf('x') !== -1, y: true };
   }
   return { x: false, y: false };
killedBy: zoomPlugin programmatic zoom() does not zoom a direction whose scale axis is disabled by mode
statusReason: expected 100 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:237:50
 function directionsEnabled(mode: ZoomMode | undefined, chart: Chart): { x: boolean; y: boolean } {
   const resolved = typeof mode === 'function' ? mode({ chart }) : mode;
   if (typeof resolved === 'string') {
-    return { x: resolved.indexOf('x') !== -1, y: resolved.indexOf('y') !== -1 };
+    return { x: resolved.indexOf('x') !== -1, y: false };
   }
   return { x: false, y: false };
killedBy: zoomPlugin programmatic zoom() zooms a y-axis scale directly via the programmatic API (not just through a drag)
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/zoomPlugin.ts:239:25
   if (typeof resolved === 'string') {
     return { x: resolved.indexOf('x') !== -1, y: resolved.indexOf('y') !== -1 };
   }
-  return { x: false, y: false };
+  return { x: false, y: true };
 }
 
killedBy: zoomPlugin programmatic zoom() does not zoom a direction whose scale axis is disabled by mode
statusReason: expected 100 to be undefined

[Survived] BooleanLiteral
src/zoomPlugin.ts:239:15
   if (typeof resolved === 'string') {
     return { x: resolved.indexOf('x') !== -1, y: resolved.indexOf('y') !== -1 };
   }
-  return { x: false, y: false };
+  return { x: true, y: false };
 }
 

[Killed] BlockStatement
src/zoomPlugin.ts:242:64
   return { x: false, y: false };
 }
 
-function debounce(fn: () => void, delay: number): () => number {
-  let timeout: ReturnType<typeof setTimeout>;
-  return function debounced(): number {
-    clearTimeout(timeout);
-    timeout = setTimeout(fn, delay);
-    return delay;
-  };
-}
+function debounce(fn: () => void, delay: number): () => number {}
 
 function getScaleUnderPoint(point: ScreenPoint, chart: Chart): LiveScale | null {
killedBy: zoomPlugin wheel-zoom interaction calls the debounced onZoomComplete callback after a real wheel zoom
statusReason: expected "spy" to be called at least once

[Killed] BlockStatement
src/zoomPlugin.ts:244:39
 
 function debounce(fn: () => void, delay: number): () => number {
   let timeout: ReturnType<typeof setTimeout>;
-  return function debounced(): number {
-    clearTimeout(timeout);
-    timeout = setTimeout(fn, delay);
-    return delay;
-  };
+  return function debounced(): number {};
 }
 
killedBy: zoomPlugin wheel-zoom interaction calls the debounced onZoomComplete callback after a real wheel zoom
statusReason: expected "spy" to be called at least once

[Killed] BlockStatement
src/zoomPlugin.ts:251:81
   };
 }
 
-function getScaleUnderPoint(point: ScreenPoint, chart: Chart): LiveScale | null {
-  for (const scale of liveScales(chart)) {
-    if (point.y >= scale.top && point.y <= scale.bottom && point.x >= scale.left && point.x <= scale.right) {
-      return scale;
-    }
-  }
-  return null;
-}
+function getScaleUnderPoint(point: ScreenPoint, chart: Chart): LiveScale | null {}
 
 function getEnabledScalesByPoint(
killedBy: zoomPlugin precise mutation-hardening: modifier keys, direction helpers, scale-point geometry getScaleUnderPoint: matches exactly at each of its own four boundary edges (top/bottom/left/right inclusiv
statusReason: expected 10 to be undefined

[Killed] BlockStatement
src/zoomPlugin.ts:252:42
 }
 
 function getScaleUnderPoint(point: ScreenPoint, chart: Chart): LiveScale | null {
-  for (const scale of liveScales(chart)) {
-    if (point.y >= scale.top && point.y <= scale.bottom && point.x >= scale.left && point.x <= scale.right) {
-      return scale;
-    }
-  }
+  for (const scale of liveScales(chart)) {}
   return null;
 }
killedBy: zoomPlugin precise mutation-hardening: modifier keys, direction helpers, scale-point geometry getScaleUnderPoint: matches exactly at each of its own four boundary edges (top/bottom/left/right inclusiv
statusReason: expected 10 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:253:85
 
 function getScaleUnderPoint(point: ScreenPoint, chart: Chart): LiveScale | null {
   for (const scale of liveScales(chart)) {
-    if (point.y >= scale.top && point.y <= scale.bottom && point.x >= scale.left && point.x <= scale.right) {
+    if (point.y >= scale.top && point.y <= scale.bottom && point.x >= scale.left && true) {
       return scale;
     }
killedBy: zoomPlugin precise mutation-hardening: modifier keys, direction helpers, scale-point geometry getScaleUnderPoint: a point far outside on the x-axis alone does not match (kills && → || across the full 
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/zoomPlugin.ts:253:9
 
 function getScaleUnderPoint(point: ScreenPoint, chart: Chart): LiveScale | null {
   for (const scale of liveScales(chart)) {
-    if (point.y >= scale.top && point.y <= scale.bottom && point.x >= scale.left && point.x <= scale.right) {
+    if (point.y >= scale.top && point.y <= scale.bottom && point.x >= scale.left || point.x <= scale.right) {
       return scale;
     }
killedBy: zoomPlugin precise mutation-hardening: modifier keys, direction helpers, scale-point geometry getScaleUnderPoint: a point far outside on the x-axis alone does not match (kills && → || across the full 
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/zoomPlugin.ts:264:16
   options: { mode?: ZoomMode; scaleMode?: ZoomMode; overScaleMode?: ZoomMode } | undefined,
   point: ScreenPoint,
   chart: Chart,
-): LiveScale[] {
-  const { mode = 'xy', scaleMode, overScaleMode } = options ?? {};
-  const scale = getScaleUnderPoint(point, chart);
-  const enabled = directionsEnabled(mode, chart);
-  const scaleEnabled = directionsEnabled(scaleMode, chart);
-  if (overScaleMode) {
-    const overScaleEnabled = directionsEnabled(overScaleMode, chart);
-    for (const axis of ['x', 'y'] as const) {
-      if (overScaleEnabled[axis]) {
-        scaleEnabled[axis] = enabled[axis];
-        enabled[axis] = false;
-      }
-    }
-  }
-  if (scale && scaleEnabled[scale.axis as 'x' | 'y']) {
-    return [scale];
-  }
-  return liveScales(chart).filter((scaleItem) => enabled[scaleItem.axis as 'x' | 'y']);
-}
+): LiveScale[] {}
 
 // ---- zoom/pan math, per scale type ----
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: enabledScales is not iterable

[Killed] LogicalOperator
src/zoomPlugin.ts:265:53
   point: ScreenPoint,
   chart: Chart,
 ): LiveScale[] {
-  const { mode = 'xy', scaleMode, overScaleMode } = options ?? {};
+  const { mode = 'xy', scaleMode, overScaleMode } = options && {};
   const scale = getScaleUnderPoint(point, chart);
   const enabled = directionsEnabled(mode, chart);
killedBy: zoomPlugin programmatic zoom() does not zoom a direction whose scale axis is disabled by mode
statusReason: expected 100 to be undefined

[Survived] ConditionalExpression
src/zoomPlugin.ts:269:7
   const scale = getScaleUnderPoint(point, chart);
   const enabled = directionsEnabled(mode, chart);
   const scaleEnabled = directionsEnabled(scaleMode, chart);
-  if (overScaleMode) {
+  if (false) {
     const overScaleEnabled = directionsEnabled(overScaleMode, chart);
     for (const axis of ['x', 'y'] as const) {

[Survived] BlockStatement
src/zoomPlugin.ts:269:22
   const scale = getScaleUnderPoint(point, chart);
   const enabled = directionsEnabled(mode, chart);
   const scaleEnabled = directionsEnabled(scaleMode, chart);
-  if (overScaleMode) {
-    const overScaleEnabled = directionsEnabled(overScaleMode, chart);
-    for (const axis of ['x', 'y'] as const) {
-      if (overScaleEnabled[axis]) {
-        scaleEnabled[axis] = enabled[axis];
-        enabled[axis] = false;
-      }
-    }
-  }
+  if (overScaleMode) {}
   if (scale && scaleEnabled[scale.axis as 'x' | 'y']) {
     return [scale];

[Survived] BlockStatement
src/zoomPlugin.ts:271:45
   const scaleEnabled = directionsEnabled(scaleMode, chart);
   if (overScaleMode) {
     const overScaleEnabled = directionsEnabled(overScaleMode, chart);
-    for (const axis of ['x', 'y'] as const) {
-      if (overScaleEnabled[axis]) {
-        scaleEnabled[axis] = enabled[axis];
-        enabled[axis] = false;
-      }
-    }
+    for (const axis of ['x', 'y'] as const) {}
   }
   if (scale && scaleEnabled[scale.axis as 'x' | 'y']) {

[Survived] ConditionalExpression
src/zoomPlugin.ts:272:11
   if (overScaleMode) {
     const overScaleEnabled = directionsEnabled(overScaleMode, chart);
     for (const axis of ['x', 'y'] as const) {
-      if (overScaleEnabled[axis]) {
+      if (false) {
         scaleEnabled[axis] = enabled[axis];
         enabled[axis] = false;

[Survived] BlockStatement
src/zoomPlugin.ts:272:35
   if (overScaleMode) {
     const overScaleEnabled = directionsEnabled(overScaleMode, chart);
     for (const axis of ['x', 'y'] as const) {
-      if (overScaleEnabled[axis]) {
-        scaleEnabled[axis] = enabled[axis];
-        enabled[axis] = false;
-      }
+      if (overScaleEnabled[axis]) {}
     }
   }

[Survived] BooleanLiteral
src/zoomPlugin.ts:274:25
     for (const axis of ['x', 'y'] as const) {
       if (overScaleEnabled[axis]) {
         scaleEnabled[axis] = enabled[axis];
-        enabled[axis] = false;
+        enabled[axis] = true;
       }
     }

[Killed] ConditionalExpression
src/zoomPlugin.ts:278:7
       }
     }
   }
-  if (scale && scaleEnabled[scale.axis as 'x' | 'y']) {
+  if (true) {
     return [scale];
   }
killedBy: zoomPlugin programmatic zoom() does not zoom a direction whose scale axis is disabled by mode
statusReason: expected 100 to be undefined
