[Killed] BlockStatement
src/gradientPlugin.ts:113:72
 const chartStates = new WeakMap<Chart, GradientPluginState>();
 
 /** Narrows a `Scale` to `RadialLinearScale` (polar/radar's own `'r'` axis). */
-function isRadialLinearScale(scale: Scale): scale is RadialLinearScale {
-  return scale.type === 'radialLinear';
-}
+function isRadialLinearScale(scale: Scale): scale is RadialLinearScale {}
 
 /**
killedBy: gradientPlugin beforeDatasetsUpdate creates a radial gradient for the r axis
statusReason: Cannot read properties of undefined (reading 'reverse')

[Killed] EqualityOperator
src/gradientPlugin.ts:114:10
 
 /** Narrows a `Scale` to `RadialLinearScale` (polar/radar's own `'r'` axis). */
 function isRadialLinearScale(scale: Scale): scale is RadialLinearScale {
-  return scale.type === 'radialLinear';
+  return scale.type !== 'radialLinear';
 }
 
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: scale.getDistanceFromCenterForValue is not a function

[Killed] ConditionalExpression
src/gradientPlugin.ts:114:10
 
 /** Narrows a `Scale` to `RadialLinearScale` (polar/radar's own `'r'` axis). */
 function isRadialLinearScale(scale: Scale): scale is RadialLinearScale {
-  return scale.type === 'radialLinear';
+  return false;
 }
 
killedBy: gradientPlugin beforeDatasetsUpdate creates a radial gradient for the r axis
statusReason: Cannot read properties of undefined (reading 'reverse')

[Killed] BlockStatement
src/gradientPlugin.ts:121:76
  * Confirms an area has real, positive width and height — a gradient
  * can't be created against a zero-size area.
  */
-function areaIsValid(area: LinearBounds | undefined): area is LinearBounds {
-  return !!area && area.right > area.left && area.bottom > area.top;
-}
+function areaIsValid(area: LinearBounds | undefined): area is LinearBounds {}
 
 /**
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] EqualityOperator
src/gradientPlugin.ts:122:20
  * can't be created against a zero-size area.
  */
 function areaIsValid(area: LinearBounds | undefined): area is LinearBounds {
-  return !!area && area.right > area.left && area.bottom > area.top;
+  return !!area && area.right <= area.left && area.bottom > area.top;
 }
 
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/gradientPlugin.ts:122:10
  * can't be created against a zero-size area.
  */
 function areaIsValid(area: LinearBounds | undefined): area is LinearBounds {
-  return !!area && area.right > area.left && area.bottom > area.top;
+  return true;
 }
 
killedBy: gradientPlugin afterUpdate does nothing when the computed legend-swatch area is invalid (labels.boxWidth left unset, defaulting to 0)
statusReason: expected { addColorStop: [Function spy] } to be undefined

[Killed] BlockStatement
src/gradientPlugin.ts:134:58
  * type). No cast needed either way — both shapes are genuinely, fully
  * typed by Chart.js itself.
  */
-function scaleToGradientArea(scale: Scale): GradientArea {
-  const { left, top, right, bottom } = scale;
-  if (isRadialLinearScale(scale)) {
-    return { left, top, right, bottom, xCenter: scale.xCenter, yCenter: scale.yCenter, drawingArea: scale.drawingArea };
-  }
-  return { left, top, right, bottom };
-}
+function scaleToGradientArea(scale: Scale): GradientArea {}
 
 /**
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: Cannot read properties of undefined (reading 'left')

[Survived] ConditionalExpression
src/gradientPlugin.ts:136:7
  */
 function scaleToGradientArea(scale: Scale): GradientArea {
   const { left, top, right, bottom } = scale;
-  if (isRadialLinearScale(scale)) {
+  if (false) {
     return { left, top, right, bottom, xCenter: scale.xCenter, yCenter: scale.yCenter, drawingArea: scale.drawingArea };
   }

[Survived] ConditionalExpression
src/gradientPlugin.ts:136:7
  */
 function scaleToGradientArea(scale: Scale): GradientArea {
   const { left, top, right, bottom } = scale;
-  if (isRadialLinearScale(scale)) {
+  if (true) {
     return { left, top, right, bottom, xCenter: scale.xCenter, yCenter: scale.yCenter, drawingArea: scale.drawingArea };
   }

[Killed] ObjectLiteral
src/gradientPlugin.ts:139:10
   if (isRadialLinearScale(scale)) {
     return { left, top, right, bottom, xCenter: scale.xCenter, yCenter: scale.yCenter, drawingArea: scale.drawingArea };
   }
-  return { left, top, right, bottom };
+  return {};
 }
 
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient along the y axis specifically (using top/bottom, not left/right)
statusReason: expected "spy" to be called with arguments: [ +0, 100, +0, +0 ]

Received: 

  1st spy call:

  Array [
    0,

[Killed] BlockStatement
src/gradientPlugin.ts:146:112
  * Creates the real `CanvasGradient` for a given axis: radial for `'r'`
  * (polar/radar scales), otherwise linear along `'x'` or `'y'`.
  */
-function createGradient(ctx: CanvasRenderingContext2D, axis: GradientAxis, area: GradientArea): CanvasGradient {
-  if (axis === 'r') {
-    const { xCenter = 0, yCenter = 0, drawingArea = 0 } = area;
-    return ctx.createRadialGradient(xCenter, yCenter, 0, xCenter, yCenter, drawingArea);
-  }
-  if (axis === 'y') {
-    return ctx.createLinearGradient(0, area.bottom, 0, area.top);
-  }
-  return ctx.createLinearGradient(area.left, 0, area.right, 0);
-}
+function createGradient(ctx: CanvasRenderingContext2D, axis: GradientAxis, area: GradientArea): CanvasGradient {}
 
 /** Adds each stop color to a real `CanvasGradient`, in order. */
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: Cannot read properties of undefined (reading 'addColorStop')

[Killed] ConditionalExpression
src/gradientPlugin.ts:147:7
  * (polar/radar scales), otherwise linear along `'x'` or `'y'`.
  */
 function createGradient(ctx: CanvasRenderingContext2D, axis: GradientAxis, area: GradientArea): CanvasGradient {
-  if (axis === 'r') {
+  if (true) {
     const { xCenter = 0, yCenter = 0, drawingArea = 0 } = area;
     return ctx.createRadialGradient(xCenter, yCenter, 0, xCenter, yCenter, drawingArea);
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/gradientPlugin.ts:147:7
  * (polar/radar scales), otherwise linear along `'x'` or `'y'`.
  */
 function createGradient(ctx: CanvasRenderingContext2D, axis: GradientAxis, area: GradientArea): CanvasGradient {
-  if (axis === 'r') {
+  if (axis !== 'r') {
     const { xCenter = 0, yCenter = 0, drawingArea = 0 } = area;
     return ctx.createRadialGradient(xCenter, yCenter, 0, xCenter, yCenter, drawingArea);
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/gradientPlugin.ts:151:7
     const { xCenter = 0, yCenter = 0, drawingArea = 0 } = area;
     return ctx.createRadialGradient(xCenter, yCenter, 0, xCenter, yCenter, drawingArea);
   }
-  if (axis === 'y') {
+  if (false) {
     return ctx.createLinearGradient(0, area.bottom, 0, area.top);
   }
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient along the y axis specifically (using top/bottom, not left/right)
statusReason: expected "spy" to be called with arguments: [ +0, 100, +0, +0 ]

Received: 

  1st spy call:

  Array [
    0,

[Killed] EqualityOperator
src/gradientPlugin.ts:151:7
     const { xCenter = 0, yCenter = 0, drawingArea = 0 } = area;
     return ctx.createRadialGradient(xCenter, yCenter, 0, xCenter, yCenter, drawingArea);
   }
-  if (axis === 'y') {
+  if (axis !== 'y') {
     return ctx.createLinearGradient(0, area.bottom, 0, area.top);
   }
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient along the y axis specifically (using top/bottom, not left/right)
statusReason: expected "spy" to be called with arguments: [ +0, 100, +0, +0 ]

Received: 

  1st spy call:

  Array [
    0,

[Killed] BlockStatement
src/gradientPlugin.ts:158:83
 }
 
 /** Adds each stop color to a real `CanvasGradient`, in order. */
-function applyColorStops(gradient: CanvasGradient, stopColors: StopColor[]): void {
-  for (const item of stopColors) {
-    gradient.addColorStop(item.stop, item.color.rgbString());
-  }
-}
+function applyColorStops(gradient: CanvasGradient, stopColors: StopColor[]): void {}
 
 /**
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] BlockStatement
src/gradientPlugin.ts:159:34
 
 /** Adds each stop color to a real `CanvasGradient`, in order. */
 function applyColorStops(gradient: CanvasGradient, stopColors: StopColor[]): void {
-  for (const item of stopColors) {
-    gradient.addColorStop(item.stop, item.color.rgbString());
-  }
+  for (const item of stopColors) {}
 }
 
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] BlockStatement
src/gradientPlugin.ts:169:94
  * a scale — the radial-scale (`'radialLinear'`) case uses distance from
  * center instead of a pixel-for-value lookup.
  */
-function getPixelStop(scale: Scale, value: string | number): { pixel: number; stop: number } {
-  if (isRadialLinearScale(scale)) {
-    const distance = scale.getDistanceFromCenterForValue(Number(value));
-    return { pixel: distance, stop: distance / scale.drawingArea };
-  }
-  const reverse = (scale.options as { reverse?: boolean }).reverse ?? false;
-  const normValue = isNumber(value) ? value : Number(scale.parse(value));
-  const pixel = scale.getPixelForValue(normValue);
-  const stop = scale.getDecimalForPixel(pixel);
-  return { pixel, stop: reverse ? 1 - stop : stop };
-}
+function getPixelStop(scale: Scale, value: string | number): { pixel: number; stop: number } {}
 
 // IEC 61966-2-1:1999 sRGB <-> linear-light conversion, for perceptually
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: Cannot destructure property 'pixel' of 'getPixelStop(...)' as it is undefined.

[Killed] BlockStatement
src/gradientPlugin.ts:170:35
  * center instead of a pixel-for-value lookup.
  */
 function getPixelStop(scale: Scale, value: string | number): { pixel: number; stop: number } {
-  if (isRadialLinearScale(scale)) {
-    const distance = scale.getDistanceFromCenterForValue(Number(value));
-    return { pixel: distance, stop: distance / scale.drawingArea };
-  }
+  if (isRadialLinearScale(scale)) {}
   const reverse = (scale.options as { reverse?: boolean }).reverse ?? false;
   const normValue = isNumber(value) ? value : Number(scale.parse(value));
killedBy: gradientPlugin beforeDatasetsUpdate creates a radial gradient for the r axis
statusReason: Cannot read properties of undefined (reading 'reverse')

[Killed] ConditionalExpression
src/gradientPlugin.ts:170:7
  * center instead of a pixel-for-value lookup.
  */
 function getPixelStop(scale: Scale, value: string | number): { pixel: number; stop: number } {
-  if (isRadialLinearScale(scale)) {
+  if (false) {
     const distance = scale.getDistanceFromCenterForValue(Number(value));
     return { pixel: distance, stop: distance / scale.drawingArea };
killedBy: gradientPlugin beforeDatasetsUpdate creates a radial gradient for the r axis
statusReason: Cannot read properties of undefined (reading 'reverse')

[Survived] ArithmeticOperator
src/gradientPlugin.ts:172:37
 function getPixelStop(scale: Scale, value: string | number): { pixel: number; stop: number } {
   if (isRadialLinearScale(scale)) {
     const distance = scale.getDistanceFromCenterForValue(Number(value));
-    return { pixel: distance, stop: distance / scale.drawingArea };
+    return { pixel: distance, stop: distance * scale.drawingArea };
   }
   const reverse = (scale.options as { reverse?: boolean }).reverse ?? false;

[Killed] LogicalOperator
src/gradientPlugin.ts:174:19
     const distance = scale.getDistanceFromCenterForValue(Number(value));
     return { pixel: distance, stop: distance / scale.drawingArea };
   }
-  const reverse = (scale.options as { reverse?: boolean }).reverse ?? false;
+  const reverse = (scale.options as {
+  reverse?: boolean;
+}).reverse && false;
   const normValue = isNumber(value) ? value : Number(scale.parse(value));
   const pixel = scale.getPixelForValue(normValue);
killedBy: gradientPlugin beforeDatasetsUpdate reverses the stop percentage when the scale itself is reversed
statusReason: expected 1 to be close to +0, received difference is 1, but expected 0.000005

[Killed] BooleanLiteral
src/gradientPlugin.ts:174:71
     const distance = scale.getDistanceFromCenterForValue(Number(value));
     return { pixel: distance, stop: distance / scale.drawingArea };
   }
-  const reverse = (scale.options as { reverse?: boolean }).reverse ?? false;
+  const reverse = (scale.options as { reverse?: boolean }).reverse ?? true;
   const normValue = isNumber(value) ? value : Number(scale.parse(value));
   const pixel = scale.getPixelForValue(normValue);
killedBy: gradientPlugin beforeDatasetsUpdate treats a scale with no explicit reverse option as non-reversed (the ?? false fallback)
statusReason: expected +0 to be close to 1, received difference is 1, but expected 0.000005

[Killed] ArithmeticOperator
src/gradientPlugin.ts:178:35
   const normValue = isNumber(value) ? value : Number(scale.parse(value));
   const pixel = scale.getPixelForValue(normValue);
   const stop = scale.getDecimalForPixel(pixel);
-  return { pixel, stop: reverse ? 1 - stop : stop };
+  return { pixel, stop: reverse ? 1 + stop : stop };
 }
 
killedBy: gradientPlugin beforeDatasetsUpdate reverses the stop percentage when the scale itself is reversed
statusReason: expected 1 to be close to +0, received difference is 1, but expected 0.000005

[Survived] ArrowFunction
src/gradientPlugin.ts:183:16
 
 // IEC 61966-2-1:1999 sRGB <-> linear-light conversion, for perceptually
 // correct (gamma-aware) color interpolation rather than naive RGB lerp.
-const toSRGB = (linear: number): number => (linear <= 0.0031308 ? linear * 12.92 : Math.pow(linear, 1 / 2.4) * 1.055 - 0.055);
+const toSRGB = () => undefined;
 const fromSRGB = (srgb: number): number => (srgb <= 0.04045 ? srgb / 12.92 : Math.pow((srgb + 0.055) / 1.055, 2.4));
 

[Survived] ConditionalExpression
src/gradientPlugin.ts:183:45
 
 // IEC 61966-2-1:1999 sRGB <-> linear-light conversion, for perceptually
 // correct (gamma-aware) color interpolation rather than naive RGB lerp.
-const toSRGB = (linear: number): number => (linear <= 0.0031308 ? linear * 12.92 : Math.pow(linear, 1 / 2.4) * 1.055 - 0.055);
+const toSRGB = (linear: number): number => (false ? linear * 12.92 : Math.pow(linear, 1 / 2.4) * 1.055 - 0.055);
 const fromSRGB = (srgb: number): number => (srgb <= 0.04045 ? srgb / 12.92 : Math.pow((srgb + 0.055) / 1.055, 2.4));
 

[Survived] ArrowFunction
src/gradientPlugin.ts:184:18
 // IEC 61966-2-1:1999 sRGB <-> linear-light conversion, for perceptually
 // correct (gamma-aware) color interpolation rather than naive RGB lerp.
 const toSRGB = (linear: number): number => (linear <= 0.0031308 ? linear * 12.92 : Math.pow(linear, 1 / 2.4) * 1.055 - 0.055);
-const fromSRGB = (srgb: number): number => (srgb <= 0.04045 ? srgb / 12.92 : Math.pow((srgb + 0.055) / 1.055, 2.4));
+const fromSRGB = () => undefined;
 
 /**

[Survived] ArithmeticOperator
src/gradientPlugin.ts:184:87
 // IEC 61966-2-1:1999 sRGB <-> linear-light conversion, for perceptually
 // correct (gamma-aware) color interpolation rather than naive RGB lerp.
 const toSRGB = (linear: number): number => (linear <= 0.0031308 ? linear * 12.92 : Math.pow(linear, 1 / 2.4) * 1.055 - 0.055);
-const fromSRGB = (srgb: number): number => (srgb <= 0.04045 ? srgb / 12.92 : Math.pow((srgb + 0.055) / 1.055, 2.4));
+const fromSRGB = (srgb: number): number => (srgb <= 0.04045 ? srgb / 12.92 : Math.pow((srgb + 0.055) * 1.055, 2.4));
 
 /**

[Killed] BlockStatement
src/gradientPlugin.ts:191:90
  * in linear-light space (via the sRGB conversion above) rather than
  * naive channel averaging, for a perceptually smoother result.
  */
-function interpolateColor(percent: number, start: StopColor, end: StopColor): ChartColor {
-  const s = start.color.rgb;
-  const e = end.color.rgb;
-  const sR = fromSRGB(s.r / 255);
-  const sG = fromSRGB(s.g / 255);
-  const sB = fromSRGB(s.b / 255);
-  const eR = fromSRGB(e.r / 255);
-  const eG = fromSRGB(e.g / 255);
-  const eB = fromSRGB(e.b / 255);
-  return color({
-    r: Math.round(toSRGB(sR + percent * (eR - sR)) * 255),
-    g: Math.round(toSRGB(sG + percent * (eG - sG)) * 255),
-    b: Math.round(toSRGB(sB + percent * (eB - sB)) * 255),
-    a: s.a + percent * Math.abs(e.a - s.a),
-  } as RGBAColor);
-}
+function interpolateColor(percent: number, start: StopColor, end: StopColor): ChartColor {}
 
 /** Looks up this dataset's own gradient state for a given dataset property (e.g. `'backgroundColor'`). */
killedBy: gradientPlugin afterUpdate interpolates a color for a per-data-point legend swatch whose raw value falls between two stops
statusReason: expected undefined to deeply equal Any<String>

[Survived] ArithmeticOperator
src/gradientPlugin.ts:194:23
 function interpolateColor(percent: number, start: StopColor, end: StopColor): ChartColor {
   const s = start.color.rgb;
   const e = end.color.rgb;
-  const sR = fromSRGB(s.r / 255);
+  const sR = fromSRGB(s.r * 255);
   const sG = fromSRGB(s.g / 255);
   const sB = fromSRGB(s.b / 255);

[Survived] ArithmeticOperator
src/gradientPlugin.ts:195:23
   const s = start.color.rgb;
   const e = end.color.rgb;
   const sR = fromSRGB(s.r / 255);
-  const sG = fromSRGB(s.g / 255);
+  const sG = fromSRGB(s.g * 255);
   const sB = fromSRGB(s.b / 255);
   const eR = fromSRGB(e.r / 255);

[Survived] ArithmeticOperator
src/gradientPlugin.ts:196:23
   const e = end.color.rgb;
   const sR = fromSRGB(s.r / 255);
   const sG = fromSRGB(s.g / 255);
-  const sB = fromSRGB(s.b / 255);
+  const sB = fromSRGB(s.b * 255);
   const eR = fromSRGB(e.r / 255);
   const eG = fromSRGB(e.g / 255);

[Survived] ArithmeticOperator
src/gradientPlugin.ts:197:23
   const sR = fromSRGB(s.r / 255);
   const sG = fromSRGB(s.g / 255);
   const sB = fromSRGB(s.b / 255);
-  const eR = fromSRGB(e.r / 255);
+  const eR = fromSRGB(e.r * 255);
   const eG = fromSRGB(e.g / 255);
   const eB = fromSRGB(e.b / 255);

[Survived] ArithmeticOperator
src/gradientPlugin.ts:198:23
   const sG = fromSRGB(s.g / 255);
   const sB = fromSRGB(s.b / 255);
   const eR = fromSRGB(e.r / 255);
-  const eG = fromSRGB(e.g / 255);
+  const eG = fromSRGB(e.g * 255);
   const eB = fromSRGB(e.b / 255);
   return color({

[Survived] ArithmeticOperator
src/gradientPlugin.ts:199:23
   const sB = fromSRGB(s.b / 255);
   const eR = fromSRGB(e.r / 255);
   const eG = fromSRGB(e.g / 255);
-  const eB = fromSRGB(e.b / 255);
+  const eB = fromSRGB(e.b * 255);
   return color({
     r: Math.round(toSRGB(sR + percent * (eR - sR)) * 255),

[Killed] BlockStatement
src/gradientPlugin.ts:209:124
 }
 
 /** Looks up this dataset's own gradient state for a given dataset property (e.g. `'backgroundColor'`). */
-function getGradientState(state: GradientPluginState, key: string, datasetIndex: number): DatasetGradientState | undefined {
-  const entries = state.options.get(key);
-  return entries?.find((el) => el.datasetIndex === datasetIndex);
-}
+function getGradientState(state: GradientPluginState, key: string, datasetIndex: number): DatasetGradientState | undefined {}
 
 /**
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] EqualityOperator
src/gradientPlugin.ts:211:32
 /** Looks up this dataset's own gradient state for a given dataset property (e.g. `'backgroundColor'`). */
 function getGradientState(state: GradientPluginState, key: string, datasetIndex: number): DatasetGradientState | undefined {
   const entries = state.options.get(key);
-  return entries?.find((el) => el.datasetIndex === datasetIndex);
+  return entries?.find((el) => el.datasetIndex !== datasetIndex);
 }
 
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] ConditionalExpression
src/gradientPlugin.ts:211:32
 /** Looks up this dataset's own gradient state for a given dataset property (e.g. `'backgroundColor'`). */
 function getGradientState(state: GradientPluginState, key: string, datasetIndex: number): DatasetGradientState | undefined {
   const entries = state.options.get(key);
-  return entries?.find((el) => el.datasetIndex === datasetIndex);
+  return entries?.find((el) => false);
 }
 
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] BlockStatement
src/gradientPlugin.ts:225:27
   key: string,
   datasetIndex: number,
   value: number,
-): ChartColor | undefined {
-  const data = getGradientState(state, key, datasetIndex);
-  if (!data || data.stopColors.length === 0) return undefined;
-
-  const { stop: percent } = getPixelStop(data.scale, value);
-  let startColor: StopColor | undefined;
-  let endColor: StopColor | undefined;
-  for (const stopColor of data.stopColors) {
-    if (stopColor.stop === percent) return stopColor.color;
-    if (stopColor.stop < percent) {
-      startColor = stopColor;
-    } else if (stopColor.stop > percent && !endColor) {
-      endColor = stopColor;
-    }
-  }
-  if (!endColor) return startColor?.color;
-  if (!startColor) return endColor.color;
-  return interpolateColor(percent, startColor, endColor);
-}
+): ChartColor | undefined {}
 
 const LEGEND_KEYS: Array<{ key: 'backgroundColor' | 'borderColor'; legendItemKey: 'fillStyle' | 'strokeStyle' }> = [
killedBy: gradientPlugin afterUpdate applies an exact-match stop color directly to a per-data-point legend swatch (doughnut/radar-style legends)
statusReason: expected undefined to be 'rgb(255, 0, 0)' // Object.is equality

[Killed] ConditionalExpression
src/gradientPlugin.ts:227:7
   value: number,
 ): ChartColor | undefined {
   const data = getGradientState(state, key, datasetIndex);
-  if (!data || data.stopColors.length === 0) return undefined;
+  if (true) return undefined;
 
   const { stop: percent } = getPixelStop(data.scale, value);
killedBy: gradientPlugin afterUpdate applies an exact-match stop color directly to a per-data-point legend swatch (doughnut/radar-style legends)
statusReason: expected undefined to be 'rgb(255, 0, 0)' // Object.is equality

[Killed] BooleanLiteral
src/gradientPlugin.ts:227:7
   value: number,
 ): ChartColor | undefined {
   const data = getGradientState(state, key, datasetIndex);
-  if (!data || data.stopColors.length === 0) return undefined;
+  if (data || data.stopColors.length === 0) return undefined;
 
   const { stop: percent } = getPixelStop(data.scale, value);
killedBy: gradientPlugin afterUpdate applies an exact-match stop color directly to a per-data-point legend swatch (doughnut/radar-style legends)
statusReason: Cannot read properties of undefined (reading 'stopColors')

[Killed] BlockStatement
src/gradientPlugin.ts:232:44
   const { stop: percent } = getPixelStop(data.scale, value);
   let startColor: StopColor | undefined;
   let endColor: StopColor | undefined;
-  for (const stopColor of data.stopColors) {
-    if (stopColor.stop === percent) return stopColor.color;
-    if (stopColor.stop < percent) {
-      startColor = stopColor;
-    } else if (stopColor.stop > percent && !endColor) {
-      endColor = stopColor;
-    }
-  }
+  for (const stopColor of data.stopColors) {}
   if (!endColor) return startColor?.color;
   if (!startColor) return endColor.color;
killedBy: gradientPlugin afterUpdate applies an exact-match stop color directly to a per-data-point legend swatch (doughnut/radar-style legends)
statusReason: expected undefined to be 'rgb(255, 0, 0)' // Object.is equality

[Killed] ConditionalExpression
src/gradientPlugin.ts:233:9
   let startColor: StopColor | undefined;
   let endColor: StopColor | undefined;
   for (const stopColor of data.stopColors) {
-    if (stopColor.stop === percent) return stopColor.color;
+    if (false) return stopColor.color;
     if (stopColor.stop < percent) {
       startColor = stopColor;
killedBy: gradientPlugin afterUpdate applies an exact-match stop color directly to a per-data-point legend swatch (doughnut/radar-style legends)
statusReason: expected 'rgb(0, 0, 255)' to be 'rgb(255, 0, 0)' // Object.is equality

[Killed] ConditionalExpression
src/gradientPlugin.ts:233:9
   let startColor: StopColor | undefined;
   let endColor: StopColor | undefined;
   for (const stopColor of data.stopColors) {
-    if (stopColor.stop === percent) return stopColor.color;
+    if (true) return stopColor.color;
     if (stopColor.stop < percent) {
       startColor = stopColor;
killedBy: gradientPlugin afterUpdate interpolates a color for a per-data-point legend swatch whose raw value falls between two stops
statusReason: expected 'rgb(255, 0, 0)' not to be 'rgb(255, 0, 0)' // Object.is equality

[Killed] EqualityOperator
src/gradientPlugin.ts:234:9
   let endColor: StopColor | undefined;
   for (const stopColor of data.stopColors) {
     if (stopColor.stop === percent) return stopColor.color;
-    if (stopColor.stop < percent) {
+    if (stopColor.stop >= percent) {
       startColor = stopColor;
     } else if (stopColor.stop > percent && !endColor) {
killedBy: gradientPlugin afterUpdate interpolates a color for a per-data-point legend swatch whose raw value falls between two stops
statusReason: expected 'rgb(0, 0, 255)' not to be 'rgb(0, 0, 255)' // Object.is equality

[Killed] ConditionalExpression
src/gradientPlugin.ts:234:9
   let endColor: StopColor | undefined;
   for (const stopColor of data.stopColors) {
     if (stopColor.stop === percent) return stopColor.color;
-    if (stopColor.stop < percent) {
+    if (true) {
       startColor = stopColor;
     } else if (stopColor.stop > percent && !endColor) {
killedBy: gradientPlugin afterUpdate interpolates a color for a per-data-point legend swatch whose raw value falls between two stops
statusReason: expected 'rgb(0, 0, 255)' not to be 'rgb(0, 0, 255)' // Object.is equality

[Killed] LogicalOperator
src/gradientPlugin.ts:236:16
     if (stopColor.stop === percent) return stopColor.color;
     if (stopColor.stop < percent) {
       startColor = stopColor;
-    } else if (stopColor.stop > percent && !endColor) {
+    } else if (stopColor.stop > percent || !endColor) {
       endColor = stopColor;
     }
killedBy: gradientPlugin afterUpdate resolves the color from only the nearest earlier stop when a value falls before the very first stop
statusReason: expected 'rgb(0, 0, 255)' to be 'rgb(255, 0, 0)' // Object.is equality

[Killed] ConditionalExpression
src/gradientPlugin.ts:236:16
     if (stopColor.stop === percent) return stopColor.color;
     if (stopColor.stop < percent) {
       startColor = stopColor;
-    } else if (stopColor.stop > percent && !endColor) {
+    } else if (false) {
       endColor = stopColor;
     }
killedBy: gradientPlugin afterUpdate interpolates a color for a per-data-point legend swatch whose raw value falls between two stops
statusReason: expected 'rgb(255, 0, 0)' not to be 'rgb(255, 0, 0)' // Object.is equality

[Killed] BooleanLiteral
src/gradientPlugin.ts:240:7
       endColor = stopColor;
     }
   }
-  if (!endColor) return startColor?.color;
+  if (endColor) return startColor?.color;
   if (!startColor) return endColor.color;
   return interpolateColor(percent, startColor, endColor);
killedBy: gradientPlugin afterUpdate interpolates a color for a per-data-point legend swatch whose raw value falls between two stops
statusReason: expected 'rgb(255, 0, 0)' not to be 'rgb(255, 0, 0)' // Object.is equality

[Killed] ConditionalExpression
src/gradientPlugin.ts:240:7
       endColor = stopColor;
     }
   }
-  if (!endColor) return startColor?.color;
+  if (false) return startColor?.color;
   if (!startColor) return endColor.color;
   return interpolateColor(percent, startColor, endColor);
killedBy: gradientPlugin afterUpdate resolves the color from only the nearest later stop when a value falls after the very last stop
statusReason: Cannot read properties of undefined (reading 'color')
