[Killed] LogicalOperator
src/zoomPlugin.ts:278:7
       }
     }
   }
-  if (scale && scaleEnabled[scale.axis as 'x' | 'y']) {
+  if (scale || scaleEnabled[scale.axis as 'x' | 'y']) {
     return [scale];
   }
killedBy: zoomPlugin programmatic zoom() does not zoom a direction whose scale axis is disabled by mode
statusReason: expected 100 to be undefined

[Killed] MethodExpression
src/zoomPlugin.ts:281:10
   if (scale && scaleEnabled[scale.axis as 'x' | 'y']) {
     return [scale];
   }
-  return liveScales(chart).filter((scaleItem) => enabled[scaleItem.axis as 'x' | 'y']);
+  return liveScales(chart);
 }
 
killedBy: zoomPlugin programmatic zoom() does not zoom a direction whose scale axis is disabled by mode
statusReason: expected 100 to be undefined

[Killed] ArrowFunction
src/zoomPlugin.ts:281:35
   if (scale && scaleEnabled[scale.axis as 'x' | 'y']) {
     return [scale];
   }
-  return liveScales(chart).filter((scaleItem) => enabled[scaleItem.axis as 'x' | 'y']);
+  return liveScales(chart).filter(() => undefined);
 }
 
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/zoomPlugin.ts:286:109
 
 // ---- zoom/pan math, per scale type ----
 
-function zoomDelta(val: number, min: number, range: number, newRange: number): { min: number; max: number } {
-  const minPercent = Math.max(0, Math.min(1, (val - min) / range || 0));
-  const maxPercent = 1 - minPercent;
-  return { min: newRange * minPercent, max: newRange * maxPercent };
-}
+function zoomDelta(val: number, min: number, range: number, newRange: number): { min: number; max: number } {}
 function getValueAtPoint(scale: LiveScale, point: ScreenPoint): number | undefined {
   const pixel = scale.isHorizontal() ? point.x : point.y;
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'min')

[Killed] MethodExpression
src/zoomPlugin.ts:287:22
 // ---- zoom/pan math, per scale type ----
 
 function zoomDelta(val: number, min: number, range: number, newRange: number): { min: number; max: number } {
-  const minPercent = Math.max(0, Math.min(1, (val - min) / range || 0));
+  const minPercent = Math.min(0, Math.min(1, (val - min) / range || 0));
   const maxPercent = 1 - minPercent;
   return { min: newRange * minPercent, max: newRange * maxPercent };
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) zoomDelta: focal point exactly at scale.max keeps max exactly unchanged (all the zoom lands
statusReason: expected +0 to be close to 100, received difference is 100, but expected 5e-7

[Killed] ConditionalExpression
src/zoomPlugin.ts:287:46
 // ---- zoom/pan math, per scale type ----
 
 function zoomDelta(val: number, min: number, range: number, newRange: number): { min: number; max: number } {
-  const minPercent = Math.max(0, Math.min(1, (val - min) / range || 0));
+  const minPercent = Math.max(0, Math.min(1, true));
   const maxPercent = 1 - minPercent;
   return { min: newRange * minPercent, max: newRange * maxPercent };
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) zoomDelta: focal point exactly at scale.min keeps min exactly unchanged (all the zoom lands
statusReason: expected 100 to be close to +0, received difference is 100, but expected 5e-7

[Killed] ArithmeticOperator
src/zoomPlugin.ts:288:22
 
 function zoomDelta(val: number, min: number, range: number, newRange: number): { min: number; max: number } {
   const minPercent = Math.max(0, Math.min(1, (val - min) / range || 0));
-  const maxPercent = 1 - minPercent;
+  const maxPercent = 1 + minPercent;
   return { min: newRange * minPercent, max: newRange * maxPercent };
 }
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) zoomDelta: focal point exactly at scale.max keeps max exactly unchanged (all the zoom lands
statusReason: expected +0 to be close to 100, received difference is 100, but expected 5e-7

[Killed] ArithmeticOperator
src/zoomPlugin.ts:289:45
 function zoomDelta(val: number, min: number, range: number, newRange: number): { min: number; max: number } {
   const minPercent = Math.max(0, Math.min(1, (val - min) / range || 0));
   const maxPercent = 1 - minPercent;
-  return { min: newRange * minPercent, max: newRange * maxPercent };
+  return { min: newRange * minPercent, max: newRange / maxPercent };
 }
 function getValueAtPoint(scale: LiveScale, point: ScreenPoint): number | undefined {
killedBy: zoomPlugin programmatic zoom() zooming out (amount < 1) widens the range
statusReason: expected NaN to be greater than 50

[Killed] ArithmeticOperator
src/zoomPlugin.ts:289:17
 function zoomDelta(val: number, min: number, range: number, newRange: number): { min: number; max: number } {
   const minPercent = Math.max(0, Math.min(1, (val - min) / range || 0));
   const maxPercent = 1 - minPercent;
-  return { min: newRange * minPercent, max: newRange * maxPercent };
+  return { min: newRange / minPercent, max: newRange * maxPercent };
 }
 function getValueAtPoint(scale: LiveScale, point: ScreenPoint): number | undefined {
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) zoomDelta: focal point exactly at scale.min keeps min exactly unchanged (all the zoom lands
statusReason: expected NaN to be close to +0, received difference is NaN, but expected 5e-7

[Killed] BlockStatement
src/zoomPlugin.ts:291:84
   const maxPercent = 1 - minPercent;
   return { min: newRange * minPercent, max: newRange * maxPercent };
 }
-function getValueAtPoint(scale: LiveScale, point: ScreenPoint): number | undefined {
-  const pixel = scale.isHorizontal() ? point.x : point.y;
-  // Deliberately NOT `?? NaN` here (unlike linearRange/panNumericalScale
-  // below, which need a concrete number for isNaN checks): the original
-  // plugin's own `logarithmicZoomRange` genuinely branches on this
-  // value being `undefined` specifically (an out-of-range pixel), and
-  // an earlier version of this port coerced it to NaN here, which
-  // silently made that branch permanently unreachable — confirmed as a
-  // real, introduced regression via a failing test ("leaves a
-  // logarithmic scale unchanged when the zoom center resolves to an
-  // undefined value"), not a hypothetical. `linearZoomDelta`'s own
-  // caller passes this straight into `zoomDelta`, which already
-  // tolerates `undefined`/`NaN` via its own `|| 0` fallback, so no
-  // caller needed a NaN specifically — only `logarithmicZoomRange`
-  // needed the real `undefined` to reach it at all.
-  return scale.getValueForPixel(pixel);
-}
+function getValueAtPoint(scale: LiveScale, point: ScreenPoint): number | undefined {}
 function linearZoomDelta(scale: LiveScale, zoomAmount: number, center: ScreenPoint): { min: number; max: number } {
   const range = scale.max - scale.min;
killedBy: zoomPlugin logarithmic scale zoom zooms a logarithmic scale using log-space math, not linear math
statusReason: expected 999 to be less than 999

[Killed] BlockStatement
src/zoomPlugin.ts:308:115
   // needed the real `undefined` to reach it at all.
   return scale.getValueForPixel(pixel);
 }
-function linearZoomDelta(scale: LiveScale, zoomAmount: number, center: ScreenPoint): { min: number; max: number } {
-  const range = scale.max - scale.min;
-  const newRange = range * (zoomAmount - 1);
-  const centerValue = getValueAtPoint(scale, center);
-  return zoomDelta(centerValue ?? NaN, scale.min, range, newRange);
-}
+function linearZoomDelta(scale: LiveScale, zoomAmount: number, center: ScreenPoint): { min: number; max: number } {}
 function logarithmicZoomRange(scale: LiveScale, zoomAmount: number, center: ScreenPoint): { min: number; max: number } {
   const centerValue = getValueAtPoint(scale, center);
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'min')

[Survived] ArithmeticOperator
src/zoomPlugin.ts:309:17
   return scale.getValueForPixel(pixel);
 }
 function linearZoomDelta(scale: LiveScale, zoomAmount: number, center: ScreenPoint): { min: number; max: number } {
-  const range = scale.max - scale.min;
+  const range = scale.max + scale.min;
   const newRange = range * (zoomAmount - 1);
   const centerValue = getValueAtPoint(scale, center);

[Killed] ArithmeticOperator
src/zoomPlugin.ts:310:20
 }
 function linearZoomDelta(scale: LiveScale, zoomAmount: number, center: ScreenPoint): { min: number; max: number } {
   const range = scale.max - scale.min;
-  const newRange = range * (zoomAmount - 1);
+  const newRange = range / (zoomAmount - 1);
   const centerValue = getValueAtPoint(scale, center);
   return zoomDelta(centerValue ?? NaN, scale.min, range, newRange);
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys getCenter: computes the exact midpoint of an asymmetric chart area, not some other formul
statusReason: expected 50 to be close to 25, received difference is 25, but expected 0.000005

[Killed] ArithmeticOperator
src/zoomPlugin.ts:310:29
 }
 function linearZoomDelta(scale: LiveScale, zoomAmount: number, center: ScreenPoint): { min: number; max: number } {
   const range = scale.max - scale.min;
-  const newRange = range * (zoomAmount - 1);
+  const newRange = range * (zoomAmount + 1);
   const centerValue = getValueAtPoint(scale, center);
   return zoomDelta(centerValue ?? NaN, scale.min, range, newRange);
killedBy: zoomPlugin programmatic zoom() zooming out (amount < 1) widens the range
statusReason: expected 0 to be greater than 50

[Killed] LogicalOperator
src/zoomPlugin.ts:312:20
   const range = scale.max - scale.min;
   const newRange = range * (zoomAmount - 1);
   const centerValue = getValueAtPoint(scale, center);
-  return zoomDelta(centerValue ?? NaN, scale.min, range, newRange);
+  return zoomDelta(centerValue && NaN, scale.min, range, newRange);
 }
 function logarithmicZoomRange(scale: LiveScale, zoomAmount: number, center: ScreenPoint): { min: number; max: number } {
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) zoomDelta: focal point exactly at scale.max keeps max exactly unchanged (all the zoom lands
statusReason: expected +0 to be close to 100, received difference is 100, but expected 5e-7

[Killed] BlockStatement
src/zoomPlugin.ts:314:120
   const centerValue = getValueAtPoint(scale, center);
   return zoomDelta(centerValue ?? NaN, scale.min, range, newRange);
 }
-function logarithmicZoomRange(scale: LiveScale, zoomAmount: number, center: ScreenPoint): { min: number; max: number } {
-  const centerValue = getValueAtPoint(scale, center);
-  if (centerValue === undefined) return { min: scale.min, max: scale.max };
-  const logMin = Math.log10(scale.min);
-  const logMax = Math.log10(scale.max);
-  const logCenter = Math.log10(centerValue);
-  const logRange = logMax - logMin;
-  const newLogRange = logRange * (zoomAmount - 1);
-  const delta = zoomDelta(logCenter, logMin, logRange, newLogRange);
-  return { min: Math.pow(10, logMin + delta.min), max: Math.pow(10, logMax - delta.max) };
-}
+function logarithmicZoomRange(scale: LiveScale, zoomAmount: number, center: ScreenPoint): { min: number; max: number } {}
 function getScaleLimits(scale: LiveScale, limits: Record<string, ScaleLimits> | undefined): ScaleLimits {
   return (limits && (limits[scale.id] ?? limits[scale.axis as string])) || {};
killedBy: zoomPlugin logarithmic scale zoom zooms a logarithmic scale using log-space math, not linear math
statusReason: Cannot read properties of undefined (reading 'max')

[Killed] EqualityOperator
src/zoomPlugin.ts:316:7
 }
 function logarithmicZoomRange(scale: LiveScale, zoomAmount: number, center: ScreenPoint): { min: number; max: number } {
   const centerValue = getValueAtPoint(scale, center);
-  if (centerValue === undefined) return { min: scale.min, max: scale.max };
+  if (centerValue !== undefined) return { min: scale.min, max: scale.max };
   const logMin = Math.log10(scale.min);
   const logMax = Math.log10(scale.max);
killedBy: zoomPlugin logarithmic scale zoom zooms a logarithmic scale using log-space math, not linear math
statusReason: expected 999 to be less than 999

[Killed] ConditionalExpression
src/zoomPlugin.ts:316:7
 }
 function logarithmicZoomRange(scale: LiveScale, zoomAmount: number, center: ScreenPoint): { min: number; max: number } {
   const centerValue = getValueAtPoint(scale, center);
-  if (centerValue === undefined) return { min: scale.min, max: scale.max };
+  if (false) return { min: scale.min, max: scale.max };
   const logMin = Math.log10(scale.min);
   const logMax = Math.log10(scale.max);
killedBy: zoomPlugin logarithmic scale zoom leaves a logarithmic scale unchanged when the zoom center resolves to an undefined value
statusReason: expected 1 to be 1000 // Object.is equality

[Survived] ArithmeticOperator
src/zoomPlugin.ts:320:20
   const logMin = Math.log10(scale.min);
   const logMax = Math.log10(scale.max);
   const logCenter = Math.log10(centerValue);
-  const logRange = logMax - logMin;
+  const logRange = logMax + logMin;
   const newLogRange = logRange * (zoomAmount - 1);
   const delta = zoomDelta(logCenter, logMin, logRange, newLogRange);

[Killed] ArithmeticOperator
src/zoomPlugin.ts:321:35
   const logMax = Math.log10(scale.max);
   const logCenter = Math.log10(centerValue);
   const logRange = logMax - logMin;
-  const newLogRange = logRange * (zoomAmount - 1);
+  const newLogRange = logRange * (zoomAmount + 1);
   const delta = zoomDelta(logCenter, logMin, logRange, newLogRange);
   return { min: Math.pow(10, logMin + delta.min), max: Math.pow(10, logMax - delta.max) };
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) logarithmicZoomRange: known log-space values produce the exact expected bounds (not just "n
statusReason: expected 500.05 to be close to 10, received difference is 490.05, but expected 0.00005

[Killed] ArithmeticOperator
src/zoomPlugin.ts:321:23
   const logMax = Math.log10(scale.max);
   const logCenter = Math.log10(centerValue);
   const logRange = logMax - logMin;
-  const newLogRange = logRange * (zoomAmount - 1);
+  const newLogRange = logRange / (zoomAmount - 1);
   const delta = zoomDelta(logCenter, logMin, logRange, newLogRange);
   return { min: Math.pow(10, logMin + delta.min), max: Math.pow(10, logMax - delta.max) };
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) logarithmicZoomRange: a gentler zoom produces exact, precomputed log-space bounds
statusReason: expected 50.5 to be close to 3.1622776601683795, received difference is 47.33772233983162, but expected 0.00005

[Killed] ArithmeticOperator
src/zoomPlugin.ts:323:69
   const logRange = logMax - logMin;
   const newLogRange = logRange * (zoomAmount - 1);
   const delta = zoomDelta(logCenter, logMin, logRange, newLogRange);
-  return { min: Math.pow(10, logMin + delta.min), max: Math.pow(10, logMax - delta.max) };
+  return { min: Math.pow(10, logMin + delta.min), max: Math.pow(10, logMax + delta.max) };
 }
 function getScaleLimits(scale: LiveScale, limits: Record<string, ScaleLimits> | undefined): ScaleLimits {
killedBy: zoomPlugin logarithmic scale zoom zooms a logarithmic scale using log-space math, not linear math
statusReason: expected 4799.999999999999 to be less than 999

[Killed] ArithmeticOperator
src/zoomPlugin.ts:323:30
   const logRange = logMax - logMin;
   const newLogRange = logRange * (zoomAmount - 1);
   const delta = zoomDelta(logCenter, logMin, logRange, newLogRange);
-  return { min: Math.pow(10, logMin + delta.min), max: Math.pow(10, logMax - delta.max) };
+  return { min: Math.pow(10, logMin - delta.min), max: Math.pow(10, logMax - delta.max) };
 }
 function getScaleLimits(scale: LiveScale, limits: Record<string, ScaleLimits> | undefined): ScaleLimits {
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) logarithmicZoomRange: known log-space values produce the exact expected bounds (not just "n
statusReason: expected 0.09999999999999983 to be close to 10, received difference is 9.9, but expected 0.00005

[Killed] BlockStatement
src/zoomPlugin.ts:325:105
   const delta = zoomDelta(logCenter, logMin, logRange, newLogRange);
   return { min: Math.pow(10, logMin + delta.min), max: Math.pow(10, logMax - delta.max) };
 }
-function getScaleLimits(scale: LiveScale, limits: Record<string, ScaleLimits> | undefined): ScaleLimits {
-  return (limits && (limits[scale.id] ?? limits[scale.axis as string])) || {};
-}
+function getScaleLimits(scale: LiveScale, limits: Record<string, ScaleLimits> | undefined): ScaleLimits {}
 function getLimit(
   state: ZoomPluginState,
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'minRange')

[Killed] ConditionalExpression
src/zoomPlugin.ts:326:11
   return { min: Math.pow(10, logMin + delta.min), max: Math.pow(10, logMax - delta.max) };
 }
 function getScaleLimits(scale: LiveScale, limits: Record<string, ScaleLimits> | undefined): ScaleLimits {
-  return (limits && (limits[scale.id] ?? limits[scale.axis as string])) || {};
+  return (false) || {};
 }
 function getLimit(
killedBy: zoomPlugin limits enforcement never zooms a scale past its own configured min/max limit
statusReason: expected -66445.13460159302 to be greater than or equal to 0

[Killed] LogicalOperator
src/zoomPlugin.ts:326:22
   return { min: Math.pow(10, logMin + delta.min), max: Math.pow(10, logMax - delta.max) };
 }
 function getScaleLimits(scale: LiveScale, limits: Record<string, ScaleLimits> | undefined): ScaleLimits {
-  return (limits && (limits[scale.id] ?? limits[scale.axis as string])) || {};
+  return (limits && (limits[scale.id] && limits[scale.axis as string])) || {};
 }
 function getLimit(
killedBy: zoomPlugin limits enforcement resolves a configured limit keyed by axis, not just by scale id (getScaleLimits' own fallback)
statusReason: expected -66445.13460159302 to be greater than or equal to 0

[Killed] BlockStatement
src/zoomPlugin.ts:334:11
   scaleLimits: ScaleLimits,
   prop: 'min' | 'max',
   fallback: number,
-): number {
-  const limit = scaleLimits[prop];
-  if (limit === 'original') {
-    const original = state.originalScaleLimits[scale.id][prop];
-    return original.options ?? original.scale;
-  }
-  return limit ?? fallback;
-}
+): number {}
 function linearRange(scale: LiveScale, pixel0: number, pixel1: number): { min: number; max: number } {
   const v0 = scale.getValueForPixel(pixel0) ?? NaN;
killedBy: zoomPlugin limits enforcement never zooms a scale past its own configured min/max limit
statusReason: expected -66445.13460159302 to be greater than or equal to 0

[Killed] EqualityOperator
src/zoomPlugin.ts:336:7
   fallback: number,
 ): number {
   const limit = scaleLimits[prop];
-  if (limit === 'original') {
+  if (limit !== 'original') {
     const original = state.originalScaleLimits[scale.id][prop];
     return original.options ?? original.scale;
killedBy: zoomPlugin programmatic zoom() zooming out (amount < 1) widens the range
statusReason: expected 50 to be greater than 50

[Killed] ConditionalExpression
src/zoomPlugin.ts:336:7
   fallback: number,
 ): number {
   const limit = scaleLimits[prop];
-  if (limit === 'original') {
+  if (false) {
     const original = state.originalScaleLimits[scale.id][prop];
     return original.options ?? original.scale;
killedBy: zoomPlugin limits enforcement resolves "original" back to the scale's own real value even when no explicit options.min/max was ever set (getLimit's own scale fallback)
statusReason: expected -66445.13460159302 to be greater than or equal to 39

[Killed] LogicalOperator
src/zoomPlugin.ts:338:12
   const limit = scaleLimits[prop];
   if (limit === 'original') {
     const original = state.originalScaleLimits[scale.id][prop];
-    return original.options ?? original.scale;
+    return original.options && original.scale;
   }
   return limit ?? fallback;
killedBy: zoomPlugin limits enforcement resolves "original" back to the scale's own real value even when no explicit options.min/max was ever set (getLimit's own scale fallback)
statusReason: expected -66445.13460159302 to be greater than or equal to 39

[Killed] LogicalOperator
src/zoomPlugin.ts:340:10
     const original = state.originalScaleLimits[scale.id][prop];
     return original.options ?? original.scale;
   }
-  return limit ?? fallback;
+  return limit && fallback;
 }
 function linearRange(scale: LiveScale, pixel0: number, pixel1: number): { min: number; max: number } {
killedBy: zoomPlugin limits enforcement never zooms a scale past its own configured min/max limit
statusReason: expected 66505.13460159302 to be less than or equal to 100

[Killed] BlockStatement
src/zoomPlugin.ts:342:102
   }
   return limit ?? fallback;
 }
-function linearRange(scale: LiveScale, pixel0: number, pixel1: number): { min: number; max: number } {
-  const v0 = scale.getValueForPixel(pixel0) ?? NaN;
-  const v1 = scale.getValueForPixel(pixel1) ?? NaN;
-  return { min: Math.min(v0, v1), max: Math.max(v0, v1) };
-}
+function linearRange(scale: LiveScale, pixel0: number, pixel1: number): { min: number; max: number } {}
 function fixRange(
   range: number,
killedBy: zoomPlugin programmatic zoom() resolves mode as a function of the chart, not just a string literal
statusReason: Cannot read properties of undefined (reading 'max')

[Killed] LogicalOperator
src/zoomPlugin.ts:343:14
   return limit ?? fallback;
 }
 function linearRange(scale: LiveScale, pixel0: number, pixel1: number): { min: number; max: number } {
-  const v0 = scale.getValueForPixel(pixel0) ?? NaN;
+  const v0 = scale.getValueForPixel(pixel0) && NaN;
   const v1 = scale.getValueForPixel(pixel1) ?? NaN;
   return { min: Math.min(v0, v1), max: Math.max(v0, v1) };
killedBy: zoomPlugin programmatic zoom() treats an undefined zoom.mode as enabling every direction (directionEnabled's own default branch)
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.000005

[Killed] LogicalOperator
src/zoomPlugin.ts:344:14
 }
 function linearRange(scale: LiveScale, pixel0: number, pixel1: number): { min: number; max: number } {
   const v0 = scale.getValueForPixel(pixel0) ?? NaN;
-  const v1 = scale.getValueForPixel(pixel1) ?? NaN;
+  const v1 = scale.getValueForPixel(pixel1) && NaN;
   return { min: Math.min(v0, v1), max: Math.max(v0, v1) };
 }
killedBy: zoomPlugin programmatic zoom() treats an undefined zoom.mode as enabling every direction (directionEnabled's own default branch)
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.000005

[Killed] MethodExpression
src/zoomPlugin.ts:345:17
 function linearRange(scale: LiveScale, pixel0: number, pixel1: number): { min: number; max: number } {
   const v0 = scale.getValueForPixel(pixel0) ?? NaN;
   const v1 = scale.getValueForPixel(pixel1) ?? NaN;
-  return { min: Math.min(v0, v1), max: Math.max(v0, v1) };
+  return { min: Math.max(v0, v1), max: Math.max(v0, v1) };
 }
 function fixRange(
killedBy: zoomPlugin programmatic zoom() treats an undefined zoom.mode as enabling every direction (directionEnabled's own default branch)
statusReason: expected 300 to be close to 100, received difference is 200, but expected 0.000005

[Killed] MethodExpression
src/zoomPlugin.ts:345:40
 function linearRange(scale: LiveScale, pixel0: number, pixel1: number): { min: number; max: number } {
   const v0 = scale.getValueForPixel(pixel0) ?? NaN;
   const v1 = scale.getValueForPixel(pixel1) ?? NaN;
-  return { min: Math.min(v0, v1), max: Math.max(v0, v1) };
+  return { min: Math.min(v0, v1), max: Math.min(v0, v1) };
 }
 function fixRange(
killedBy: zoomPlugin programmatic zoomRect() zooms each enabled scale to the pixel range implied by the two given points
statusReason: expected 100 to be close to 300, received difference is 200, but expected 0.000005

[Killed] BlockStatement
src/zoomPlugin.ts:351:33
   range: number,
   bounds: { min: number; max: number; minLimit: number; maxLimit: number },
   originalLimits: { min: ScaleLimitSnapshot; max: ScaleLimitSnapshot },
-): { min: number; max: number } {
-  let { min, max } = bounds;
-  const { minLimit, maxLimit } = bounds;
-  const offset = (range - max + min) / 2;
-  min -= offset;
-  max += offset;
-  const origMin = originalLimits.min.options ?? originalLimits.min.scale;
-  const origMax = originalLimits.max.options ?? originalLimits.max.scale;
-  const epsilon = range / 1e6;
-  if (Math.abs(min - origMin) < epsilon) min = origMin;
-  if (Math.abs(max - origMax) < epsilon) max = origMax;
-  if (min < minLimit) {
-    min = minLimit;
-    max = Math.min(minLimit + range, maxLimit);
-  } else if (max > maxLimit) {
-    max = maxLimit;
-    min = Math.max(maxLimit - range, minLimit);
-  }
-  return { min, max };
-}
+): { min: number; max: number } {}
 /** `zoomKind: true` for a real zoom, `'pan'` for a pan-triggered update (different limit-violation
  * behavior — see the real `zoomKind === 'pan'` check below), `false` for neither. */
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'min')

[Killed] ArithmeticOperator
src/zoomPlugin.ts:354:19
 ): { min: number; max: number } {
   let { min, max } = bounds;
   const { minLimit, maxLimit } = bounds;
-  const offset = (range - max + min) / 2;
+  const offset = (range + max + min) / 2;
   min -= offset;
   max += offset;
killedBy: zoomPlugin programmatic zoom() treats an undefined zoom.mode as enabling every direction (directionEnabled's own default branch)
statusReason: expected -200 to be close to 100, received difference is 300, but expected 0.000005

[Killed] ArithmeticOperator
src/zoomPlugin.ts:354:19
 ): { min: number; max: number } {
   let { min, max } = bounds;
   const { minLimit, maxLimit } = bounds;
-  const offset = (range - max + min) / 2;
+  const offset = (range - max - min) / 2;
   min -= offset;
   max += offset;
killedBy: zoomPlugin programmatic zoom() treats an undefined zoom.mode as enabling every direction (directionEnabled's own default branch)
statusReason: expected 200 to be close to 100, received difference is 100, but expected 0.000005

[Survived] AssignmentOperator
src/zoomPlugin.ts:355:3
   let { min, max } = bounds;
   const { minLimit, maxLimit } = bounds;
   const offset = (range - max + min) / 2;
-  min -= offset;
+  min += offset;
   max += offset;
   const origMin = originalLimits.min.options ?? originalLimits.min.scale;

[Survived] AssignmentOperator
src/zoomPlugin.ts:356:3
   const { minLimit, maxLimit } = bounds;
   const offset = (range - max + min) / 2;
   min -= offset;
-  max += offset;
+  max -= offset;
   const origMin = originalLimits.min.options ?? originalLimits.min.scale;
   const origMax = originalLimits.max.options ?? originalLimits.max.scale;

[Killed] LogicalOperator
src/zoomPlugin.ts:357:19
   const offset = (range - max + min) / 2;
   min -= offset;
   max += offset;
-  const origMin = originalLimits.min.options ?? originalLimits.min.scale;
+  const origMin = originalLimits.min.options && originalLimits.min.scale;
   const origMax = originalLimits.max.options ?? originalLimits.max.scale;
   const epsilon = range / 1e6;
killedBy: zoomPlugin category scale zoom/pan accumulates an unapplied pan delta rather than losing it, for a delta too small to move the range at all
statusReason: expected -9.999999703159119e-8 to be +0 // Object.is equality

[Killed] LogicalOperator
src/zoomPlugin.ts:358:19
   min -= offset;
   max += offset;
   const origMin = originalLimits.min.options ?? originalLimits.min.scale;
-  const origMax = originalLimits.max.options ?? originalLimits.max.scale;
+  const origMax = originalLimits.max.options && originalLimits.max.scale;
   const epsilon = range / 1e6;
   if (Math.abs(min - origMin) < epsilon) min = origMin;
killedBy: zoomPlugin category scale zoom/pan accumulates an unapplied pan delta rather than losing it, for a delta too small to move the range at all
statusReason: expected 99.9999999 to be 100 // Object.is equality

[Killed] ArithmeticOperator
src/zoomPlugin.ts:359:19
   max += offset;
   const origMin = originalLimits.min.options ?? originalLimits.min.scale;
   const origMax = originalLimits.max.options ?? originalLimits.max.scale;
-  const epsilon = range / 1e6;
+  const epsilon = range * 1e6;
   if (Math.abs(min - origMin) < epsilon) min = origMin;
   if (Math.abs(max - origMax) < epsilon) max = origMax;
killedBy: zoomPlugin programmatic zoom() zooming out (amount < 1) widens the range
statusReason: expected 50 to be greater than 50
