[Killed] ConditionalExpression
src/gradientPlugin.ts:241:7
     }
   }
   if (!endColor) return startColor?.color;
-  if (!startColor) return endColor.color;
+  if (true) return endColor.color;
   return interpolateColor(percent, startColor, endColor);
 }
killedBy: gradientPlugin afterUpdate interpolates a color for a per-data-point legend swatch whose raw value falls between two stops
statusReason: expected 'rgb(0, 0, 255)' not to be 'rgb(0, 0, 255)' // Object.is equality

[Killed] BooleanLiteral
src/gradientPlugin.ts:241:7
     }
   }
   if (!endColor) return startColor?.color;
-  if (!startColor) return endColor.color;
+  if (startColor) return endColor.color;
   return interpolateColor(percent, startColor, endColor);
 }
killedBy: gradientPlugin afterUpdate interpolates a color for a per-data-point legend swatch whose raw value falls between two stops
statusReason: expected 'rgb(0, 0, 255)' not to be 'rgb(0, 0, 255)' // Object.is equality

[Survived] StringLiteral
src/gradientPlugin.ts:246:44
 }
 
 const LEGEND_KEYS: Array<{ key: 'backgroundColor' | 'borderColor'; legendItemKey: 'fillStyle' | 'strokeStyle' }> = [
-  { key: 'backgroundColor', legendItemKey: 'fillStyle' },
+  { key: 'backgroundColor', legendItemKey: "" },
   { key: 'borderColor', legendItemKey: 'strokeStyle' },
 ];

[Survived] ObjectLiteral
src/gradientPlugin.ts:246:3
 }
 
 const LEGEND_KEYS: Array<{ key: 'backgroundColor' | 'borderColor'; legendItemKey: 'fillStyle' | 'strokeStyle' }> = [
-  { key: 'backgroundColor', legendItemKey: 'fillStyle' },
+  {},
   { key: 'borderColor', legendItemKey: 'strokeStyle' },
 ];

[Killed] BlockStatement
src/gradientPlugin.ts:250:86
   { key: 'borderColor', legendItemKey: 'strokeStyle' },
 ];
 
-function legendBoxHeight(chart: Chart, legendOptions: LiveLegend['options']): number {
-  const size = legendOptions.labels.font?.size;
-  return defined(size) ? size! : chart.options.font!.size!;
-}
+function legendBoxHeight(chart: Chart, legendOptions: LiveLegend['options']): number {}
 
 /** Reads a dataset's own x/y/r scale off its real, live `ChartMeta`.
killedBy: gradientPlugin afterUpdate falls back to chart.options.font.size for the legend box height when neither boxHeight nor labels.font.size is set
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] OptionalChaining
src/gradientPlugin.ts:251:16
 ];
 
 function legendBoxHeight(chart: Chart, legendOptions: LiveLegend['options']): number {
-  const size = legendOptions.labels.font?.size;
+  const size = legendOptions.labels.font.size;
   return defined(size) ? size! : chart.options.font!.size!;
 }
killedBy: gradientPlugin afterUpdate falls back to chart.options.font.size for the legend box height when neither boxHeight nor labels.font.size is set
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BlockStatement
src/gradientPlugin.ts:260:79
  * `xScale`/`yScale`/`rScale` on its own meta during Chart.js's own
  * `linkScales()` — but not part of Chart.js's own public `ChartMeta`
  * type, so a targeted cast is needed to read it. */
-function getAxisScale(meta: ChartMeta, axis: GradientAxis): Scale | undefined {
-  return (meta as unknown as Record<'xScale' | 'yScale' | 'rScale', Scale | undefined>)[`${axis}Scale`];
-}
+function getAxisScale(meta: ChartMeta, axis: GradientAxis): Scale | undefined {}
 
 /** Applies this dataset's own stored gradient to its legend swatch (one swatch per dataset — bar/line/etc. charts). */
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/gradientPlugin.ts:272:9
   item: LegendItem,
   boxWidth: number,
   boxHeight: number,
-): void {
-  const hitBox = legend.legendHitBoxes?.[item.datasetIndex!];
-  if (!hitBox) return;
-  const area: GradientArea = {
-    top: hitBox.top,
-    left: hitBox.left,
-    bottom: hitBox.top + boxHeight,
-    right: hitBox.left + boxWidth,
-    xCenter: hitBox.left + boxWidth / 2,
-    yCenter: hitBox.top + boxHeight / 2,
-    drawingArea: Math.max(boxWidth, boxHeight) / 2,
-  };
-  if (!areaIsValid(area)) return;
-
-  for (const { key, legendItemKey } of LEGEND_KEYS) {
-    const data = getGradientState(state, key, item.datasetIndex!);
-    if (!data || data.stopColors.length === 0) continue;
-    const gradient = createGradient(chart.ctx, data.axis, area);
-    applyColorStops(gradient, data.stopColors);
-    item[legendItemKey] = gradient;
-  }
-}
+): void {}
 
 /** Applies an interpolated color to each legend swatch (one swatch per data point — doughnut/pie/radar/polar charts). */
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Survived] OptionalChaining
src/gradientPlugin.ts:273:18
   boxWidth: number,
   boxHeight: number,
 ): void {
-  const hitBox = legend.legendHitBoxes?.[item.datasetIndex!];
+  const hitBox = legend.legendHitBoxes[item.datasetIndex!];
   if (!hitBox) return;
   const area: GradientArea = {

[Killed] ConditionalExpression
src/gradientPlugin.ts:274:7
   boxHeight: number,
 ): void {
   const hitBox = legend.legendHitBoxes?.[item.datasetIndex!];
-  if (!hitBox) return;
+  if (false) return;
   const area: GradientArea = {
     top: hitBox.top,
killedBy: gradientPlugin afterUpdate does nothing for a legend item with no matching hitBox for its own datasetIndex
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] BooleanLiteral
src/gradientPlugin.ts:274:7
   boxHeight: number,
 ): void {
   const hitBox = legend.legendHitBoxes?.[item.datasetIndex!];
-  if (!hitBox) return;
+  if (hitBox) return;
   const area: GradientArea = {
     top: hitBox.top,
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] ObjectLiteral
src/gradientPlugin.ts:275:30
 ): void {
   const hitBox = legend.legendHitBoxes?.[item.datasetIndex!];
   if (!hitBox) return;
-  const area: GradientArea = {
-    top: hitBox.top,
-    left: hitBox.left,
-    bottom: hitBox.top + boxHeight,
-    right: hitBox.left + boxWidth,
-    xCenter: hitBox.left + boxWidth / 2,
-    yCenter: hitBox.top + boxHeight / 2,
-    drawingArea: Math.max(boxWidth, boxHeight) / 2,
-  };
+  const area: GradientArea = {};
   if (!areaIsValid(area)) return;
 
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] ArithmeticOperator
src/gradientPlugin.ts:278:13
   const area: GradientArea = {
     top: hitBox.top,
     left: hitBox.left,
-    bottom: hitBox.top + boxHeight,
+    bottom: hitBox.top - boxHeight,
     right: hitBox.left + boxWidth,
     xCenter: hitBox.left + boxWidth / 2,
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] ArithmeticOperator
src/gradientPlugin.ts:279:12
     top: hitBox.top,
     left: hitBox.left,
     bottom: hitBox.top + boxHeight,
-    right: hitBox.left + boxWidth,
+    right: hitBox.left - boxWidth,
     xCenter: hitBox.left + boxWidth / 2,
     yCenter: hitBox.top + boxHeight / 2,
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Survived] ArithmeticOperator
src/gradientPlugin.ts:280:28
     left: hitBox.left,
     bottom: hitBox.top + boxHeight,
     right: hitBox.left + boxWidth,
-    xCenter: hitBox.left + boxWidth / 2,
+    xCenter: hitBox.left + boxWidth * 2,
     yCenter: hitBox.top + boxHeight / 2,
     drawingArea: Math.max(boxWidth, boxHeight) / 2,

[Survived] ArithmeticOperator
src/gradientPlugin.ts:280:14
     left: hitBox.left,
     bottom: hitBox.top + boxHeight,
     right: hitBox.left + boxWidth,
-    xCenter: hitBox.left + boxWidth / 2,
+    xCenter: hitBox.left - boxWidth / 2,
     yCenter: hitBox.top + boxHeight / 2,
     drawingArea: Math.max(boxWidth, boxHeight) / 2,

[Survived] ArithmeticOperator
src/gradientPlugin.ts:281:27
     bottom: hitBox.top + boxHeight,
     right: hitBox.left + boxWidth,
     xCenter: hitBox.left + boxWidth / 2,
-    yCenter: hitBox.top + boxHeight / 2,
+    yCenter: hitBox.top + boxHeight * 2,
     drawingArea: Math.max(boxWidth, boxHeight) / 2,
   };

[Survived] ArithmeticOperator
src/gradientPlugin.ts:281:14
     bottom: hitBox.top + boxHeight,
     right: hitBox.left + boxWidth,
     xCenter: hitBox.left + boxWidth / 2,
-    yCenter: hitBox.top + boxHeight / 2,
+    yCenter: hitBox.top - boxHeight / 2,
     drawingArea: Math.max(boxWidth, boxHeight) / 2,
   };

[Survived] ArithmeticOperator
src/gradientPlugin.ts:282:18
     right: hitBox.left + boxWidth,
     xCenter: hitBox.left + boxWidth / 2,
     yCenter: hitBox.top + boxHeight / 2,
-    drawingArea: Math.max(boxWidth, boxHeight) / 2,
+    drawingArea: Math.max(boxWidth, boxHeight) * 2,
   };
   if (!areaIsValid(area)) return;

[Survived] MethodExpression
src/gradientPlugin.ts:282:18
     right: hitBox.left + boxWidth,
     xCenter: hitBox.left + boxWidth / 2,
     yCenter: hitBox.top + boxHeight / 2,
-    drawingArea: Math.max(boxWidth, boxHeight) / 2,
+    drawingArea: Math.min(boxWidth, boxHeight) / 2,
   };
   if (!areaIsValid(area)) return;

[Killed] BooleanLiteral
src/gradientPlugin.ts:284:7
     yCenter: hitBox.top + boxHeight / 2,
     drawingArea: Math.max(boxWidth, boxHeight) / 2,
   };
-  if (!areaIsValid(area)) return;
+  if (areaIsValid(area)) return;
 
   for (const { key, legendItemKey } of LEGEND_KEYS) {
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] ConditionalExpression
src/gradientPlugin.ts:284:7
     yCenter: hitBox.top + boxHeight / 2,
     drawingArea: Math.max(boxWidth, boxHeight) / 2,
   };
-  if (!areaIsValid(area)) return;
+  if (true) return;
 
   for (const { key, legendItemKey } of LEGEND_KEYS) {
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] BlockStatement
src/gradientPlugin.ts:286:53
   };
   if (!areaIsValid(area)) return;
 
-  for (const { key, legendItemKey } of LEGEND_KEYS) {
-    const data = getGradientState(state, key, item.datasetIndex!);
-    if (!data || data.stopColors.length === 0) continue;
-    const gradient = createGradient(chart.ctx, data.axis, area);
-    applyColorStops(gradient, data.stopColors);
-    item[legendItemKey] = gradient;
-  }
+  for (const { key, legendItemKey } of LEGEND_KEYS) {}
 }
 
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] ConditionalExpression
src/gradientPlugin.ts:288:9
 
   for (const { key, legendItemKey } of LEGEND_KEYS) {
     const data = getGradientState(state, key, item.datasetIndex!);
-    if (!data || data.stopColors.length === 0) continue;
+    if (false) continue;
     const gradient = createGradient(chart.ctx, data.axis, area);
     applyColorStops(gradient, data.stopColors);
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: Cannot read properties of undefined (reading 'axis')

[Killed] EqualityOperator
src/gradientPlugin.ts:288:18
 
   for (const { key, legendItemKey } of LEGEND_KEYS) {
     const data = getGradientState(state, key, item.datasetIndex!);
-    if (!data || data.stopColors.length === 0) continue;
+    if (!data || data.stopColors.length !== 0) continue;
     const gradient = createGradient(chart.ctx, data.axis, area);
     applyColorStops(gradient, data.stopColors);
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] BlockStatement
src/gradientPlugin.ts:301:9
   state: GradientPluginState,
   dataset: ChartConfigDataset,
   datasetIndex: number,
-): void {
-  const data = dataset.data as unknown[];
-  // `?? []` is defensive but genuinely unreachable in practice: this
-  // function's only caller, updateLegendItems, already guarantees
-  // `legend.legendItems` is a real array by the time this runs — it
-  // only reaches this call after `legend.legendItems?.[i]` resolved to a
-  // real, truthy item, which is impossible unless legendItems itself is
-  // a real array. Confirmed via a real test:coverage run (not assumed):
-  // this is the one branch in this file no test can reach without
-  // calling this non-exported function directly, bypassing its own real
-  // caller's guarantee.
-  for (const item of legend.legendItems ?? []) {
-    for (const { key, legendItemKey } of LEGEND_KEYS) {
-      const value = data[item.index!];
-      const resolved = getInterpolatedColorByValue(state, key, datasetIndex, Number(value));
-      if (resolved?.valid) {
-        item[legendItemKey] = resolved.rgbString();
-      }
-    }
-  }
-}
+): void {}
 
 /** Updates every visible legend item's swatch color(s) to reflect the current gradients. */
killedBy: gradientPlugin afterUpdate applies an exact-match stop color directly to a per-data-point legend swatch (doughnut/radar-style legends)
statusReason: expected undefined to be 'rgb(255, 0, 0)' // Object.is equality

[Killed] LogicalOperator
src/gradientPlugin.ts:312:22
   // this is the one branch in this file no test can reach without
   // calling this non-exported function directly, bypassing its own real
   // caller's guarantee.
-  for (const item of legend.legendItems ?? []) {
+  for (const item of legend.legendItems && []) {
     for (const { key, legendItemKey } of LEGEND_KEYS) {
       const value = data[item.index!];
killedBy: gradientPlugin afterUpdate applies an exact-match stop color directly to a per-data-point legend swatch (doughnut/radar-style legends)
statusReason: expected undefined to be 'rgb(255, 0, 0)' // Object.is equality

[Killed] BlockStatement
src/gradientPlugin.ts:312:48
   // this is the one branch in this file no test can reach without
   // calling this non-exported function directly, bypassing its own real
   // caller's guarantee.
-  for (const item of legend.legendItems ?? []) {
-    for (const { key, legendItemKey } of LEGEND_KEYS) {
-      const value = data[item.index!];
-      const resolved = getInterpolatedColorByValue(state, key, datasetIndex, Number(value));
-      if (resolved?.valid) {
-        item[legendItemKey] = resolved.rgbString();
-      }
-    }
-  }
+  for (const item of legend.legendItems ?? []) {}
 }
 
killedBy: gradientPlugin afterUpdate applies an exact-match stop color directly to a per-data-point legend swatch (doughnut/radar-style legends)
statusReason: expected undefined to be 'rgb(255, 0, 0)' // Object.is equality

[Killed] BlockStatement
src/gradientPlugin.ts:313:55
   // calling this non-exported function directly, bypassing its own real
   // caller's guarantee.
   for (const item of legend.legendItems ?? []) {
-    for (const { key, legendItemKey } of LEGEND_KEYS) {
-      const value = data[item.index!];
-      const resolved = getInterpolatedColorByValue(state, key, datasetIndex, Number(value));
-      if (resolved?.valid) {
-        item[legendItemKey] = resolved.rgbString();
-      }
-    }
+    for (const { key, legendItemKey } of LEGEND_KEYS) {}
   }
 }
killedBy: gradientPlugin afterUpdate applies an exact-match stop color directly to a per-data-point legend swatch (doughnut/radar-style legends)
statusReason: expected undefined to be 'rgb(255, 0, 0)' // Object.is equality

[Killed] ConditionalExpression
src/gradientPlugin.ts:316:11
     for (const { key, legendItemKey } of LEGEND_KEYS) {
       const value = data[item.index!];
       const resolved = getInterpolatedColorByValue(state, key, datasetIndex, Number(value));
-      if (resolved?.valid) {
+      if (true) {
         item[legendItemKey] = resolved.rgbString();
       }
killedBy: gradientPlugin afterUpdate applies an exact-match stop color directly to a per-data-point legend swatch (doughnut/radar-style legends)
statusReason: Cannot read properties of undefined (reading 'rgbString')

[Killed] OptionalChaining
src/gradientPlugin.ts:316:11
     for (const { key, legendItemKey } of LEGEND_KEYS) {
       const value = data[item.index!];
       const resolved = getInterpolatedColorByValue(state, key, datasetIndex, Number(value));
-      if (resolved?.valid) {
+      if (resolved.valid) {
         item[legendItemKey] = resolved.rgbString();
       }
killedBy: gradientPlugin afterUpdate applies an exact-match stop color directly to a per-data-point legend swatch (doughnut/radar-style legends)
statusReason: Cannot read properties of undefined (reading 'valid')

[Killed] BlockStatement
src/gradientPlugin.ts:324:96
 }
 
 /** Updates every visible legend item's swatch color(s) to reflect the current gradients. */
-function updateLegendItems(chart: Chart, legend: LiveLegend, state: GradientPluginState): void {
-  const boxHeight = legend.options.labels.boxHeight ?? legendBoxHeight(chart, legend.options);
-  const boxWidth = legend.options.labels.boxWidth ?? 0;
-  const datasets = chart.data.datasets as ChartConfigDataset[];
-  datasets.forEach((dataset, i) => {
-    const item = legend.legendItems?.[i];
-    if (!item) return;
-    if (item.datasetIndex === i) {
-      applyLegendGradientForDataset(chart, legend, state, item, boxWidth, boxHeight);
-    } else {
-      applyLegendGradientForDataIndex(legend, state, dataset, i);
-    }
-  });
-}
+function updateLegendItems(chart: Chart, legend: LiveLegend, state: GradientPluginState): void {}
 
 /** Builds the sorted stop-color list for one dataset property's gradient config, against the given scale. */
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] LogicalOperator
src/gradientPlugin.ts:325:21
 
 /** Updates every visible legend item's swatch color(s) to reflect the current gradients. */
 function updateLegendItems(chart: Chart, legend: LiveLegend, state: GradientPluginState): void {
-  const boxHeight = legend.options.labels.boxHeight ?? legendBoxHeight(chart, legend.options);
+  const boxHeight = legend.options.labels.boxHeight && legendBoxHeight(chart, legend.options);
   const boxWidth = legend.options.labels.boxWidth ?? 0;
   const datasets = chart.data.datasets as ChartConfigDataset[];
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: Cannot read properties of undefined (reading 'font')

[Killed] LogicalOperator
src/gradientPlugin.ts:326:20
 /** Updates every visible legend item's swatch color(s) to reflect the current gradients. */
 function updateLegendItems(chart: Chart, legend: LiveLegend, state: GradientPluginState): void {
   const boxHeight = legend.options.labels.boxHeight ?? legendBoxHeight(chart, legend.options);
-  const boxWidth = legend.options.labels.boxWidth ?? 0;
+  const boxWidth = legend.options.labels.boxWidth && 0;
   const datasets = chart.data.datasets as ChartConfigDataset[];
   datasets.forEach((dataset, i) => {
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] BlockStatement
src/gradientPlugin.ts:328:36
   const boxHeight = legend.options.labels.boxHeight ?? legendBoxHeight(chart, legend.options);
   const boxWidth = legend.options.labels.boxWidth ?? 0;
   const datasets = chart.data.datasets as ChartConfigDataset[];
-  datasets.forEach((dataset, i) => {
-    const item = legend.legendItems?.[i];
-    if (!item) return;
-    if (item.datasetIndex === i) {
-      applyLegendGradientForDataset(chart, legend, state, item, boxWidth, boxHeight);
-    } else {
-      applyLegendGradientForDataIndex(legend, state, dataset, i);
-    }
-  });
+  datasets.forEach((dataset, i) => {});
 }
 
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Survived] OptionalChaining
src/gradientPlugin.ts:329:18
   const boxWidth = legend.options.labels.boxWidth ?? 0;
   const datasets = chart.data.datasets as ChartConfigDataset[];
   datasets.forEach((dataset, i) => {
-    const item = legend.legendItems?.[i];
+    const item = legend.legendItems[i];
     if (!item) return;
     if (item.datasetIndex === i) {

[Killed] ConditionalExpression
src/gradientPlugin.ts:330:9
   const datasets = chart.data.datasets as ChartConfigDataset[];
   datasets.forEach((dataset, i) => {
     const item = legend.legendItems?.[i];
-    if (!item) return;
+    if (true) return;
     if (item.datasetIndex === i) {
       applyLegendGradientForDataset(chart, legend, state, item, boxWidth, boxHeight);
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] ConditionalExpression
src/gradientPlugin.ts:330:9
   const datasets = chart.data.datasets as ChartConfigDataset[];
   datasets.forEach((dataset, i) => {
     const item = legend.legendItems?.[i];
-    if (!item) return;
+    if (false) return;
     if (item.datasetIndex === i) {
       applyLegendGradientForDataset(chart, legend, state, item, boxWidth, boxHeight);
killedBy: gradientPlugin afterUpdate skips a dataset with no corresponding legend item (fewer legendItems than datasets)
statusReason: expected [Function] to not throw an error but 'TypeError: Cannot read properties of …' was thrown

[Killed] ConditionalExpression
src/gradientPlugin.ts:331:9
   datasets.forEach((dataset, i) => {
     const item = legend.legendItems?.[i];
     if (!item) return;
-    if (item.datasetIndex === i) {
+    if (true) {
       applyLegendGradientForDataset(chart, legend, state, item, boxWidth, boxHeight);
     } else {
killedBy: gradientPlugin afterUpdate applies an exact-match stop color directly to a per-data-point legend swatch (doughnut/radar-style legends)
statusReason: expected undefined to be 'rgb(255, 0, 0)' // Object.is equality

[Killed] BlockStatement
src/gradientPlugin.ts:331:34
   datasets.forEach((dataset, i) => {
     const item = legend.legendItems?.[i];
     if (!item) return;
-    if (item.datasetIndex === i) {
-      applyLegendGradientForDataset(chart, legend, state, item, boxWidth, boxHeight);
-    } else {
+    if (item.datasetIndex === i) {} else {
       applyLegendGradientForDataIndex(legend, state, dataset, i);
     }
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] BlockStatement
src/gradientPlugin.ts:333:12
     if (!item) return;
     if (item.datasetIndex === i) {
       applyLegendGradientForDataset(chart, legend, state, item, boxWidth, boxHeight);
-    } else {
-      applyLegendGradientForDataIndex(legend, state, dataset, i);
-    }
+    } else {}
   });
 }
killedBy: gradientPlugin afterUpdate applies an exact-match stop color directly to a per-data-point legend swatch (doughnut/radar-style legends)
statusReason: expected undefined to be 'rgb(255, 0, 0)' // Object.is equality

[Killed] BlockStatement
src/gradientPlugin.ts:340:94
 }
 
 /** Builds the sorted stop-color list for one dataset property's gradient config, against the given scale. */
-function buildStopColors(scale: Scale, colors: Record<string | number, string>): StopColor[] {
-  const stopColors: StopColor[] = [];
-  for (const value of Object.keys(colors)) {
-    const { pixel, stop } = getPixelStop(scale, value);
-    if (!isFinite(pixel) || !isFinite(stop)) continue;
-    const parsed = color(colors[value]);
-    if (parsed.valid) {
-      stopColors.push({ stop: Math.max(0, Math.min(1, stop)), color: parsed });
-    }
-  }
-  stopColors.sort((a, b) => a.stop - b.stop);
-  return stopColors;
-}
+function buildStopColors(scale: Scale, colors: Record<string | number, string>): StopColor[] {}
 
 /** Writes a computed gradient onto the dataset (and its live meta's own dataset element, if present) so Chart.js draws with it. */
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] ArrayDeclaration
src/gradientPlugin.ts:341:35
 
 /** Builds the sorted stop-color list for one dataset property's gradient config, against the given scale. */
 function buildStopColors(scale: Scale, colors: Record<string | number, string>): StopColor[] {
-  const stopColors: StopColor[] = [];
+  const stopColors: StopColor[] = ["Stryker was here"];
   for (const value of Object.keys(colors)) {
     const { pixel, stop } = getPixelStop(scale, value);
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: Cannot read properties of undefined (reading 'rgbString')

[Killed] BlockStatement
src/gradientPlugin.ts:342:44
 /** Builds the sorted stop-color list for one dataset property's gradient config, against the given scale. */
 function buildStopColors(scale: Scale, colors: Record<string | number, string>): StopColor[] {
   const stopColors: StopColor[] = [];
-  for (const value of Object.keys(colors)) {
-    const { pixel, stop } = getPixelStop(scale, value);
-    if (!isFinite(pixel) || !isFinite(stop)) continue;
-    const parsed = color(colors[value]);
-    if (parsed.valid) {
-      stopColors.push({ stop: Math.max(0, Math.min(1, stop)), color: parsed });
-    }
-  }
+  for (const value of Object.keys(colors)) {}
   stopColors.sort((a, b) => a.stop - b.stop);
   return stopColors;
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] ConditionalExpression
src/gradientPlugin.ts:344:9
   const stopColors: StopColor[] = [];
   for (const value of Object.keys(colors)) {
     const { pixel, stop } = getPixelStop(scale, value);
-    if (!isFinite(pixel) || !isFinite(stop)) continue;
+    if (false) continue;
     const parsed = color(colors[value]);
     if (parsed.valid) {
killedBy: gradientPlugin beforeDatasetsUpdate skips a color-map entry whose key does not parse to a finite pixel/stop
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] ConditionalExpression
src/gradientPlugin.ts:344:9
   const stopColors: StopColor[] = [];
   for (const value of Object.keys(colors)) {
     const { pixel, stop } = getPixelStop(scale, value);
-    if (!isFinite(pixel) || !isFinite(stop)) continue;
+    if (true) continue;
     const parsed = color(colors[value]);
     if (parsed.valid) {
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] BlockStatement
src/gradientPlugin.ts:346:23
     const { pixel, stop } = getPixelStop(scale, value);
     if (!isFinite(pixel) || !isFinite(stop)) continue;
     const parsed = color(colors[value]);
-    if (parsed.valid) {
-      stopColors.push({ stop: Math.max(0, Math.min(1, stop)), color: parsed });
-    }
+    if (parsed.valid) {}
   }
   stopColors.sort((a, b) => a.stop - b.stop);
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] ConditionalExpression
src/gradientPlugin.ts:346:9
     const { pixel, stop } = getPixelStop(scale, value);
     if (!isFinite(pixel) || !isFinite(stop)) continue;
     const parsed = color(colors[value]);
-    if (parsed.valid) {
+    if (false) {
       stopColors.push({ stop: Math.max(0, Math.min(1, stop)), color: parsed });
     }
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: expected "spy" to be called 2 times, but got 0 times
