[Killed] ConditionalExpression
src/zoomPlugin.ts:360:7
   const origMin = originalLimits.min.options ?? originalLimits.min.scale;
   const origMax = originalLimits.max.options ?? originalLimits.max.scale;
   const epsilon = range / 1e6;
-  if (Math.abs(min - origMin) < epsilon) min = origMin;
+  if (false) min = origMin;
   if (Math.abs(max - origMax) < epsilon) max = origMax;
   if (min < minLimit) {
killedBy: zoomPlugin category scale zoom/pan accumulates an unapplied pan delta rather than losing it, for a delta too small to move the range at all
statusReason: expected -9.999999703159119e-8 to be +0 // Object.is equality

[Killed] EqualityOperator
src/zoomPlugin.ts:360:7
   const origMin = originalLimits.min.options ?? originalLimits.min.scale;
   const origMax = originalLimits.max.options ?? originalLimits.max.scale;
   const epsilon = range / 1e6;
-  if (Math.abs(min - origMin) < epsilon) min = origMin;
+  if (Math.abs(min - origMin) >= epsilon) min = origMin;
   if (Math.abs(max - origMax) < epsilon) max = origMax;
   if (min < minLimit) {
killedBy: zoomPlugin programmatic zoom() zooming out (amount < 1) widens the range
statusReason: expected 50 to be greater than 50

[Killed] ArithmeticOperator
src/zoomPlugin.ts:361:16
   const origMax = originalLimits.max.options ?? originalLimits.max.scale;
   const epsilon = range / 1e6;
   if (Math.abs(min - origMin) < epsilon) min = origMin;
-  if (Math.abs(max - origMax) < epsilon) max = origMax;
+  if (Math.abs(max + origMax) < epsilon) max = origMax;
   if (min < minLimit) {
     min = minLimit;
killedBy: zoomPlugin category scale zoom/pan accumulates an unapplied pan delta rather than losing it, for a delta too small to move the range at all
statusReason: expected 99.9999999 to be 100 // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:361:7
   const origMax = originalLimits.max.options ?? originalLimits.max.scale;
   const epsilon = range / 1e6;
   if (Math.abs(min - origMin) < epsilon) min = origMin;
-  if (Math.abs(max - origMax) < epsilon) max = origMax;
+  if (false) max = origMax;
   if (min < minLimit) {
     min = minLimit;
killedBy: zoomPlugin category scale zoom/pan accumulates an unapplied pan delta rather than losing it, for a delta too small to move the range at all
statusReason: expected 99.9999999 to be 100 // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:362:7
   const epsilon = range / 1e6;
   if (Math.abs(min - origMin) < epsilon) min = origMin;
   if (Math.abs(max - origMax) < epsilon) max = origMax;
-  if (min < minLimit) {
+  if (true) {
     min = minLimit;
     max = Math.min(minLimit + range, maxLimit);
killedBy: zoomPlugin programmatic zoom() zooming out (amount < 1) widens the range
statusReason: expected NaN to be greater than 50

[Killed] ConditionalExpression
src/zoomPlugin.ts:362:7
   const epsilon = range / 1e6;
   if (Math.abs(min - origMin) < epsilon) min = origMin;
   if (Math.abs(max - origMax) < epsilon) max = origMax;
-  if (min < minLimit) {
+  if (false) {
     min = minLimit;
     max = Math.min(minLimit + range, maxLimit);
killedBy: zoomPlugin limits enforcement never zooms a scale past its own configured min/max limit
statusReason: expected -66445.13460159302 to be greater than or equal to 0

[Killed] ArithmeticOperator
src/zoomPlugin.ts:364:20
   if (Math.abs(max - origMax) < epsilon) max = origMax;
   if (min < minLimit) {
     min = minLimit;
-    max = Math.min(minLimit + range, maxLimit);
+    max = Math.min(minLimit - range, maxLimit);
   } else if (max > maxLimit) {
     max = maxLimit;
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) fixRange: clamps min to exactly minLimit, and computes max as exactly minLimit+range (not s
statusReason: expected -40 to be 40 // Object.is equality

[Killed] MethodExpression
src/zoomPlugin.ts:364:11
   if (Math.abs(max - origMax) < epsilon) max = origMax;
   if (min < minLimit) {
     min = minLimit;
-    max = Math.min(minLimit + range, maxLimit);
+    max = Math.max(minLimit + range, maxLimit);
   } else if (max > maxLimit) {
     max = maxLimit;
killedBy: zoomPlugin limits enforcement never zooms a scale past its own configured min/max limit
statusReason: expected 98526.12533569336 to be less than or equal to 100

[Killed] ConditionalExpression
src/zoomPlugin.ts:365:14
   if (min < minLimit) {
     min = minLimit;
     max = Math.min(minLimit + range, maxLimit);
-  } else if (max > maxLimit) {
+  } else if (true) {
     max = maxLimit;
     min = Math.max(maxLimit - range, minLimit);
killedBy: zoomPlugin programmatic zoom() zooming out (amount < 1) widens the range
statusReason: expected NaN to be greater than 50

[Killed] EqualityOperator
src/zoomPlugin.ts:365:14
   if (min < minLimit) {
     min = minLimit;
     max = Math.min(minLimit + range, maxLimit);
-  } else if (max > maxLimit) {
+  } else if (max <= maxLimit) {
     max = maxLimit;
     min = Math.max(maxLimit - range, minLimit);
killedBy: zoomPlugin programmatic zoom() zooming out (amount < 1) widens the range
statusReason: expected NaN to be greater than 50

[Killed] MethodExpression
src/zoomPlugin.ts:367:11
     max = Math.min(minLimit + range, maxLimit);
   } else if (max > maxLimit) {
     max = maxLimit;
-    min = Math.max(maxLimit - range, minLimit);
+    min = Math.min(maxLimit - range, minLimit);
   }
   return { min, max };
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) fixRange: clamps max to exactly maxLimit, and computes min as exactly maxLimit-range
statusReason: expected -1000 to be 60 // Object.is equality

[Killed] ArithmeticOperator
src/zoomPlugin.ts:367:20
     max = Math.min(minLimit + range, maxLimit);
   } else if (max > maxLimit) {
     max = maxLimit;
-    min = Math.max(maxLimit - range, minLimit);
+    min = Math.max(maxLimit + range, minLimit);
   }
   return { min, max };
killedBy: zoomPlugin limits enforcement clamps at the upper limit specifically (fixRange's own max > maxLimit branch, not just min < minLimit)
statusReason: expected 170 to be less than 100

[Survived] BooleanLiteral
src/zoomPlugin.ts:377:31
   scale: LiveScale,
   range: { min: number; max: number },
   limits: Record<string, ScaleLimits> | undefined,
-  zoomKind: boolean | 'pan' = false,
+  zoomKind: boolean | 'pan' = true,
 ): boolean {
   const state = getState(scale.chart);

[Killed] BlockStatement
src/zoomPlugin.ts:378:12
   range: { min: number; max: number },
   limits: Record<string, ScaleLimits> | undefined,
   zoomKind: boolean | 'pan' = false,
-): boolean {
-  const state = getState(scale.chart);
-  const scaleOpts = scale.options as { min?: number; max?: number };
-  const scaleLimits = getScaleLimits(scale, limits);
-  const { minRange = 0 } = scaleLimits;
-  const minLimit = getLimit(state, scale, scaleLimits, 'min', -Infinity);
-  const maxLimit = getLimit(state, scale, scaleLimits, 'max', Infinity);
-  if (zoomKind === 'pan' && (range.min < minLimit || range.max > maxLimit)) return true;
-  const scaleRange = scale.max - scale.min;
-  const newSpan = zoomKind ? Math.max(range.max - range.min, minRange) : scaleRange;
-  if (zoomKind && newSpan === minRange && scaleRange <= minRange) return true;
-  const fixed = fixRange(newSpan, { min: range.min, max: range.max, minLimit, maxLimit }, state.originalScaleLimits[scale.id]);
-  scaleOpts.min = fixed.min;
-  scaleOpts.max = fixed.max;
-  state.updatedScaleLimits[scale.id] = fixed;
-  return scale.parse(fixed.min) !== scale.min || scale.parse(fixed.max) !== scale.max;
-}
+): boolean {}
 function zoomNumericalScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
   const delta = linearZoomDelta(scale, zoomAmount, center);
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: expected undefined to be defined

[Killed] UnaryOperator
src/zoomPlugin.ts:383:63
   const scaleOpts = scale.options as { min?: number; max?: number };
   const scaleLimits = getScaleLimits(scale, limits);
   const { minRange = 0 } = scaleLimits;
-  const minLimit = getLimit(state, scale, scaleLimits, 'min', -Infinity);
+  const minLimit = getLimit(state, scale, scaleLimits, 'min', +Infinity);
   const maxLimit = getLimit(state, scale, scaleLimits, 'max', Infinity);
   if (zoomKind === 'pan' && (range.min < minLimit || range.max > maxLimit)) return true;
killedBy: zoomPlugin programmatic zoom() zooming out (amount < 1) widens the range
statusReason: expected NaN to be greater than 50

[Killed] StringLiteral
src/zoomPlugin.ts:383:56
   const scaleOpts = scale.options as { min?: number; max?: number };
   const scaleLimits = getScaleLimits(scale, limits);
   const { minRange = 0 } = scaleLimits;
-  const minLimit = getLimit(state, scale, scaleLimits, 'min', -Infinity);
+  const minLimit = getLimit(state, scale, scaleLimits, "", -Infinity);
   const maxLimit = getLimit(state, scale, scaleLimits, 'max', Infinity);
   if (zoomKind === 'pan' && (range.min < minLimit || range.max > maxLimit)) return true;
killedBy: zoomPlugin limits enforcement never zooms a scale past its own configured min/max limit
statusReason: expected -66445.13460159302 to be greater than or equal to 0

[Killed] ConditionalExpression
src/zoomPlugin.ts:385:30
   const { minRange = 0 } = scaleLimits;
   const minLimit = getLimit(state, scale, scaleLimits, 'min', -Infinity);
   const maxLimit = getLimit(state, scale, scaleLimits, 'max', Infinity);
-  if (zoomKind === 'pan' && (range.min < minLimit || range.max > maxLimit)) return true;
+  if (zoomKind === 'pan' && (true)) return true;
   const scaleRange = scale.max - scale.min;
   const newSpan = zoomKind ? Math.max(range.max - range.min, minRange) : scaleRange;
killedBy: zoomPlugin category scale zoom/pan pans a non-linear scale type (e.g. timeseries) using panNonLinearScale, not the plain default
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/zoomPlugin.ts:385:7
   const { minRange = 0 } = scaleLimits;
   const minLimit = getLimit(state, scale, scaleLimits, 'min', -Infinity);
   const maxLimit = getLimit(state, scale, scaleLimits, 'max', Infinity);
-  if (zoomKind === 'pan' && (range.min < minLimit || range.max > maxLimit)) return true;
+  if (zoomKind === 'pan' || range.min < minLimit || range.max > maxLimit) return true;
   const scaleRange = scale.max - scale.min;
   const newSpan = zoomKind ? Math.max(range.max - range.min, minRange) : scaleRange;
killedBy: zoomPlugin category scale zoom/pan pans a non-linear scale type (e.g. timeseries) using panNonLinearScale, not the plain default
statusReason: expected undefined to be defined

[Killed] ArithmeticOperator
src/zoomPlugin.ts:386:22
   const minLimit = getLimit(state, scale, scaleLimits, 'min', -Infinity);
   const maxLimit = getLimit(state, scale, scaleLimits, 'max', Infinity);
   if (zoomKind === 'pan' && (range.min < minLimit || range.max > maxLimit)) return true;
-  const scaleRange = scale.max - scale.min;
+  const scaleRange = scale.max + scale.min;
   const newSpan = zoomKind ? Math.max(range.max - range.min, minRange) : scaleRange;
   if (zoomKind && newSpan === minRange && scaleRange <= minRange) return true;
killedBy: zoomPlugin limits enforcement rejects zooming in further once already at the configured minRange (updateRange's own minRange-reached check)
statusReason: expected 50 to be undefined

[Killed] MethodExpression
src/zoomPlugin.ts:387:30
   const maxLimit = getLimit(state, scale, scaleLimits, 'max', Infinity);
   if (zoomKind === 'pan' && (range.min < minLimit || range.max > maxLimit)) return true;
   const scaleRange = scale.max - scale.min;
-  const newSpan = zoomKind ? Math.max(range.max - range.min, minRange) : scaleRange;
+  const newSpan = zoomKind ? Math.min(range.max - range.min, minRange) : scaleRange;
   if (zoomKind && newSpan === minRange && scaleRange <= minRange) return true;
   const fixed = fixRange(newSpan, { min: range.min, max: range.max, minLimit, maxLimit }, state.originalScaleLimits[scale.id]);
killedBy: zoomPlugin programmatic zoom() zooming out (amount < 1) widens the range
statusReason: expected 0 to be greater than 50

[Killed] ArithmeticOperator
src/zoomPlugin.ts:387:39
   const maxLimit = getLimit(state, scale, scaleLimits, 'max', Infinity);
   if (zoomKind === 'pan' && (range.min < minLimit || range.max > maxLimit)) return true;
   const scaleRange = scale.max - scale.min;
-  const newSpan = zoomKind ? Math.max(range.max - range.min, minRange) : scaleRange;
+  const newSpan = zoomKind ? Math.max(range.max + range.min, minRange) : scaleRange;
   if (zoomKind && newSpan === minRange && scaleRange <= minRange) return true;
   const fixed = fixRange(newSpan, { min: range.min, max: range.max, minLimit, maxLimit }, state.originalScaleLimits[scale.id]);
killedBy: zoomPlugin programmatic zoom() treats an undefined zoom.mode as enabling every direction (directionEnabled's own default branch)
statusReason: expected +0 to be close to 100, received difference is 100, but expected 0.000005

[Killed] ConditionalExpression
src/zoomPlugin.ts:388:7
   if (zoomKind === 'pan' && (range.min < minLimit || range.max > maxLimit)) return true;
   const scaleRange = scale.max - scale.min;
   const newSpan = zoomKind ? Math.max(range.max - range.min, minRange) : scaleRange;
-  if (zoomKind && newSpan === minRange && scaleRange <= minRange) return true;
+  if (false) return true;
   const fixed = fixRange(newSpan, { min: range.min, max: range.max, minLimit, maxLimit }, state.originalScaleLimits[scale.id]);
   scaleOpts.min = fixed.min;
killedBy: zoomPlugin limits enforcement rejects zooming in further once already at the configured minRange (updateRange's own minRange-reached check)
statusReason: expected 50 to be undefined

[Killed] EqualityOperator
src/zoomPlugin.ts:388:43
   if (zoomKind === 'pan' && (range.min < minLimit || range.max > maxLimit)) return true;
   const scaleRange = scale.max - scale.min;
   const newSpan = zoomKind ? Math.max(range.max - range.min, minRange) : scaleRange;
-  if (zoomKind && newSpan === minRange && scaleRange <= minRange) return true;
+  if (zoomKind && newSpan === minRange && scaleRange < minRange) return true;
   const fixed = fixRange(newSpan, { min: range.min, max: range.max, minLimit, maxLimit }, state.originalScaleLimits[scale.id]);
   scaleOpts.min = fixed.min;
killedBy: zoomPlugin limits enforcement rejects zooming in further once already at the configured minRange (updateRange's own minRange-reached check)
statusReason: expected 50 to be undefined

[Killed] ObjectLiteral
src/zoomPlugin.ts:389:35
   const scaleRange = scale.max - scale.min;
   const newSpan = zoomKind ? Math.max(range.max - range.min, minRange) : scaleRange;
   if (zoomKind && newSpan === minRange && scaleRange <= minRange) return true;
-  const fixed = fixRange(newSpan, { min: range.min, max: range.max, minLimit, maxLimit }, state.originalScaleLimits[scale.id]);
+  const fixed = fixRange(newSpan, {}, state.originalScaleLimits[scale.id]);
   scaleOpts.min = fixed.min;
   scaleOpts.max = fixed.max;
killedBy: zoomPlugin programmatic zoom() zooming out (amount < 1) widens the range
statusReason: expected NaN to be greater than 50

[Survived] ConditionalExpression
src/zoomPlugin.ts:393:50
   scaleOpts.min = fixed.min;
   scaleOpts.max = fixed.max;
   state.updatedScaleLimits[scale.id] = fixed;
-  return scale.parse(fixed.min) !== scale.min || scale.parse(fixed.max) !== scale.max;
+  return scale.parse(fixed.min) !== scale.min || false;
 }
 function zoomNumericalScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {

[Survived] LogicalOperator
src/zoomPlugin.ts:393:10
   scaleOpts.min = fixed.min;
   scaleOpts.max = fixed.max;
   state.updatedScaleLimits[scale.id] = fixed;
-  return scale.parse(fixed.min) !== scale.min || scale.parse(fixed.max) !== scale.max;
+  return scale.parse(fixed.min) !== scale.min && scale.parse(fixed.max) !== scale.max;
 }
 function zoomNumericalScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {

[Killed] BlockStatement
src/zoomPlugin.ts:395:146
   state.updatedScaleLimits[scale.id] = fixed;
   return scale.parse(fixed.min) !== scale.min || scale.parse(fixed.max) !== scale.max;
 }
-function zoomNumericalScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
-  const delta = linearZoomDelta(scale, zoomAmount, center);
-  return updateRange(scale, { min: scale.min + delta.min, max: scale.max - delta.max }, limits, true);
-}
+function zoomNumericalScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {}
 function zoomLogarithmicScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
   return updateRange(scale, logarithmicZoomRange(scale, zoomAmount, center), limits, true);
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: expected undefined to be defined

[Killed] ArithmeticOperator
src/zoomPlugin.ts:397:36
 }
 function zoomNumericalScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
   const delta = linearZoomDelta(scale, zoomAmount, center);
-  return updateRange(scale, { min: scale.min + delta.min, max: scale.max - delta.max }, limits, true);
+  return updateRange(scale, { min: scale.min - delta.min, max: scale.max - delta.max }, limits, true);
 }
 function zoomLogarithmicScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
killedBy: zoomPlugin programmatic zoom() zooming out (amount < 1) widens the range
statusReason: expected 25 to be greater than 50

[Killed] ArithmeticOperator
src/zoomPlugin.ts:397:64
 }
 function zoomNumericalScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
   const delta = linearZoomDelta(scale, zoomAmount, center);
-  return updateRange(scale, { min: scale.min + delta.min, max: scale.max - delta.max }, limits, true);
+  return updateRange(scale, { min: scale.min + delta.min, max: scale.max + delta.max }, limits, true);
 }
 function zoomLogarithmicScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) zoomDelta: focal point exactly at scale.min keeps min exactly unchanged (all the zoom lands
statusReason: expected 200 to be less than 100

[Killed] BlockStatement
src/zoomPlugin.ts:399:148
   const delta = linearZoomDelta(scale, zoomAmount, center);
   return updateRange(scale, { min: scale.min + delta.min, max: scale.max - delta.max }, limits, true);
 }
-function zoomLogarithmicScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
-  return updateRange(scale, logarithmicZoomRange(scale, zoomAmount, center), limits, true);
-}
+function zoomLogarithmicScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {}
 function zoomRectNumericalScale(scale: LiveScale, from: number, to: number, limits: Record<string, ScaleLimits> | undefined): void {
   updateRange(scale, linearRange(scale, from, to), limits, true);
killedBy: zoomPlugin logarithmic scale zoom zooms a logarithmic scale using log-space math, not linear math
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BooleanLiteral
src/zoomPlugin.ts:400:86
   return updateRange(scale, { min: scale.min + delta.min, max: scale.max - delta.max }, limits, true);
 }
 function zoomLogarithmicScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
-  return updateRange(scale, logarithmicZoomRange(scale, zoomAmount, center), limits, true);
+  return updateRange(scale, logarithmicZoomRange(scale, zoomAmount, center), limits, false);
 }
 function zoomRectNumericalScale(scale: LiveScale, from: number, to: number, limits: Record<string, ScaleLimits> | undefined): void {
killedBy: zoomPlugin logarithmic scale zoom zooms a logarithmic scale using log-space math, not linear math
statusReason: expected -299.5 to be greater than 0

[Killed] BlockStatement
src/zoomPlugin.ts:402:132
 function zoomLogarithmicScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
   return updateRange(scale, logarithmicZoomRange(scale, zoomAmount, center), limits, true);
 }
-function zoomRectNumericalScale(scale: LiveScale, from: number, to: number, limits: Record<string, ScaleLimits> | undefined): void {
-  updateRange(scale, linearRange(scale, from, to), limits, true);
-}
+function zoomRectNumericalScale(scale: LiveScale, from: number, to: number, limits: Record<string, ScaleLimits> | undefined): void {}
 const integerChange = (v: number): number => (v === 0 || isNaN(v) ? 0 : v < 0 ? Math.min(Math.round(v), -1) : Math.max(Math.round(v), 1));
 function existCategoryFromMaxZoom(scale: LiveScale): void {
killedBy: zoomPlugin programmatic zoom() resolves mode as a function of the chart, not just a string literal
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/zoomPlugin.ts:403:60
   return updateRange(scale, logarithmicZoomRange(scale, zoomAmount, center), limits, true);
 }
 function zoomRectNumericalScale(scale: LiveScale, from: number, to: number, limits: Record<string, ScaleLimits> | undefined): void {
-  updateRange(scale, linearRange(scale, from, to), limits, true);
+  updateRange(scale, linearRange(scale, from, to), limits, false);
 }
 const integerChange = (v: number): number => (v === 0 || isNaN(v) ? 0 : v < 0 ? Math.min(Math.round(v), -1) : Math.max(Math.round(v), 1));
killedBy: zoomPlugin programmatic zoom() treats an undefined zoom.mode as enabling every direction (directionEnabled's own default branch)
statusReason: expected 150 to be close to 100, received difference is 50, but expected 0.000005

[Killed] EqualityOperator
src/zoomPlugin.ts:405:47
 function zoomRectNumericalScale(scale: LiveScale, from: number, to: number, limits: Record<string, ScaleLimits> | undefined): void {
   updateRange(scale, linearRange(scale, from, to), limits, true);
 }
-const integerChange = (v: number): number => (v === 0 || isNaN(v) ? 0 : v < 0 ? Math.min(Math.round(v), -1) : Math.max(Math.round(v), 1));
+const integerChange = (v: number): number => (v !== 0 || isNaN(v) ? 0 : v < 0 ? Math.min(Math.round(v), -1) : Math.max(Math.round(v), 1));
 function existCategoryFromMaxZoom(scale: LiveScale): void {
   const maxIndex = scale.getLabels().length - 1;
killedBy: zoomPlugin category scale zoom/pan extends the category range by one label when fully zoomed in and zooming out further
statusReason: expected 4 to be less than 4

[Killed] ConditionalExpression
src/zoomPlugin.ts:405:47
 function zoomRectNumericalScale(scale: LiveScale, from: number, to: number, limits: Record<string, ScaleLimits> | undefined): void {
   updateRange(scale, linearRange(scale, from, to), limits, true);
 }
-const integerChange = (v: number): number => (v === 0 || isNaN(v) ? 0 : v < 0 ? Math.min(Math.round(v), -1) : Math.max(Math.round(v), 1));
+const integerChange = (v: number): number => (false ? 0 : v < 0 ? Math.min(Math.round(v), -1) : Math.max(Math.round(v), 1));
 function existCategoryFromMaxZoom(scale: LiveScale): void {
   const maxIndex = scale.getLabels().length - 1;
killedBy: zoomPlugin category scale zoom/pan zooms a category scale using integer index stepping, not fractional values
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/zoomPlugin.ts:406:59
   updateRange(scale, linearRange(scale, from, to), limits, true);
 }
 const integerChange = (v: number): number => (v === 0 || isNaN(v) ? 0 : v < 0 ? Math.min(Math.round(v), -1) : Math.max(Math.round(v), 1));
-function existCategoryFromMaxZoom(scale: LiveScale): void {
-  const maxIndex = scale.getLabels().length - 1;
-  if (scale.min > 0) scale.min -= 1;
-  if (scale.max < maxIndex) scale.max += 1;
-}
+function existCategoryFromMaxZoom(scale: LiveScale): void {}
 function zoomCategoryScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
   const delta = linearZoomDelta(scale, zoomAmount, center);
killedBy: zoomPlugin category scale zoom/pan extends the category range by one label when fully zoomed in and zooming out further
statusReason: actual value must be number or bigint, received "undefined"

[Survived] ArithmeticOperator
src/zoomPlugin.ts:407:20
 }
 const integerChange = (v: number): number => (v === 0 || isNaN(v) ? 0 : v < 0 ? Math.min(Math.round(v), -1) : Math.max(Math.round(v), 1));
 function existCategoryFromMaxZoom(scale: LiveScale): void {
-  const maxIndex = scale.getLabels().length - 1;
+  const maxIndex = scale.getLabels().length + 1;
   if (scale.min > 0) scale.min -= 1;
   if (scale.max < maxIndex) scale.max += 1;

[Killed] EqualityOperator
src/zoomPlugin.ts:408:7
 const integerChange = (v: number): number => (v === 0 || isNaN(v) ? 0 : v < 0 ? Math.min(Math.round(v), -1) : Math.max(Math.round(v), 1));
 function existCategoryFromMaxZoom(scale: LiveScale): void {
   const maxIndex = scale.getLabels().length - 1;
-  if (scale.min > 0) scale.min -= 1;
+  if (scale.min <= 0) scale.min -= 1;
   if (scale.max < maxIndex) scale.max += 1;
 }
killedBy: zoomPlugin category scale zoom/pan extends the category range by one label when fully zoomed in and zooming out further
statusReason: expected 4 to be less than 4

[Killed] AssignmentOperator
src/zoomPlugin.ts:408:22
 const integerChange = (v: number): number => (v === 0 || isNaN(v) ? 0 : v < 0 ? Math.min(Math.round(v), -1) : Math.max(Math.round(v), 1));
 function existCategoryFromMaxZoom(scale: LiveScale): void {
   const maxIndex = scale.getLabels().length - 1;
-  if (scale.min > 0) scale.min -= 1;
+  if (scale.min > 0) scale.min += 1;
   if (scale.max < maxIndex) scale.max += 1;
 }
killedBy: zoomPlugin category scale zoom/pan extends the category range by one label when fully zoomed in and zooming out further
statusReason: actual value must be number or bigint, received "undefined"

[Killed] AssignmentOperator
src/zoomPlugin.ts:409:29
 function existCategoryFromMaxZoom(scale: LiveScale): void {
   const maxIndex = scale.getLabels().length - 1;
   if (scale.min > 0) scale.min -= 1;
-  if (scale.max < maxIndex) scale.max += 1;
+  if (scale.max < maxIndex) scale.max -= 1;
 }
 function zoomCategoryScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
killedBy: zoomPlugin category scale zoom/pan extends the category range by one label when fully zoomed in and zooming out further
statusReason: actual value must be number or bigint, received "undefined"

[Killed] EqualityOperator
src/zoomPlugin.ts:409:7
 function existCategoryFromMaxZoom(scale: LiveScale): void {
   const maxIndex = scale.getLabels().length - 1;
   if (scale.min > 0) scale.min -= 1;
-  if (scale.max < maxIndex) scale.max += 1;
+  if (scale.max >= maxIndex) scale.max += 1;
 }
 function zoomCategoryScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
killedBy: zoomPlugin category scale zoom/pan extends the category range by one label when fully zoomed in and zooming out further
statusReason: expected 4 to be greater than 4

[Killed] BlockStatement
src/zoomPlugin.ts:411:145
   if (scale.min > 0) scale.min -= 1;
   if (scale.max < maxIndex) scale.max += 1;
 }
-function zoomCategoryScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
-  const delta = linearZoomDelta(scale, zoomAmount, center);
-  if (scale.min === scale.max && zoomAmount < 1) existCategoryFromMaxZoom(scale);
-  return updateRange(scale, { min: scale.min + integerChange(delta.min), max: scale.max - integerChange(delta.max) }, limits, true);
-}
+function zoomCategoryScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {}
 function scaleLength(scale: LiveScale): number {
   return scale.isHorizontal() ? scale.width : scale.height;
killedBy: zoomPlugin category scale zoom/pan zooms a category scale using integer index stepping, not fractional values
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/zoomPlugin.ts:413:7
 }
 function zoomCategoryScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
   const delta = linearZoomDelta(scale, zoomAmount, center);
-  if (scale.min === scale.max && zoomAmount < 1) existCategoryFromMaxZoom(scale);
+  if (scale.min !== scale.max && zoomAmount < 1) existCategoryFromMaxZoom(scale);
   return updateRange(scale, { min: scale.min + integerChange(delta.min), max: scale.max - integerChange(delta.max) }, limits, true);
 }
killedBy: zoomPlugin category scale zoom/pan extends the category range by one label when fully zoomed in and zooming out further
statusReason: actual value must be number or bigint, received "undefined"
