[Killed] MethodExpression
src/gradientPlugin.ts:347:31
     if (!isFinite(pixel) || !isFinite(stop)) continue;
     const parsed = color(colors[value]);
     if (parsed.valid) {
-      stopColors.push({ stop: Math.max(0, Math.min(1, stop)), color: parsed });
+      stopColors.push({ stop: Math.min(0, Math.min(1, stop)), color: parsed });
     }
   }
killedBy: gradientPlugin beforeDatasetsUpdate sorts and clamps stop colors correctly for an out-of-order color map
statusReason: expected +0 to be close to 1, received difference is 1, but expected 0.000005

[Killed] MethodExpression
src/gradientPlugin.ts:347:43
     if (!isFinite(pixel) || !isFinite(stop)) continue;
     const parsed = color(colors[value]);
     if (parsed.valid) {
-      stopColors.push({ stop: Math.max(0, Math.min(1, stop)), color: parsed });
+      stopColors.push({ stop: Math.max(0, Math.max(1, stop)), color: parsed });
     }
   }
killedBy: gradientPlugin beforeDatasetsUpdate sorts and clamps stop colors correctly for an out-of-order color map
statusReason: expected 1 to be close to +0, received difference is 1, but expected 0.000005

[Survived] MethodExpression
src/gradientPlugin.ts:350:3
       stopColors.push({ stop: Math.max(0, Math.min(1, stop)), color: parsed });
     }
   }
-  stopColors.sort((a, b) => a.stop - b.stop);
+  stopColors;
   return stopColors;
 }

[Survived] ArrowFunction
src/gradientPlugin.ts:350:19
       stopColors.push({ stop: Math.max(0, Math.min(1, stop)), color: parsed });
     }
   }
-  stopColors.sort((a, b) => a.stop - b.stop);
+  stopColors.sort(() => undefined);
   return stopColors;
 }

[Killed] BlockStatement
src/gradientPlugin.ts:355:114
 }
 
 /** Writes a computed gradient onto the dataset (and its live meta's own dataset element, if present) so Chart.js draws with it. */
-function setDatasetColor(meta: ChartMeta, dataset: ChartConfigDataset, key: string, value: CanvasGradient): void {
-  dataset[key] = value;
-  const metaDataset = meta.dataset as { options?: Record<string, unknown> } & Record<string, unknown> | undefined;
-  if (!metaDataset) return;
-  if (metaDataset.options) {
-    metaDataset.options[key] = value;
-  } else {
-    metaDataset[key] = value;
-  }
-}
+function setDatasetColor(meta: ChartMeta, dataset: ChartConfigDataset, key: string, value: CanvasGradient): void {}
 
 /** Returns (and refreshes, if this dataset isn't hidden) the state array a new gradient entry should be pushed into. */
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] ConditionalExpression
src/gradientPlugin.ts:358:7
 function setDatasetColor(meta: ChartMeta, dataset: ChartConfigDataset, key: string, value: CanvasGradient): void {
   dataset[key] = value;
   const metaDataset = meta.dataset as { options?: Record<string, unknown> } & Record<string, unknown> | undefined;
-  if (!metaDataset) return;
+  if (true) return;
   if (metaDataset.options) {
     metaDataset.options[key] = value;
killedBy: gradientPlugin afterUpdate writes the computed gradient onto meta.dataset.options when present (not just the plain dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] ConditionalExpression
src/gradientPlugin.ts:358:7
 function setDatasetColor(meta: ChartMeta, dataset: ChartConfigDataset, key: string, value: CanvasGradient): void {
   dataset[key] = value;
   const metaDataset = meta.dataset as { options?: Record<string, unknown> } & Record<string, unknown> | undefined;
-  if (!metaDataset) return;
+  if (false) return;
   if (metaDataset.options) {
     metaDataset.options[key] = value;
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: Cannot read properties of undefined (reading 'options')

[Killed] ConditionalExpression
src/gradientPlugin.ts:359:7
   dataset[key] = value;
   const metaDataset = meta.dataset as { options?: Record<string, unknown> } & Record<string, unknown> | undefined;
   if (!metaDataset) return;
-  if (metaDataset.options) {
+  if (true) {
     metaDataset.options[key] = value;
   } else {
killedBy: gradientPlugin afterUpdate writes the computed gradient directly onto meta.dataset when it has no own options object
statusReason: Cannot set properties of undefined (setting 'backgroundColor')

[Killed] ConditionalExpression
src/gradientPlugin.ts:359:7
   dataset[key] = value;
   const metaDataset = meta.dataset as { options?: Record<string, unknown> } & Record<string, unknown> | undefined;
   if (!metaDataset) return;
-  if (metaDataset.options) {
+  if (false) {
     metaDataset.options[key] = value;
   } else {
killedBy: gradientPlugin afterUpdate writes the computed gradient onto meta.dataset.options when present (not just the plain dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] BlockStatement
src/gradientPlugin.ts:361:10
   if (!metaDataset) return;
   if (metaDataset.options) {
     metaDataset.options[key] = value;
-  } else {
-    metaDataset[key] = value;
-  }
+  } else {}
 }
 
killedBy: gradientPlugin afterUpdate writes the computed gradient directly onto meta.dataset when it has no own options object
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] BlockStatement
src/gradientPlugin.ts:367:130
 }
 
 /** Returns (and refreshes, if this dataset isn't hidden) the state array a new gradient entry should be pushed into. */
-function getStateEntries(state: GradientPluginState, meta: ChartMeta, key: string, datasetIndex: number): DatasetGradientState[] {
-  let entries = state.options.get(key);
-  if (!entries) {
-    entries = [];
-    state.options.set(key, entries);
-  } else if (!meta.hidden) {
-    entries = entries.filter((el) => el.datasetIndex !== datasetIndex);
-    state.options.set(key, entries);
-  }
-  return entries;
-}
+function getStateEntries(state: GradientPluginState, meta: ChartMeta, key: string, datasetIndex: number): DatasetGradientState[] {}
 
 /** Computes and applies every configured gradient (`backgroundColor`/`borderColor`) for one dataset. */
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] BlockStatement
src/gradientPlugin.ts:369:17
 /** Returns (and refreshes, if this dataset isn't hidden) the state array a new gradient entry should be pushed into. */
 function getStateEntries(state: GradientPluginState, meta: ChartMeta, key: string, datasetIndex: number): DatasetGradientState[] {
   let entries = state.options.get(key);
-  if (!entries) {
-    entries = [];
-    state.options.set(key, entries);
-  } else if (!meta.hidden) {
+  if (!entries) {} else if (!meta.hidden) {
     entries = entries.filter((el) => el.datasetIndex !== datasetIndex);
     state.options.set(key, entries);
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: Cannot read properties of undefined (reading 'push')

[Killed] ConditionalExpression
src/gradientPlugin.ts:369:7
 /** Returns (and refreshes, if this dataset isn't hidden) the state array a new gradient entry should be pushed into. */
 function getStateEntries(state: GradientPluginState, meta: ChartMeta, key: string, datasetIndex: number): DatasetGradientState[] {
   let entries = state.options.get(key);
-  if (!entries) {
+  if (false) {
     entries = [];
     state.options.set(key, entries);
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: Cannot read properties of undefined (reading 'filter')

[Survived] ArrayDeclaration
src/gradientPlugin.ts:370:15
 function getStateEntries(state: GradientPluginState, meta: ChartMeta, key: string, datasetIndex: number): DatasetGradientState[] {
   let entries = state.options.get(key);
   if (!entries) {
-    entries = [];
+    entries = ["Stryker was here"];
     state.options.set(key, entries);
   } else if (!meta.hidden) {

[Survived] BooleanLiteral
src/gradientPlugin.ts:372:14
   if (!entries) {
     entries = [];
     state.options.set(key, entries);
-  } else if (!meta.hidden) {
+  } else if (meta.hidden) {
     entries = entries.filter((el) => el.datasetIndex !== datasetIndex);
     state.options.set(key, entries);

[Survived] ConditionalExpression
src/gradientPlugin.ts:372:14
   if (!entries) {
     entries = [];
     state.options.set(key, entries);
-  } else if (!meta.hidden) {
+  } else if (true) {
     entries = entries.filter((el) => el.datasetIndex !== datasetIndex);
     state.options.set(key, entries);

[Survived] ConditionalExpression
src/gradientPlugin.ts:373:38
     entries = [];
     state.options.set(key, entries);
   } else if (!meta.hidden) {
-    entries = entries.filter((el) => el.datasetIndex !== datasetIndex);
+    entries = entries.filter((el) => false);
     state.options.set(key, entries);
   }

[Survived] ConditionalExpression
src/gradientPlugin.ts:373:38
     entries = [];
     state.options.set(key, entries);
   } else if (!meta.hidden) {
-    entries = entries.filter((el) => el.datasetIndex !== datasetIndex);
+    entries = entries.filter((el) => true);
     state.options.set(key, entries);
   }

[Killed] BlockStatement
src/gradientPlugin.ts:386:9
   gradient: GradientDatasetConfig,
   dataset: ChartConfigDataset,
   datasetIndex: number,
-): void {
-  const ctx = chart.ctx;
-  const meta = chart.getDatasetMeta(datasetIndex);
-  if (meta.hidden) return;
-
-  for (const [key, config] of Object.entries(gradient) as Array<[string, { axis: GradientAxis; colors: Record<string | number, string> } | undefined]>) {
-    if (!config?.colors) continue;
-    const { axis, colors } = config;
-    const scale = getAxisScale(meta, axis);
-    if (!scale) {
-      console.warn(`keystone-chartjs-core: gradient plugin found no '${axis}'-axis scale for datasets[${datasetIndex}] of chart id ${chart.id}, skipping.`);
-      continue;
-    }
-    const entries = getStateEntries(state, meta, key, datasetIndex);
-    const entry: DatasetGradientState = { datasetIndex, axis, scale, stopColors: [] };
-    entries.push(entry);
-    const gradientObj = createGradient(ctx, axis, scaleToGradientArea(scale));
-    entry.stopColors = buildStopColors(scale, colors);
-    if (entry.stopColors.length > 0) {
-      applyColorStops(gradientObj, entry.stopColors);
-      setDatasetColor(meta, dataset, key, gradientObj);
-    }
-  }
-}
+): void {}
 
 /**
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/gradientPlugin.ts:389:7
 ): void {
   const ctx = chart.ctx;
   const meta = chart.getDatasetMeta(datasetIndex);
-  if (meta.hidden) return;
+  if (true) return;
 
   for (const [key, config] of Object.entries(gradient) as Array<[string, { axis: GradientAxis; colors: Record<string | number, string> } | undefined]>) {
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/gradientPlugin.ts:389:7
 ): void {
   const ctx = chart.ctx;
   const meta = chart.getDatasetMeta(datasetIndex);
-  if (meta.hidden) return;
+  if (false) return;
 
   for (const [key, config] of Object.entries(gradient) as Array<[string, { axis: GradientAxis; colors: Record<string | number, string> } | undefined]>) {
killedBy: gradientPlugin beforeDatasetsUpdate skips a hidden dataset
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      0,

[Killed] BlockStatement
src/gradientPlugin.ts:391:153
   const meta = chart.getDatasetMeta(datasetIndex);
   if (meta.hidden) return;
 
-  for (const [key, config] of Object.entries(gradient) as Array<[string, { axis: GradientAxis; colors: Record<string | number, string> } | undefined]>) {
-    if (!config?.colors) continue;
-    const { axis, colors } = config;
-    const scale = getAxisScale(meta, axis);
-    if (!scale) {
-      console.warn(`keystone-chartjs-core: gradient plugin found no '${axis}'-axis scale for datasets[${datasetIndex}] of chart id ${chart.id}, skipping.`);
-      continue;
-    }
-    const entries = getStateEntries(state, meta, key, datasetIndex);
-    const entry: DatasetGradientState = { datasetIndex, axis, scale, stopColors: [] };
-    entries.push(entry);
-    const gradientObj = createGradient(ctx, axis, scaleToGradientArea(scale));
-    entry.stopColors = buildStopColors(scale, colors);
-    if (entry.stopColors.length > 0) {
-      applyColorStops(gradientObj, entry.stopColors);
-      setDatasetColor(meta, dataset, key, gradientObj);
-    }
-  }
+  for (const [key, config] of Object.entries(gradient) as Array<[string, { axis: GradientAxis; colors: Record<string | number, string> } | undefined]>) {}
 }
 
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/gradientPlugin.ts:392:9
   if (meta.hidden) return;
 
   for (const [key, config] of Object.entries(gradient) as Array<[string, { axis: GradientAxis; colors: Record<string | number, string> } | undefined]>) {
-    if (!config?.colors) continue;
+    if (config?.colors) continue;
     const { axis, colors } = config;
     const scale = getAxisScale(meta, axis);
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/gradientPlugin.ts:392:9
   if (meta.hidden) return;
 
   for (const [key, config] of Object.entries(gradient) as Array<[string, { axis: GradientAxis; colors: Record<string | number, string> } | undefined]>) {
-    if (!config?.colors) continue;
+    if (true) continue;
     const { axis, colors } = config;
     const scale = getAxisScale(meta, axis);
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/gradientPlugin.ts:395:9
     if (!config?.colors) continue;
     const { axis, colors } = config;
     const scale = getAxisScale(meta, axis);
-    if (!scale) {
+    if (false) {
       console.warn(`keystone-chartjs-core: gradient plugin found no '${axis}'-axis scale for datasets[${datasetIndex}] of chart id ${chart.id}, skipping.`);
       continue;
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: Cannot destructure property 'left' of 'scale' as it is undefined.

[Killed] ConditionalExpression
src/gradientPlugin.ts:395:9
     if (!config?.colors) continue;
     const { axis, colors } = config;
     const scale = getAxisScale(meta, axis);
-    if (!scale) {
+    if (true) {
       console.warn(`keystone-chartjs-core: gradient plugin found no '${axis}'-axis scale for datasets[${datasetIndex}] of chart id ${chart.id}, skipping.`);
       continue;
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/gradientPlugin.ts:404:9
     entries.push(entry);
     const gradientObj = createGradient(ctx, axis, scaleToGradientArea(scale));
     entry.stopColors = buildStopColors(scale, colors);
-    if (entry.stopColors.length > 0) {
+    if (false) {
       applyColorStops(gradientObj, entry.stopColors);
       setDatasetColor(meta, dataset, key, gradientObj);
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] EqualityOperator
src/gradientPlugin.ts:404:9
     entries.push(entry);
     const gradientObj = createGradient(ctx, axis, scaleToGradientArea(scale));
     entry.stopColors = buildStopColors(scale, colors);
-    if (entry.stopColors.length > 0) {
+    if (entry.stopColors.length <= 0) {
       applyColorStops(gradientObj, entry.stopColors);
       setDatasetColor(meta, dataset, key, gradientObj);
killedBy: gradientPlugin beforeDatasetsUpdate creates a linear gradient (not radial) for an x/y axis and writes it onto the dataset
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] BlockStatement
src/gradientPlugin.ts:424:34
 export const gradientPlugin: Plugin<ChartType> = {
   id: 'gradient',
 
-  beforeInit(chart: Chart): void {
-    chartStates.set(chart, { options: new Map() });
-  },
+  beforeInit(chart: Chart): void {},
 
   beforeDatasetsUpdate(chart: Chart): void {
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/gradientPlugin.ts:428:44
     chartStates.set(chart, { options: new Map() });
   },
 
-  beforeDatasetsUpdate(chart: Chart): void {
-    if (!areaIsValid(chart.chartArea)) return;
-    const state = chartStates.get(chart);
-    if (!state) return;
-
-    const datasets = chart.data.datasets as ChartConfigDataset[];
-    datasets.forEach((dataset, i) => {
-      const gradient = dataset.gradient as GradientDatasetConfig | undefined;
-      if (gradient) {
-        updateDatasetGradients(chart, state, gradient, dataset, i);
-      }
-    });
-  },
+  beforeDatasetsUpdate(chart: Chart): void {},
 
   afterUpdate(chart: Chart): void {
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/gradientPlugin.ts:429:9
   },
 
   beforeDatasetsUpdate(chart: Chart): void {
-    if (!areaIsValid(chart.chartArea)) return;
+    if (true) return;
     const state = chartStates.get(chart);
     if (!state) return;
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/gradientPlugin.ts:429:9
   },
 
   beforeDatasetsUpdate(chart: Chart): void {
-    if (!areaIsValid(chart.chartArea)) return;
+    if (areaIsValid(chart.chartArea)) return;
     const state = chartStates.get(chart);
     if (!state) return;
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/gradientPlugin.ts:431:9
   beforeDatasetsUpdate(chart: Chart): void {
     if (!areaIsValid(chart.chartArea)) return;
     const state = chartStates.get(chart);
-    if (!state) return;
+    if (state) return;
 
     const datasets = chart.data.datasets as ChartConfigDataset[];
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/gradientPlugin.ts:431:9
   beforeDatasetsUpdate(chart: Chart): void {
     if (!areaIsValid(chart.chartArea)) return;
     const state = chartStates.get(chart);
-    if (!state) return;
+    if (true) return;
 
     const datasets = chart.data.datasets as ChartConfigDataset[];
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/gradientPlugin.ts:434:38
     if (!state) return;
 
     const datasets = chart.data.datasets as ChartConfigDataset[];
-    datasets.forEach((dataset, i) => {
-      const gradient = dataset.gradient as GradientDatasetConfig | undefined;
-      if (gradient) {
-        updateDatasetGradients(chart, state, gradient, dataset, i);
-      }
-    });
+    datasets.forEach((dataset, i) => {});
   },
 
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/gradientPlugin.ts:436:11
     const datasets = chart.data.datasets as ChartConfigDataset[];
     datasets.forEach((dataset, i) => {
       const gradient = dataset.gradient as GradientDatasetConfig | undefined;
-      if (gradient) {
+      if (false) {
         updateDatasetGradients(chart, state, gradient, dataset, i);
       }
killedBy: gradientPlugin beforeDatasetsUpdate warns and skips when the configured axis has no matching scale
statusReason: expected "warn" to be called with arguments: [ Array(1) ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/gradientPlugin.ts:436:11
     const datasets = chart.data.datasets as ChartConfigDataset[];
     datasets.forEach((dataset, i) => {
       const gradient = dataset.gradient as GradientDatasetConfig | undefined;
-      if (gradient) {
+      if (true) {
         updateDatasetGradients(chart, state, gradient, dataset, i);
       }
killedBy: gradientPlugin beforeDatasetsUpdate skips a dataset with no gradient config at all
statusReason: Cannot convert undefined or null to object

[Killed] BlockStatement
src/gradientPlugin.ts:442:35
     });
   },
 
-  afterUpdate(chart: Chart): void {
-    const state = chartStates.get(chart);
-    // Cast: chart.legend's own real, live implementation carries
-    // legendItems/legendHitBoxes at runtime (see LiveLegend's own doc
-    // comment above for why these aren't part of the public type).
-    const legend = chart.legend as unknown as LiveLegend | undefined;
-    if (state && legend && legend.options.display !== false) {
-      updateLegendItems(chart, legend, state);
-    }
-  },
+  afterUpdate(chart: Chart): void {},
 
   afterDestroy(chart: Chart): void {
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] ConditionalExpression
src/gradientPlugin.ts:448:9
     // legendItems/legendHitBoxes at runtime (see LiveLegend's own doc
     // comment above for why these aren't part of the public type).
     const legend = chart.legend as unknown as LiveLegend | undefined;
-    if (state && legend && legend.options.display !== false) {
+    if (false) {
       updateLegendItems(chart, legend, state);
     }
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Killed] BlockStatement
src/gradientPlugin.ts:448:62
     // legendItems/legendHitBoxes at runtime (see LiveLegend's own doc
     // comment above for why these aren't part of the public type).
     const legend = chart.legend as unknown as LiveLegend | undefined;
-    if (state && legend && legend.options.display !== false) {
-      updateLegendItems(chart, legend, state);
-    }
+    if (state && legend && legend.options.display !== false) {}
   },
 
killedBy: gradientPlugin afterUpdate applies the dataset-level gradient to its own legend swatch (one swatch per dataset)
statusReason: expected undefined to be { addColorStop: [Function spy] } // Object.is equality

[Survived] BlockStatement
src/gradientPlugin.ts:453:36
     }
   },
 
-  afterDestroy(chart: Chart): void {
-    chartStates.delete(chart);
-  },
+  afterDestroy(chart: Chart): void {},
 };
 
