[Killed] BlockStatement
src/gradientPlugin.ts:372:28
   if (!entries) {
     entries = [];
     state.options.set(key, entries);
-  } else if (!meta.hidden) {
-    entries = entries.filter((el) => el.datasetIndex !== datasetIndex);
-    state.options.set(key, entries);
-  }
+  } else if (!meta.hidden) {}
   return entries;
 }
killedBy: gradientPlugin beforeDatasetsUpdate discards the stale entry on refresh, not just appends alongside it (getStateEntries' own filter, observed via its actual content)
statusReason: expected 'rgb(255, 0, 0)' to be 'rgb(0, 128, 0)' // Object.is equality

[Killed] EqualityOperator
src/gradientPlugin.ts:373:38
     entries = [];
     state.options.set(key, entries);
   } else if (!meta.hidden) {
-    entries = entries.filter((el) => el.datasetIndex !== datasetIndex);
+    entries = entries.filter((el) => el.datasetIndex === datasetIndex);
     state.options.set(key, entries);
   }
killedBy: gradientPlugin beforeDatasetsUpdate discards the stale entry on refresh, not just appends alongside it (getStateEntries' own filter, observed via its actual content)
statusReason: expected 'rgb(255, 0, 0)' to be 'rgb(0, 128, 0)' // Object.is equality
