[Killed] ConditionalExpression
src/zoomPlugin.ts:413:7
 }
 function zoomCategoryScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
   const delta = linearZoomDelta(scale, zoomAmount, center);
-  if (scale.min === scale.max && zoomAmount < 1) existCategoryFromMaxZoom(scale);
+  if (false) existCategoryFromMaxZoom(scale);
   return updateRange(scale, { min: scale.min + integerChange(delta.min), max: scale.max - integerChange(delta.max) }, limits, true);
 }
killedBy: zoomPlugin category scale zoom/pan extends the category range by one label when fully zoomed in and zooming out further
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BooleanLiteral
src/zoomPlugin.ts:414:127
 function zoomCategoryScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
   const delta = linearZoomDelta(scale, zoomAmount, center);
   if (scale.min === scale.max && zoomAmount < 1) existCategoryFromMaxZoom(scale);
-  return updateRange(scale, { min: scale.min + integerChange(delta.min), max: scale.max - integerChange(delta.max) }, limits, true);
+  return updateRange(scale, { min: scale.min + integerChange(delta.min), max: scale.max - integerChange(delta.max) }, limits, false);
 }
 function scaleLength(scale: LiveScale): number {
killedBy: zoomPlugin category scale zoom/pan zooms a category scale using integer index stepping, not fractional values
statusReason: expected false to be true // Object.is equality

[Killed] ArithmeticOperator
src/zoomPlugin.ts:414:36
 function zoomCategoryScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
   const delta = linearZoomDelta(scale, zoomAmount, center);
   if (scale.min === scale.max && zoomAmount < 1) existCategoryFromMaxZoom(scale);
-  return updateRange(scale, { min: scale.min + integerChange(delta.min), max: scale.max - integerChange(delta.max) }, limits, true);
+  return updateRange(scale, { min: scale.min - integerChange(delta.min), max: scale.max - integerChange(delta.max) }, limits, true);
 }
 function scaleLength(scale: LiveScale): number {
killedBy: zoomPlugin category scale zoom/pan zooms a category scale out (integerChange's own negative branch, not just the positive one)
statusReason: expected 3 to be greater than 5

[Survived] BlockStatement
src/zoomPlugin.ts:416:48
   if (scale.min === scale.max && zoomAmount < 1) existCategoryFromMaxZoom(scale);
   return updateRange(scale, { min: scale.min + integerChange(delta.min), max: scale.max - integerChange(delta.max) }, limits, true);
 }
-function scaleLength(scale: LiveScale): number {
-  return scale.isHorizontal() ? scale.width : scale.height;
-}
+function scaleLength(scale: LiveScale): number {}
 function panCategoryScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined): boolean {
   const lastLabelIndex = scale.getLabels().length - 1;

[Killed] BlockStatement
src/zoomPlugin.ts:419:118
 function scaleLength(scale: LiveScale): number {
   return scale.isHorizontal() ? scale.width : scale.height;
 }
-function panCategoryScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined): boolean {
-  const lastLabelIndex = scale.getLabels().length - 1;
-  let { min, max } = scale;
-  const range = Math.max(max - min, 1);
-  const stepDelta = Math.round(scaleLength(scale) / Math.max(range, 10));
-  const stepSize = Math.round(Math.abs(delta / stepDelta));
-  let applied: boolean | undefined;
-  if (delta < -stepDelta) {
-    max = Math.min(max + stepSize, lastLabelIndex);
-    min = range === 1 ? max : max - range;
-    applied = max === lastLabelIndex;
-  } else if (delta > stepDelta) {
-    min = Math.max(0, min - stepSize);
-    max = range === 1 ? min : min + range;
-    applied = min === 0;
-  }
-  return updateRange(scale, { min, max }, limits) || !!applied;
-}
+function panCategoryScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined): boolean {}
 const OFFSETS: Record<string, number> = {
   second: 500,
killedBy: zoomPlugin category scale zoom/pan pans a y-axis category scale (scaleLength's own height branch, not just width)
statusReason: expected undefined to be defined

[Survived] ArithmeticOperator
src/zoomPlugin.ts:420:26
   return scale.isHorizontal() ? scale.width : scale.height;
 }
 function panCategoryScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined): boolean {
-  const lastLabelIndex = scale.getLabels().length - 1;
+  const lastLabelIndex = scale.getLabels().length + 1;
   let { min, max } = scale;
   const range = Math.max(max - min, 1);

[Survived] MethodExpression
src/zoomPlugin.ts:422:17
 function panCategoryScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined): boolean {
   const lastLabelIndex = scale.getLabels().length - 1;
   let { min, max } = scale;
-  const range = Math.max(max - min, 1);
+  const range = Math.min(max - min, 1);
   const stepDelta = Math.round(scaleLength(scale) / Math.max(range, 10));
   const stepSize = Math.round(Math.abs(delta / stepDelta));

[Survived] ArithmeticOperator
src/zoomPlugin.ts:422:26
 function panCategoryScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined): boolean {
   const lastLabelIndex = scale.getLabels().length - 1;
   let { min, max } = scale;
-  const range = Math.max(max - min, 1);
+  const range = Math.max(max + min, 1);
   const stepDelta = Math.round(scaleLength(scale) / Math.max(range, 10));
   const stepSize = Math.round(Math.abs(delta / stepDelta));

[Survived] MethodExpression
src/zoomPlugin.ts:423:53
   const lastLabelIndex = scale.getLabels().length - 1;
   let { min, max } = scale;
   const range = Math.max(max - min, 1);
-  const stepDelta = Math.round(scaleLength(scale) / Math.max(range, 10));
+  const stepDelta = Math.round(scaleLength(scale) / Math.min(range, 10));
   const stepSize = Math.round(Math.abs(delta / stepDelta));
   let applied: boolean | undefined;

[Survived] ArithmeticOperator
src/zoomPlugin.ts:423:32
   const lastLabelIndex = scale.getLabels().length - 1;
   let { min, max } = scale;
   const range = Math.max(max - min, 1);
-  const stepDelta = Math.round(scaleLength(scale) / Math.max(range, 10));
+  const stepDelta = Math.round(scaleLength(scale) * Math.max(range, 10));
   const stepSize = Math.round(Math.abs(delta / stepDelta));
   let applied: boolean | undefined;

[Survived] ArithmeticOperator
src/zoomPlugin.ts:424:40
   let { min, max } = scale;
   const range = Math.max(max - min, 1);
   const stepDelta = Math.round(scaleLength(scale) / Math.max(range, 10));
-  const stepSize = Math.round(Math.abs(delta / stepDelta));
+  const stepSize = Math.round(Math.abs(delta * stepDelta));
   let applied: boolean | undefined;
   if (delta < -stepDelta) {

[Killed] EqualityOperator
src/zoomPlugin.ts:426:7
   const stepDelta = Math.round(scaleLength(scale) / Math.max(range, 10));
   const stepSize = Math.round(Math.abs(delta / stepDelta));
   let applied: boolean | undefined;
-  if (delta < -stepDelta) {
+  if (delta >= -stepDelta) {
     max = Math.min(max + stepSize, lastLabelIndex);
     min = range === 1 ? max : max - range;
killedBy: zoomPlugin category scale zoom/pan pans a category scale backward (toward lower indices) using its own integer step logic
statusReason: expected 13 to be less than or equal to 8

[Killed] ConditionalExpression
src/zoomPlugin.ts:426:7
   const stepDelta = Math.round(scaleLength(scale) / Math.max(range, 10));
   const stepSize = Math.round(Math.abs(delta / stepDelta));
   let applied: boolean | undefined;
-  if (delta < -stepDelta) {
+  if (true) {
     max = Math.min(max + stepSize, lastLabelIndex);
     min = range === 1 ? max : max - range;
killedBy: zoomPlugin category scale zoom/pan pans a category scale backward (toward lower indices) using its own integer step logic
statusReason: expected 13 to be less than or equal to 8

[Killed] ArithmeticOperator
src/zoomPlugin.ts:427:20
   const stepSize = Math.round(Math.abs(delta / stepDelta));
   let applied: boolean | undefined;
   if (delta < -stepDelta) {
-    max = Math.min(max + stepSize, lastLabelIndex);
+    max = Math.min(max - stepSize, lastLabelIndex);
     min = range === 1 ? max : max - range;
     applied = max === lastLabelIndex;
killedBy: zoomPlugin category scale zoom/pan pans a category scale whose range is exactly 1 (panCategoryScale's own range===1 branches)
statusReason: expected 0.5 to be greater than or equal to 5

[Survived] MethodExpression
src/zoomPlugin.ts:427:11
   const stepSize = Math.round(Math.abs(delta / stepDelta));
   let applied: boolean | undefined;
   if (delta < -stepDelta) {
-    max = Math.min(max + stepSize, lastLabelIndex);
+    max = Math.max(max + stepSize, lastLabelIndex);
     min = range === 1 ? max : max - range;
     applied = max === lastLabelIndex;

[Survived] ConditionalExpression
src/zoomPlugin.ts:428:11
   let applied: boolean | undefined;
   if (delta < -stepDelta) {
     max = Math.min(max + stepSize, lastLabelIndex);
-    min = range === 1 ? max : max - range;
+    min = false ? max : max - range;
     applied = max === lastLabelIndex;
   } else if (delta > stepDelta) {

[Survived] ArithmeticOperator
src/zoomPlugin.ts:428:31
   let applied: boolean | undefined;
   if (delta < -stepDelta) {
     max = Math.min(max + stepSize, lastLabelIndex);
-    min = range === 1 ? max : max - range;
+    min = range === 1 ? max : max + range;
     applied = max === lastLabelIndex;
   } else if (delta > stepDelta) {

[Survived] ConditionalExpression
src/zoomPlugin.ts:429:15
   if (delta < -stepDelta) {
     max = Math.min(max + stepSize, lastLabelIndex);
     min = range === 1 ? max : max - range;
-    applied = max === lastLabelIndex;
+    applied = true;
   } else if (delta > stepDelta) {
     min = Math.max(0, min - stepSize);

[Survived] ConditionalExpression
src/zoomPlugin.ts:429:15
   if (delta < -stepDelta) {
     max = Math.min(max + stepSize, lastLabelIndex);
     min = range === 1 ? max : max - range;
-    applied = max === lastLabelIndex;
+    applied = false;
   } else if (delta > stepDelta) {
     min = Math.max(0, min - stepSize);

[Killed] ConditionalExpression
src/zoomPlugin.ts:430:14
     max = Math.min(max + stepSize, lastLabelIndex);
     min = range === 1 ? max : max - range;
     applied = max === lastLabelIndex;
-  } else if (delta > stepDelta) {
+  } else if (true) {
     min = Math.max(0, min - stepSize);
     max = range === 1 ? min : min + range;
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) panCategoryScale: a delta exactly equal to stepDelta takes neither the forward nor backward
statusReason: expected 1 to be 2 // Object.is equality

[Killed] EqualityOperator
src/zoomPlugin.ts:430:14
     max = Math.min(max + stepSize, lastLabelIndex);
     min = range === 1 ? max : max - range;
     applied = max === lastLabelIndex;
-  } else if (delta > stepDelta) {
+  } else if (delta >= stepDelta) {
     min = Math.max(0, min - stepSize);
     max = range === 1 ? min : min + range;
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) panCategoryScale: a delta exactly equal to stepDelta takes neither the forward nor backward
statusReason: expected 1 to be 2 // Object.is equality

[Killed] ArithmeticOperator
src/zoomPlugin.ts:431:23
     min = range === 1 ? max : max - range;
     applied = max === lastLabelIndex;
   } else if (delta > stepDelta) {
-    min = Math.max(0, min - stepSize);
+    min = Math.max(0, min + stepSize);
     max = range === 1 ? min : min + range;
     applied = min === 0;
killedBy: zoomPlugin category scale zoom/pan pans a category scale backward (toward lower indices) using its own integer step logic
statusReason: expected 13 to be less than or equal to 8

[Survived] MethodExpression
src/zoomPlugin.ts:431:11
     min = range === 1 ? max : max - range;
     applied = max === lastLabelIndex;
   } else if (delta > stepDelta) {
-    min = Math.max(0, min - stepSize);
+    min = Math.min(0, min - stepSize);
     max = range === 1 ? min : min + range;
     applied = min === 0;

[Survived] EqualityOperator
src/zoomPlugin.ts:432:11
     applied = max === lastLabelIndex;
   } else if (delta > stepDelta) {
     min = Math.max(0, min - stepSize);
-    max = range === 1 ? min : min + range;
+    max = range !== 1 ? min : min + range;
     applied = min === 0;
   }

[Survived] ConditionalExpression
src/zoomPlugin.ts:432:11
     applied = max === lastLabelIndex;
   } else if (delta > stepDelta) {
     min = Math.max(0, min - stepSize);
-    max = range === 1 ? min : min + range;
+    max = false ? min : min + range;
     applied = min === 0;
   }

[Survived] EqualityOperator
src/zoomPlugin.ts:433:15
   } else if (delta > stepDelta) {
     min = Math.max(0, min - stepSize);
     max = range === 1 ? min : min + range;
-    applied = min === 0;
+    applied = min !== 0;
   }
   return updateRange(scale, { min, max }, limits) || !!applied;

[Survived] ConditionalExpression
src/zoomPlugin.ts:433:15
   } else if (delta > stepDelta) {
     min = Math.max(0, min - stepSize);
     max = range === 1 ? min : min + range;
-    applied = min === 0;
+    applied = false;
   }
   return updateRange(scale, { min, max }, limits) || !!applied;

[Killed] ConditionalExpression
src/zoomPlugin.ts:435:10
     max = range === 1 ? min : min + range;
     applied = min === 0;
   }
-  return updateRange(scale, { min, max }, limits) || !!applied;
+  return true;
 }
 const OFFSETS: Record<string, number> = {
killedBy: zoomPlugin category scale zoom/pan pans a y-axis category scale (scaleLength's own height branch, not just width)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:435:10
     max = range === 1 ? min : min + range;
     applied = min === 0;
   }
-  return updateRange(scale, { min, max }, limits) || !!applied;
+  return false;
 }
 const OFFSETS: Record<string, number> = {
killedBy: zoomPlugin category scale zoom/pan pans a y-axis category scale (scaleLength's own height branch, not just width)
statusReason: expected undefined to be defined

[Survived] ArithmeticOperator
src/zoomPlugin.ts:439:11
 }
 const OFFSETS: Record<string, number> = {
   second: 500,
-  minute: 30 * 1000,
+  minute: 30 / 1000,
   hour: 30 * 60 * 1000,
   day: 12 * 60 * 60 * 1000,

[Survived] ArithmeticOperator
src/zoomPlugin.ts:440:9
 const OFFSETS: Record<string, number> = {
   second: 500,
   minute: 30 * 1000,
-  hour: 30 * 60 * 1000,
+  hour: 30 / 60 * 1000,
   day: 12 * 60 * 60 * 1000,
   week: 3.5 * 24 * 60 * 60 * 1000,

[Survived] ArithmeticOperator
src/zoomPlugin.ts:440:9
 const OFFSETS: Record<string, number> = {
   second: 500,
   minute: 30 * 1000,
-  hour: 30 * 60 * 1000,
+  hour: 30 * 60 / 1000,
   day: 12 * 60 * 60 * 1000,
   week: 3.5 * 24 * 60 * 60 * 1000,

[Survived] ArithmeticOperator
src/zoomPlugin.ts:441:8
   second: 500,
   minute: 30 * 1000,
   hour: 30 * 60 * 1000,
-  day: 12 * 60 * 60 * 1000,
+  day: 12 * 60 * 60 / 1000,
   week: 3.5 * 24 * 60 * 60 * 1000,
   month: 15 * 24 * 60 * 60 * 1000,

[Survived] ArithmeticOperator
src/zoomPlugin.ts:441:8
   second: 500,
   minute: 30 * 1000,
   hour: 30 * 60 * 1000,
-  day: 12 * 60 * 60 * 1000,
+  day: 12 / 60 * 60 * 1000,
   week: 3.5 * 24 * 60 * 60 * 1000,
   month: 15 * 24 * 60 * 60 * 1000,

[Survived] ArithmeticOperator
src/zoomPlugin.ts:442:9
   minute: 30 * 1000,
   hour: 30 * 60 * 1000,
   day: 12 * 60 * 60 * 1000,
-  week: 3.5 * 24 * 60 * 60 * 1000,
+  week: 3.5 * 24 / 60 * 60 * 1000,
   month: 15 * 24 * 60 * 60 * 1000,
   quarter: 60 * 24 * 60 * 60 * 1000,

[Survived] ArithmeticOperator
src/zoomPlugin.ts:442:9
   minute: 30 * 1000,
   hour: 30 * 60 * 1000,
   day: 12 * 60 * 60 * 1000,
-  week: 3.5 * 24 * 60 * 60 * 1000,
+  week: 3.5 * 24 * 60 / 60 * 1000,
   month: 15 * 24 * 60 * 60 * 1000,
   quarter: 60 * 24 * 60 * 60 * 1000,

[Survived] ArithmeticOperator
src/zoomPlugin.ts:443:10
   hour: 30 * 60 * 1000,
   day: 12 * 60 * 60 * 1000,
   week: 3.5 * 24 * 60 * 60 * 1000,
-  month: 15 * 24 * 60 * 60 * 1000,
+  month: 15 * 24 / 60 * 60 * 1000,
   quarter: 60 * 24 * 60 * 60 * 1000,
   year: 182 * 24 * 60 * 60 * 1000,

[Survived] ArithmeticOperator
src/zoomPlugin.ts:443:10
   hour: 30 * 60 * 1000,
   day: 12 * 60 * 60 * 1000,
   week: 3.5 * 24 * 60 * 60 * 1000,
-  month: 15 * 24 * 60 * 60 * 1000,
+  month: 15 * 24 * 60 * 60 / 1000,
   quarter: 60 * 24 * 60 * 60 * 1000,
   year: 182 * 24 * 60 * 60 * 1000,

[Survived] ArithmeticOperator
src/zoomPlugin.ts:444:12
   day: 12 * 60 * 60 * 1000,
   week: 3.5 * 24 * 60 * 60 * 1000,
   month: 15 * 24 * 60 * 60 * 1000,
-  quarter: 60 * 24 * 60 * 60 * 1000,
+  quarter: 60 * 24 / 60 * 60 * 1000,
   year: 182 * 24 * 60 * 60 * 1000,
 };

[Survived] ArithmeticOperator
src/zoomPlugin.ts:444:12
   day: 12 * 60 * 60 * 1000,
   week: 3.5 * 24 * 60 * 60 * 1000,
   month: 15 * 24 * 60 * 60 * 1000,
-  quarter: 60 * 24 * 60 * 60 * 1000,
+  quarter: 60 * 24 * 60 / 60 * 1000,
   year: 182 * 24 * 60 * 60 * 1000,
 };

[Survived] ArithmeticOperator
src/zoomPlugin.ts:445:9
   week: 3.5 * 24 * 60 * 60 * 1000,
   month: 15 * 24 * 60 * 60 * 1000,
   quarter: 60 * 24 * 60 * 60 * 1000,
-  year: 182 * 24 * 60 * 60 * 1000,
+  year: 182 * 24 * 60 / 60 * 1000,
 };
 function panNumericalScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, pan = false): boolean {

[Survived] ArithmeticOperator
src/zoomPlugin.ts:445:9
   week: 3.5 * 24 * 60 * 60 * 1000,
   month: 15 * 24 * 60 * 60 * 1000,
   quarter: 60 * 24 * 60 * 60 * 1000,
-  year: 182 * 24 * 60 * 60 * 1000,
+  year: 182 / 24 * 60 * 60 * 1000,
 };
 function panNumericalScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, pan = false): boolean {

[Killed] BooleanLiteral
src/zoomPlugin.ts:447:116
   quarter: 60 * 24 * 60 * 60 * 1000,
   year: 182 * 24 * 60 * 60 * 1000,
 };
-function panNumericalScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, pan = false): boolean {
+function panNumericalScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, pan = true): boolean {
   const prevStart = scale.min;
   const prevEnd = scale.max;
killedBy: zoomPlugin limits enforcement rejects a pan whose resulting range would violate a configured limit before ever computing a new range (updateRange's own early pan-limit check)
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
src/zoomPlugin.ts:447:132
   quarter: 60 * 24 * 60 * 60 * 1000,
   year: 182 * 24 * 60 * 60 * 1000,
 };
-function panNumericalScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, pan = false): boolean {
-  const prevStart = scale.min;
-  const prevEnd = scale.max;
-  const round = (scale.options as { time?: { round?: string } }).time?.round;
-  const offset = (round && OFFSETS[round]) || 0;
-  const newMin = scale.getValueForPixel(scale.getPixelForValue(prevStart + offset) - delta) ?? NaN;
-  const newMax = scale.getValueForPixel(scale.getPixelForValue(prevEnd + offset) - delta) ?? NaN;
-  if (isNaN(newMin) || isNaN(newMax)) return true;
-  return updateRange(scale, { min: newMin, max: newMax }, limits, pan ? 'pan' : false);
-}
+function panNumericalScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, pan = false): boolean {}
 function panNonLinearScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined): boolean {
   return panNumericalScale(scale, delta, limits, true);
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Killed] OptionalChaining
src/zoomPlugin.ts:450:17
 function panNumericalScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, pan = false): boolean {
   const prevStart = scale.min;
   const prevEnd = scale.max;
-  const round = (scale.options as { time?: { round?: string } }).time?.round;
+  const round = (scale.options as {
+  time?: {
+    round?: string;
+  };
+}).time.round;
   const offset = (round && OFFSETS[round]) || 0;
   const newMin = scale.getValueForPixel(scale.getPixelForValue(prevStart + offset) - delta) ?? NaN;
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'round')

[Killed] LogicalOperator
src/zoomPlugin.ts:451:18
   const prevStart = scale.min;
   const prevEnd = scale.max;
   const round = (scale.options as { time?: { round?: string } }).time?.round;
-  const offset = (round && OFFSETS[round]) || 0;
+  const offset = round && OFFSETS[round] && 0;
   const newMin = scale.getValueForPixel(scale.getPixelForValue(prevStart + offset) - delta) ?? NaN;
   const newMax = scale.getValueForPixel(scale.getPixelForValue(prevEnd + offset) - delta) ?? NaN;
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Killed] LogicalOperator
src/zoomPlugin.ts:451:19
   const prevStart = scale.min;
   const prevEnd = scale.max;
   const round = (scale.options as { time?: { round?: string } }).time?.round;
-  const offset = (round && OFFSETS[round]) || 0;
+  const offset = (round || OFFSETS[round]) || 0;
   const newMin = scale.getValueForPixel(scale.getPixelForValue(prevStart + offset) - delta) ?? NaN;
   const newMax = scale.getValueForPixel(scale.getPixelForValue(prevEnd + offset) - delta) ?? NaN;
killedBy: zoomPlugin programmatic pan() applies a real time.round offset when panning a scale configured with one
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/zoomPlugin.ts:452:18
   const prevEnd = scale.max;
   const round = (scale.options as { time?: { round?: string } }).time?.round;
   const offset = (round && OFFSETS[round]) || 0;
-  const newMin = scale.getValueForPixel(scale.getPixelForValue(prevStart + offset) - delta) ?? NaN;
+  const newMin = scale.getValueForPixel(scale.getPixelForValue(prevStart + offset) - delta) && NaN;
   const newMax = scale.getValueForPixel(scale.getPixelForValue(prevEnd + offset) - delta) ?? NaN;
   if (isNaN(newMin) || isNaN(newMax)) return true;
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Killed] ArithmeticOperator
src/zoomPlugin.ts:452:64
   const prevEnd = scale.max;
   const round = (scale.options as { time?: { round?: string } }).time?.round;
   const offset = (round && OFFSETS[round]) || 0;
-  const newMin = scale.getValueForPixel(scale.getPixelForValue(prevStart + offset) - delta) ?? NaN;
+  const newMin = scale.getValueForPixel(scale.getPixelForValue(prevStart - offset) - delta) ?? NaN;
   const newMax = scale.getValueForPixel(scale.getPixelForValue(prevEnd + offset) - delta) ?? NaN;
   if (isNaN(newMin) || isNaN(newMax)) return true;
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) OFFSETS: a real "week" time.round offset shifts the pan result by exactly 3.5 days in milli
statusReason: expected +0 to be close to 302400000, received difference is 302400000, but expected 0.5

[Killed] ArithmeticOperator
src/zoomPlugin.ts:453:64
   const round = (scale.options as { time?: { round?: string } }).time?.round;
   const offset = (round && OFFSETS[round]) || 0;
   const newMin = scale.getValueForPixel(scale.getPixelForValue(prevStart + offset) - delta) ?? NaN;
-  const newMax = scale.getValueForPixel(scale.getPixelForValue(prevEnd + offset) - delta) ?? NaN;
+  const newMax = scale.getValueForPixel(scale.getPixelForValue(prevEnd - offset) - delta) ?? NaN;
   if (isNaN(newMin) || isNaN(newMax)) return true;
   return updateRange(scale, { min: newMin, max: newMax }, limits, pan ? 'pan' : false);
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) OFFSETS: a real "week" time.round offset shifts the pan result by exactly 3.5 days in milli
statusReason: expected +0 to be close to 302400000, received difference is 302400000, but expected 0.5

[Killed] LogicalOperator
src/zoomPlugin.ts:453:18
   const round = (scale.options as { time?: { round?: string } }).time?.round;
   const offset = (round && OFFSETS[round]) || 0;
   const newMin = scale.getValueForPixel(scale.getPixelForValue(prevStart + offset) - delta) ?? NaN;
-  const newMax = scale.getValueForPixel(scale.getPixelForValue(prevEnd + offset) - delta) ?? NaN;
+  const newMax = scale.getValueForPixel(scale.getPixelForValue(prevEnd + offset) - delta) && NaN;
   if (isNaN(newMin) || isNaN(newMax)) return true;
   return updateRange(scale, { min: newMin, max: newMax }, limits, pan ? 'pan' : false);
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Killed] LogicalOperator
src/zoomPlugin.ts:454:7
   const offset = (round && OFFSETS[round]) || 0;
   const newMin = scale.getValueForPixel(scale.getPixelForValue(prevStart + offset) - delta) ?? NaN;
   const newMax = scale.getValueForPixel(scale.getPixelForValue(prevEnd + offset) - delta) ?? NaN;
-  if (isNaN(newMin) || isNaN(newMax)) return true;
+  if (isNaN(newMin) && isNaN(newMax)) return true;
   return updateRange(scale, { min: newMin, max: newMax }, limits, pan ? 'pan' : false);
 }
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) panNumericalScale: only newMin resolving to NaN (not newMax too) still triggers the early n
statusReason: expected NaN to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:454:7
   const offset = (round && OFFSETS[round]) || 0;
   const newMin = scale.getValueForPixel(scale.getPixelForValue(prevStart + offset) - delta) ?? NaN;
   const newMax = scale.getValueForPixel(scale.getPixelForValue(prevEnd + offset) - delta) ?? NaN;
-  if (isNaN(newMin) || isNaN(newMax)) return true;
+  if (false) return true;
   return updateRange(scale, { min: newMin, max: newMax }, limits, pan ? 'pan' : false);
 }
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) panNumericalScale: only newMin resolving to NaN (not newMax too) still triggers the early n
statusReason: expected NaN to be undefined

[Survived] BooleanLiteral
src/zoomPlugin.ts:455:81
   const newMin = scale.getValueForPixel(scale.getPixelForValue(prevStart + offset) - delta) ?? NaN;
   const newMax = scale.getValueForPixel(scale.getPixelForValue(prevEnd + offset) - delta) ?? NaN;
   if (isNaN(newMin) || isNaN(newMax)) return true;
-  return updateRange(scale, { min: newMin, max: newMax }, limits, pan ? 'pan' : false);
+  return updateRange(scale, { min: newMin, max: newMax }, limits, pan ? 'pan' : true);
 }
 function panNonLinearScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined): boolean {

[Killed] BlockStatement
src/zoomPlugin.ts:457:119
   if (isNaN(newMin) || isNaN(newMax)) return true;
   return updateRange(scale, { min: newMin, max: newMax }, limits, pan ? 'pan' : false);
 }
-function panNonLinearScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined): boolean {
-  return panNumericalScale(scale, delta, limits, true);
-}
+function panNonLinearScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined): boolean {}
 const zoomFunctions: Record<string, (scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined) => boolean> = {
   category: zoomCategoryScale,
killedBy: zoomPlugin category scale zoom/pan pans a non-linear scale type (e.g. timeseries) using panNonLinearScale, not the plain default
statusReason: expected undefined to be defined

[Survived] BooleanLiteral
src/zoomPlugin.ts:458:50
   return updateRange(scale, { min: newMin, max: newMax }, limits, pan ? 'pan' : false);
 }
 function panNonLinearScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined): boolean {
-  return panNumericalScale(scale, delta, limits, true);
+  return panNumericalScale(scale, delta, limits, false);
 }
 const zoomFunctions: Record<string, (scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined) => boolean> = {
