[Killed] BlockStatement
src/zoomPlugin.ts:481:12
   scale: LiveScale,
   originalScaleLimits: ZoomPluginState['originalScaleLimits'],
   updatedScaleLimits: ZoomPluginState['updatedScaleLimits'],
-): boolean {
-  const { id } = scale;
-  const opts = scale.options as { min?: number; max?: number };
-  if (!originalScaleLimits[id] || !updatedScaleLimits[id]) return true;
-  const previous = updatedScaleLimits[id];
-  return previous.min !== opts.min || previous.max !== opts.max;
-}
+): boolean {}
 function removeMissingScales(limits: Record<string, unknown>, scaleIds: Set<string>): void {
   for (const key of Object.keys(limits)) {
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'min')

[Killed] BooleanLiteral
src/zoomPlugin.ts:484:7
 ): boolean {
   const { id } = scale;
   const opts = scale.options as { min?: number; max?: number };
-  if (!originalScaleLimits[id] || !updatedScaleLimits[id]) return true;
+  if (originalScaleLimits[id] || !updatedScaleLimits[id]) return true;
   const previous = updatedScaleLimits[id];
   return previous.min !== opts.min || previous.max !== opts.max;
killedBy: zoomPlugin programmatic zoom() reports isZoomedOrPanned true from a max-only change too, not just a min change
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/zoomPlugin.ts:484:67
 ): boolean {
   const { id } = scale;
   const opts = scale.options as { min?: number; max?: number };
-  if (!originalScaleLimits[id] || !updatedScaleLimits[id]) return true;
+  if (!originalScaleLimits[id] || !updatedScaleLimits[id]) return false;
   const previous = updatedScaleLimits[id];
   return previous.min !== opts.min || previous.max !== opts.max;
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'min')

[Killed] EqualityOperator
src/zoomPlugin.ts:486:39
   const opts = scale.options as { min?: number; max?: number };
   if (!originalScaleLimits[id] || !updatedScaleLimits[id]) return true;
   const previous = updatedScaleLimits[id];
-  return previous.min !== opts.min || previous.max !== opts.max;
+  return previous.min !== opts.min || previous.max === opts.max;
 }
 function removeMissingScales(limits: Record<string, unknown>, scaleIds: Set<string>): void {
killedBy: zoomPlugin programmatic zoom() reports isZoomedOrPanned true from a max-only change too, not just a min change
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:486:10
   const opts = scale.options as { min?: number; max?: number };
   if (!originalScaleLimits[id] || !updatedScaleLimits[id]) return true;
   const previous = updatedScaleLimits[id];
-  return previous.min !== opts.min || previous.max !== opts.max;
+  return true;
 }
 function removeMissingScales(limits: Record<string, unknown>, scaleIds: Set<string>): void {
killedBy: zoomPlugin programmatic zoom() reports isZoomedOrPanned true from a max-only change too, not just a min change
statusReason: expected false to be true // Object.is equality

[Survived] BlockStatement
src/zoomPlugin.ts:488:92
   const previous = updatedScaleLimits[id];
   return previous.min !== opts.min || previous.max !== opts.max;
 }
-function removeMissingScales(limits: Record<string, unknown>, scaleIds: Set<string>): void {
-  for (const key of Object.keys(limits)) {
-    if (!scaleIds.has(key)) delete limits[key];
-  }
-}
+function removeMissingScales(limits: Record<string, unknown>, scaleIds: Set<string>): void {}
 function storeOriginalScaleLimits(chart: Chart, state: ZoomPluginState): ZoomPluginState['originalScaleLimits'] {
   const scales = liveScales(chart);

[Survived] BlockStatement
src/zoomPlugin.ts:489:42
   return previous.min !== opts.min || previous.max !== opts.max;
 }
 function removeMissingScales(limits: Record<string, unknown>, scaleIds: Set<string>): void {
-  for (const key of Object.keys(limits)) {
-    if (!scaleIds.has(key)) delete limits[key];
-  }
+  for (const key of Object.keys(limits)) {}
 }
 function storeOriginalScaleLimits(chart: Chart, state: ZoomPluginState): ZoomPluginState['originalScaleLimits'] {

[Killed] BooleanLiteral
src/zoomPlugin.ts:490:9
 }
 function removeMissingScales(limits: Record<string, unknown>, scaleIds: Set<string>): void {
   for (const key of Object.keys(limits)) {
-    if (!scaleIds.has(key)) delete limits[key];
+    if (scaleIds.has(key)) delete limits[key];
   }
 }
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'min')

[Killed] ConditionalExpression
src/zoomPlugin.ts:490:9
 }
 function removeMissingScales(limits: Record<string, unknown>, scaleIds: Set<string>): void {
   for (const key of Object.keys(limits)) {
-    if (!scaleIds.has(key)) delete limits[key];
+    if (true) delete limits[key];
   }
 }
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'min')

[Killed] BlockStatement
src/zoomPlugin.ts:493:113
     if (!scaleIds.has(key)) delete limits[key];
   }
 }
-function storeOriginalScaleLimits(chart: Chart, state: ZoomPluginState): ZoomPluginState['originalScaleLimits'] {
-  const scales = liveScales(chart);
-  const { originalScaleLimits, updatedScaleLimits } = state;
-  for (const scale of scales) {
-    if (shouldUpdateScaleLimits(scale, originalScaleLimits, updatedScaleLimits)) {
-      const opts = scale.options as { min?: number; max?: number };
-      originalScaleLimits[scale.id] = {
-        min: { scale: scale.min, options: opts.min },
-        max: { scale: scale.max, options: opts.max },
-      };
-    }
-  }
-  const scaleIds = new Set(scales.map((s) => s.id));
-  removeMissingScales(originalScaleLimits, scaleIds);
-  removeMissingScales(updatedScaleLimits, scaleIds);
-  return originalScaleLimits;
-}
+function storeOriginalScaleLimits(chart: Chart, state: ZoomPluginState): ZoomPluginState['originalScaleLimits'] {}
 function doZoom(scale: LiveScale, amount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): void {
   const fn = zoomFunctions[scale.type] ?? zoomFunctions.default;
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'min')

[Killed] BlockStatement
src/zoomPlugin.ts:496:31
 function storeOriginalScaleLimits(chart: Chart, state: ZoomPluginState): ZoomPluginState['originalScaleLimits'] {
   const scales = liveScales(chart);
   const { originalScaleLimits, updatedScaleLimits } = state;
-  for (const scale of scales) {
-    if (shouldUpdateScaleLimits(scale, originalScaleLimits, updatedScaleLimits)) {
-      const opts = scale.options as { min?: number; max?: number };
-      originalScaleLimits[scale.id] = {
-        min: { scale: scale.min, options: opts.min },
-        max: { scale: scale.max, options: opts.max },
-      };
-    }
-  }
+  for (const scale of scales) {}
   const scaleIds = new Set(scales.map((s) => s.id));
   removeMissingScales(originalScaleLimits, scaleIds);
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'min')

[Killed] ConditionalExpression
src/zoomPlugin.ts:497:9
   const scales = liveScales(chart);
   const { originalScaleLimits, updatedScaleLimits } = state;
   for (const scale of scales) {
-    if (shouldUpdateScaleLimits(scale, originalScaleLimits, updatedScaleLimits)) {
+    if (false) {
       const opts = scale.options as { min?: number; max?: number };
       originalScaleLimits[scale.id] = {
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'min')

[Killed] ConditionalExpression
src/zoomPlugin.ts:497:9
   const scales = liveScales(chart);
   const { originalScaleLimits, updatedScaleLimits } = state;
   for (const scale of scales) {
-    if (shouldUpdateScaleLimits(scale, originalScaleLimits, updatedScaleLimits)) {
+    if (true) {
       const opts = scale.options as { min?: number; max?: number };
       originalScaleLimits[scale.id] = {
killedBy: zoomPlugin programmatic zoom() reports isZoomedOrPanned true from a max-only change too, not just a min change
statusReason: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/zoomPlugin.ts:505:39
       };
     }
   }
-  const scaleIds = new Set(scales.map((s) => s.id));
+  const scaleIds = new Set(scales.map(() => undefined));
   removeMissingScales(originalScaleLimits, scaleIds);
   removeMissingScales(updatedScaleLimits, scaleIds);
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'min')

[Killed] BlockStatement
src/zoomPlugin.ts:510:127
   removeMissingScales(updatedScaleLimits, scaleIds);
   return originalScaleLimits;
 }
-function doZoom(scale: LiveScale, amount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): void {
-  const fn = zoomFunctions[scale.type] ?? zoomFunctions.default;
-  fn(scale, amount, center, limits);
-}
+function doZoom(scale: LiveScale, amount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): void {}
 function doZoomRect(scale: LiveScale, from: number, to: number, limits: Record<string, ScaleLimits> | undefined): void {
   const fn = zoomRectFunctions[scale.type] ?? zoomRectFunctions.default;
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/zoomPlugin.ts:511:14
   return originalScaleLimits;
 }
 function doZoom(scale: LiveScale, amount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): void {
-  const fn = zoomFunctions[scale.type] ?? zoomFunctions.default;
+  const fn = zoomFunctions[scale.type] && zoomFunctions.default;
   fn(scale, amount, center, limits);
 }
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: fn is not a function

[Killed] BlockStatement
src/zoomPlugin.ts:514:120
   const fn = zoomFunctions[scale.type] ?? zoomFunctions.default;
   fn(scale, amount, center, limits);
 }
-function doZoomRect(scale: LiveScale, from: number, to: number, limits: Record<string, ScaleLimits> | undefined): void {
-  const fn = zoomRectFunctions[scale.type] ?? zoomRectFunctions.default;
-  fn(scale, from, to, limits);
-}
+function doZoomRect(scale: LiveScale, from: number, to: number, limits: Record<string, ScaleLimits> | undefined): void {}
 function getCenter(chart: Chart): ScreenPoint {
   const ca = chart.chartArea;
killedBy: zoomPlugin programmatic zoom() resolves mode as a function of the chart, not just a string literal
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/zoomPlugin.ts:515:14
   fn(scale, amount, center, limits);
 }
 function doZoomRect(scale: LiveScale, from: number, to: number, limits: Record<string, ScaleLimits> | undefined): void {
-  const fn = zoomRectFunctions[scale.type] ?? zoomRectFunctions.default;
+  const fn = zoomRectFunctions[scale.type] && zoomRectFunctions.default;
   fn(scale, from, to, limits);
 }
killedBy: zoomPlugin programmatic zoom() resolves mode as a function of the chart, not just a string literal
statusReason: fn is not a function

[Killed] BlockStatement
src/zoomPlugin.ts:518:47
   const fn = zoomRectFunctions[scale.type] ?? zoomRectFunctions.default;
   fn(scale, from, to, limits);
 }
-function getCenter(chart: Chart): ScreenPoint {
-  const ca = chart.chartArea;
-  return { x: (ca.left + ca.right) / 2, y: (ca.top + ca.bottom) / 2 };
-}
+function getCenter(chart: Chart): ScreenPoint {}
 /** Chart.js's own `update(mode)` expects a specific string-literal union
  * of built-in transition-mode names, but its own transitions config is
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'y')

[Killed] ArithmeticOperator
src/zoomPlugin.ts:520:15
 }
 function getCenter(chart: Chart): ScreenPoint {
   const ca = chart.chartArea;
-  return { x: (ca.left + ca.right) / 2, y: (ca.top + ca.bottom) / 2 };
+  return { x: (ca.left + ca.right) * 2, y: (ca.top + ca.bottom) / 2 };
 }
 /** Chart.js's own `update(mode)` expects a specific string-literal union
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys getCenter: computes the exact midpoint of an asymmetric chart area, not some other formul
statusReason: expected 50 to be close to 25, received difference is 25, but expected 0.000005

[Killed] ArithmeticOperator
src/zoomPlugin.ts:520:16
 }
 function getCenter(chart: Chart): ScreenPoint {
   const ca = chart.chartArea;
-  return { x: (ca.left + ca.right) / 2, y: (ca.top + ca.bottom) / 2 };
+  return { x: (ca.left - ca.right) / 2, y: (ca.top + ca.bottom) / 2 };
 }
 /** Chart.js's own `update(mode)` expects a specific string-literal union
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys getCenter: computes the exact midpoint of an asymmetric chart area, not some other formul
statusReason: expected +0 to be close to 25, received difference is 25, but expected 0.000005

[Killed] BlockStatement
src/zoomPlugin.ts:532:62
  * a transition mode, not just the standard built-ins) — cast here
  * rather than narrowing this file's own `transition` parameters to the
  * built-in-only union, which would reject that real usage. */
-function updateChart(chart: Chart, transition: string): void {
-  chart.update(transition as UpdateMode);
-}
+function updateChart(chart: Chart, transition: string): void {}
 
 // ---- public zoom/pan API (both driven by DOM events below, and callable directly) ----
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: expected "spy" to be called at least once

[Survived] StringLiteral
src/zoomPlugin.ts:540:69
 
 export type ZoomAmount = number | { x?: number; y?: number; focalPoint?: ScreenPoint };
 
-export function zoom(chart: Chart, amount: ZoomAmount, transition = 'none', trigger = 'api'): void {
+export function zoom(chart: Chart, amount: ZoomAmount, transition = "", trigger = 'api'): void {
   const { x = 1, y = 1, focalPoint = getCenter(chart) } = typeof amount === 'number' ? { x: amount, y: amount } : amount;
   const state = getState(chart);

[Killed] EqualityOperator
src/zoomPlugin.ts:541:59
 export type ZoomAmount = number | { x?: number; y?: number; focalPoint?: ScreenPoint };
 
 export function zoom(chart: Chart, amount: ZoomAmount, transition = 'none', trigger = 'api'): void {
-  const { x = 1, y = 1, focalPoint = getCenter(chart) } = typeof amount === 'number' ? { x: amount, y: amount } : amount;
+  const { x = 1, y = 1, focalPoint = getCenter(chart) } = typeof amount !== 'number' ? { x: amount, y: amount } : amount;
   const state = getState(chart);
   const { limits, zoom: zoomOptions } = state.options;
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:541:59
 export type ZoomAmount = number | { x?: number; y?: number; focalPoint?: ScreenPoint };
 
 export function zoom(chart: Chart, amount: ZoomAmount, transition = 'none', trigger = 'api'): void {
-  const { x = 1, y = 1, focalPoint = getCenter(chart) } = typeof amount === 'number' ? { x: amount, y: amount } : amount;
+  const { x = 1, y = 1, focalPoint = getCenter(chart) } = false ? { x: amount, y: amount } : amount;
   const state = getState(chart);
   const { limits, zoom: zoomOptions } = state.options;
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:545:20
   const state = getState(chart);
   const { limits, zoom: zoomOptions } = state.options;
   storeOriginalScaleLimits(chart, state);
-  const xEnabled = x !== 1;
+  const xEnabled = false;
   const yEnabled = y !== 1;
   const enabledScales = getEnabledScalesByPoint(zoomOptions, focalPoint, chart);
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/zoomPlugin.ts:545:20
   const state = getState(chart);
   const { limits, zoom: zoomOptions } = state.options;
   storeOriginalScaleLimits(chart, state);
-  const xEnabled = x !== 1;
+  const xEnabled = x === 1;
   const yEnabled = y !== 1;
   const enabledScales = getEnabledScalesByPoint(zoomOptions, focalPoint, chart);
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:546:20
   const { limits, zoom: zoomOptions } = state.options;
   storeOriginalScaleLimits(chart, state);
   const xEnabled = x !== 1;
-  const yEnabled = y !== 1;
+  const yEnabled = false;
   const enabledScales = getEnabledScalesByPoint(zoomOptions, focalPoint, chart);
   // getEnabledScalesByPoint always returns a real array (possibly
killedBy: zoomPlugin programmatic zoom() zooms a y-axis scale directly via the programmatic API (not just through a drag)
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/zoomPlugin.ts:546:20
   const { limits, zoom: zoomOptions } = state.options;
   storeOriginalScaleLimits(chart, state);
   const xEnabled = x !== 1;
-  const yEnabled = y !== 1;
+  const yEnabled = y === 1;
   const enabledScales = getEnabledScalesByPoint(zoomOptions, focalPoint, chart);
   // getEnabledScalesByPoint always returns a real array (possibly
killedBy: zoomPlugin programmatic zoom() zooms a y-axis scale directly via the programmatic API (not just through a drag)
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/zoomPlugin.ts:560:38
   // disabled by mode"), not a hypothetical: that version zoomed every
   // scale whenever none matched the enabled directions, instead of
   // zooming none.
-  for (const scale of enabledScales) {
-    if (scale.isHorizontal() && xEnabled) doZoom(scale, x, focalPoint, limits);
-    else if (!scale.isHorizontal() && yEnabled) doZoom(scale, y, focalPoint, limits);
-  }
+  for (const scale of enabledScales) {}
   updateChart(chart, transition);
   invoke(zoomOptions?.onZoom, [{ chart, trigger }]);
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:561:9
   // scale whenever none matched the enabled directions, instead of
   // zooming none.
   for (const scale of enabledScales) {
-    if (scale.isHorizontal() && xEnabled) doZoom(scale, x, focalPoint, limits);
+    if (false) doZoom(scale, x, focalPoint, limits);
     else if (!scale.isHorizontal() && yEnabled) doZoom(scale, y, focalPoint, limits);
   }
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: expected undefined to be defined

[Survived] LogicalOperator
src/zoomPlugin.ts:561:9
   // scale whenever none matched the enabled directions, instead of
   // zooming none.
   for (const scale of enabledScales) {
-    if (scale.isHorizontal() && xEnabled) doZoom(scale, x, focalPoint, limits);
+    if (scale.isHorizontal() || xEnabled) doZoom(scale, x, focalPoint, limits);
     else if (!scale.isHorizontal() && yEnabled) doZoom(scale, y, focalPoint, limits);
   }

[Killed] BooleanLiteral
src/zoomPlugin.ts:562:14
   // zooming none.
   for (const scale of enabledScales) {
     if (scale.isHorizontal() && xEnabled) doZoom(scale, x, focalPoint, limits);
-    else if (!scale.isHorizontal() && yEnabled) doZoom(scale, y, focalPoint, limits);
+    else if (scale.isHorizontal() && yEnabled) doZoom(scale, y, focalPoint, limits);
   }
   updateChart(chart, transition);
killedBy: zoomPlugin programmatic zoom() zooms a y-axis scale directly via the programmatic API (not just through a drag)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:562:14
   // zooming none.
   for (const scale of enabledScales) {
     if (scale.isHorizontal() && xEnabled) doZoom(scale, x, focalPoint, limits);
-    else if (!scale.isHorizontal() && yEnabled) doZoom(scale, y, focalPoint, limits);
+    else if (false) doZoom(scale, y, focalPoint, limits);
   }
   updateChart(chart, transition);
killedBy: zoomPlugin programmatic zoom() zooms a y-axis scale directly via the programmatic API (not just through a drag)
statusReason: expected undefined to be defined

[Killed] OptionalChaining
src/zoomPlugin.ts:565:10
     else if (!scale.isHorizontal() && yEnabled) doZoom(scale, y, focalPoint, limits);
   }
   updateChart(chart, transition);
-  invoke(zoomOptions?.onZoom, [{ chart, trigger }]);
+  invoke(zoomOptions.onZoom, [{ chart, trigger }]);
 }
 
killedBy: zoomPlugin programmatic zoom() falls back to zooming every scale when zoom is called with no zoom config at all (getEnabledScalesByPoint's own default)
statusReason: Cannot read properties of undefined (reading 'onZoom')

[Killed] BlockStatement
src/zoomPlugin.ts:568:118
   invoke(zoomOptions?.onZoom, [{ chart, trigger }]);
 }
 
-export function zoomRect(chart: Chart, p0: ScreenPoint, p1: ScreenPoint, transition = 'none', trigger = 'api'): void {
-  const state = getState(chart);
-  const { limits, zoom: zoomOptions } = state.options;
-  const mode = zoomOptions?.mode ?? 'xy';
-  storeOriginalScaleLimits(chart, state);
-  const xEnabled = directionEnabled(mode, 'x', chart);
-  const yEnabled = directionEnabled(mode, 'y', chart);
-  for (const scale of liveScales(chart)) {
-    if (scale.isHorizontal() && xEnabled) doZoomRect(scale, p0.x, p1.x, limits);
-    else if (!scale.isHorizontal() && yEnabled) doZoomRect(scale, p0.y, p1.y, limits);
-  }
-  updateChart(chart, transition);
-  invoke(zoomOptions?.onZoom, [{ chart, trigger }]);
-}
+export function zoomRect(chart: Chart, p0: ScreenPoint, p1: ScreenPoint, transition = 'none', trigger = 'api'): void {}
 
 export function zoomScale(chart: Chart, scaleId: string, range: { min: number; max: number }, transition = 'none', trigger = 'api'): void {
killedBy: zoomPlugin programmatic zoom() resolves mode as a function of the chart, not just a string literal
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/zoomPlugin.ts:571:16
 export function zoomRect(chart: Chart, p0: ScreenPoint, p1: ScreenPoint, transition = 'none', trigger = 'api'): void {
   const state = getState(chart);
   const { limits, zoom: zoomOptions } = state.options;
-  const mode = zoomOptions?.mode ?? 'xy';
+  const mode = zoomOptions?.mode && 'xy';
   storeOriginalScaleLimits(chart, state);
   const xEnabled = directionEnabled(mode, 'x', chart);
killedBy: zoomPlugin programmatic zoom() treats an unrecognized mode value as disabling every direction (the final false fallback)
statusReason: expected 100 to be undefined

[Survived] OptionalChaining
src/zoomPlugin.ts:571:16
 export function zoomRect(chart: Chart, p0: ScreenPoint, p1: ScreenPoint, transition = 'none', trigger = 'api'): void {
   const state = getState(chart);
   const { limits, zoom: zoomOptions } = state.options;
-  const mode = zoomOptions?.mode ?? 'xy';
+  const mode = zoomOptions.mode ?? 'xy';
   storeOriginalScaleLimits(chart, state);
   const xEnabled = directionEnabled(mode, 'x', chart);

[Survived] StringLiteral
src/zoomPlugin.ts:574:43
   const mode = zoomOptions?.mode ?? 'xy';
   storeOriginalScaleLimits(chart, state);
   const xEnabled = directionEnabled(mode, 'x', chart);
-  const yEnabled = directionEnabled(mode, 'y', chart);
+  const yEnabled = directionEnabled(mode, "", chart);
   for (const scale of liveScales(chart)) {
     if (scale.isHorizontal() && xEnabled) doZoomRect(scale, p0.x, p1.x, limits);

[Killed] BlockStatement
src/zoomPlugin.ts:575:42
   storeOriginalScaleLimits(chart, state);
   const xEnabled = directionEnabled(mode, 'x', chart);
   const yEnabled = directionEnabled(mode, 'y', chart);
-  for (const scale of liveScales(chart)) {
-    if (scale.isHorizontal() && xEnabled) doZoomRect(scale, p0.x, p1.x, limits);
-    else if (!scale.isHorizontal() && yEnabled) doZoomRect(scale, p0.y, p1.y, limits);
-  }
+  for (const scale of liveScales(chart)) {}
   updateChart(chart, transition);
   invoke(zoomOptions?.onZoom, [{ chart, trigger }]);
killedBy: zoomPlugin programmatic zoom() resolves mode as a function of the chart, not just a string literal
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:576:9
   const xEnabled = directionEnabled(mode, 'x', chart);
   const yEnabled = directionEnabled(mode, 'y', chart);
   for (const scale of liveScales(chart)) {
-    if (scale.isHorizontal() && xEnabled) doZoomRect(scale, p0.x, p1.x, limits);
+    if (true) doZoomRect(scale, p0.x, p1.x, limits);
     else if (!scale.isHorizontal() && yEnabled) doZoomRect(scale, p0.y, p1.y, limits);
   }
killedBy: zoomPlugin programmatic zoom() treats an unrecognized mode value as disabling every direction (the final false fallback)
statusReason: expected 100 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:576:9
   const xEnabled = directionEnabled(mode, 'x', chart);
   const yEnabled = directionEnabled(mode, 'y', chart);
   for (const scale of liveScales(chart)) {
-    if (scale.isHorizontal() && xEnabled) doZoomRect(scale, p0.x, p1.x, limits);
+    if (false) doZoomRect(scale, p0.x, p1.x, limits);
     else if (!scale.isHorizontal() && yEnabled) doZoomRect(scale, p0.y, p1.y, limits);
   }
killedBy: zoomPlugin programmatic zoom() resolves mode as a function of the chart, not just a string literal
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:577:14
   const yEnabled = directionEnabled(mode, 'y', chart);
   for (const scale of liveScales(chart)) {
     if (scale.isHorizontal() && xEnabled) doZoomRect(scale, p0.x, p1.x, limits);
-    else if (!scale.isHorizontal() && yEnabled) doZoomRect(scale, p0.y, p1.y, limits);
+    else if (true) doZoomRect(scale, p0.y, p1.y, limits);
   }
   updateChart(chart, transition);
killedBy: zoomPlugin programmatic zoom() treats an unrecognized mode value as disabling every direction (the final false fallback)
statusReason: expected +0 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:577:14
   const yEnabled = directionEnabled(mode, 'y', chart);
   for (const scale of liveScales(chart)) {
     if (scale.isHorizontal() && xEnabled) doZoomRect(scale, p0.x, p1.x, limits);
-    else if (!scale.isHorizontal() && yEnabled) doZoomRect(scale, p0.y, p1.y, limits);
+    else if (false) doZoomRect(scale, p0.y, p1.y, limits);
   }
   updateChart(chart, transition);
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms using only the y distance when mode is y-only (the distanceY branch, not just distanceX)
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] BlockStatement
src/zoomPlugin.ts:583:139
   invoke(zoomOptions?.onZoom, [{ chart, trigger }]);
 }
 
-export function zoomScale(chart: Chart, scaleId: string, range: { min: number; max: number }, transition = 'none', trigger = 'api'): void {
-  const state = getState(chart);
-  storeOriginalScaleLimits(chart, state);
-  const scale = (chart.scales as unknown as Record<string, LiveScale>)[scaleId];
-  updateRange(scale, range, undefined, true);
-  updateChart(chart, transition);
-  invoke(state.options.zoom?.onZoom, [{ chart, trigger }]);
-}
+export function zoomScale(chart: Chart, scaleId: string, range: { min: number; max: number }, transition = 'none', trigger = 'api'): void {}
 
 export function resetZoom(chart: Chart, transition = 'default'): void {
killedBy: zoomPlugin programmatic zoom() reports isZoomedOrPanned true from a max-only change too, not just a min change
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/zoomPlugin.ts:587:40
   const state = getState(chart);
   storeOriginalScaleLimits(chart, state);
   const scale = (chart.scales as unknown as Record<string, LiveScale>)[scaleId];
-  updateRange(scale, range, undefined, true);
+  updateRange(scale, range, undefined, false);
   updateChart(chart, transition);
   invoke(state.options.zoom?.onZoom, [{ chart, trigger }]);
killedBy: zoomPlugin programmatic zoomScale() sets a specific scale directly to the given min/max range
statusReason: expected -35 to be close to 10, received difference is 45, but expected 0.000005
