[Survived] OptionalChaining
src/zoomPlugin.ts:589:10
   const scale = (chart.scales as unknown as Record<string, LiveScale>)[scaleId];
   updateRange(scale, range, undefined, true);
   updateChart(chart, transition);
-  invoke(state.options.zoom?.onZoom, [{ chart, trigger }]);
+  invoke(state.options.zoom.onZoom, [{ chart, trigger }]);
 }
 

[Killed] BlockStatement
src/zoomPlugin.ts:595:42
 export function resetZoom(chart: Chart, transition = 'default'): void {
   const state = getState(chart);
   const originalScaleLimits = storeOriginalScaleLimits(chart, state);
-  for (const scale of liveScales(chart)) {
-    const scaleOptions = scale.options as { min?: number; max?: number };
-    // The `else` branch below (delete, rather than restore) is
-    // structurally very hard to reach: `storeOriginalScaleLimits` just
-    // ran, above, and always populates `originalScaleLimits[scale.id]`
-    // for every scale this same loop iterates (via `liveScales(chart)`,
-    // the identical set) — confirmed by reading `shouldUpdateScaleLimits`
-    // directly: it returns true whenever either limits map lacks an
-    // entry for a scale, which is always true for a scale's very first
-    // encounter. This mirrors the original package's own real logic
-    // exactly (same shape, same apparent reachability gap), not a
-    // simplification introduced by this port.
-    if (originalScaleLimits[scale.id]) {
-      scaleOptions.min = originalScaleLimits[scale.id].min.options;
-      scaleOptions.max = originalScaleLimits[scale.id].max.options;
-    } else {
-      delete scaleOptions.min;
-      delete scaleOptions.max;
-    }
-    delete state.updatedScaleLimits[scale.id];
-  }
+  for (const scale of liveScales(chart)) {}
   updateChart(chart, transition);
   invoke(state.options.zoom?.onZoomComplete, [{ chart }]);
killedBy: zoomPlugin programmatic resetZoom() restores each scale to its original min/max options, clearing any zoom applied since
statusReason: expected 100 to be 5 // Object.is equality

[Killed] BlockStatement
src/zoomPlugin.ts:607:40
     // encounter. This mirrors the original package's own real logic
     // exactly (same shape, same apparent reachability gap), not a
     // simplification introduced by this port.
-    if (originalScaleLimits[scale.id]) {
-      scaleOptions.min = originalScaleLimits[scale.id].min.options;
-      scaleOptions.max = originalScaleLimits[scale.id].max.options;
-    } else {
+    if (originalScaleLimits[scale.id]) {} else {
       delete scaleOptions.min;
       delete scaleOptions.max;
killedBy: zoomPlugin programmatic resetZoom() restores each scale to its original min/max options, clearing any zoom applied since
statusReason: expected 100 to be 5 // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:607:9
     // encounter. This mirrors the original package's own real logic
     // exactly (same shape, same apparent reachability gap), not a
     // simplification introduced by this port.
-    if (originalScaleLimits[scale.id]) {
+    if (true) {
       scaleOptions.min = originalScaleLimits[scale.id].min.options;
       scaleOptions.max = originalScaleLimits[scale.id].max.options;
killedBy: zoomPlugin programmatic resetZoom() deletes min/max for a scale that appears only after storeOriginalScaleLimits already ran (no original entry exists yet)
statusReason: Cannot read properties of undefined (reading 'min')

[Survived] BlockStatement
src/zoomPlugin.ts:610:12
     if (originalScaleLimits[scale.id]) {
       scaleOptions.min = originalScaleLimits[scale.id].min.options;
       scaleOptions.max = originalScaleLimits[scale.id].max.options;
-    } else {
-      delete scaleOptions.min;
-      delete scaleOptions.max;
-    }
+    } else {}
     delete state.updatedScaleLimits[scale.id];
   }

[Survived] OptionalChaining
src/zoomPlugin.ts:617:10
     delete state.updatedScaleLimits[scale.id];
   }
   updateChart(chart, transition);
-  invoke(state.options.zoom?.onZoomComplete, [{ chart }]);
+  invoke(state.options.zoom.onZoomComplete, [{ chart }]);
 }
 

[Killed] BlockStatement
src/zoomPlugin.ts:620:88
   invoke(state.options.zoom?.onZoomComplete, [{ chart }]);
 }
 
-function getOriginalRange(state: ZoomPluginState, scaleId: string): number | undefined {
-  const original = state.originalScaleLimits[scaleId];
-  if (!original) return undefined;
-  return (original.max.options ?? original.max.scale) - (original.min.options ?? original.min.scale);
-}
+function getOriginalRange(state: ZoomPluginState, scaleId: string): number | undefined {}
 
 export function getZoomLevel(chart: Chart): number {
killedBy: zoomPlugin programmatic zoom() zooms out, producing a zoom level below 1 (getZoomLevel's own min<1 branch, not just the max branch)
statusReason: expected 1 to be less than 1

[Killed] BooleanLiteral
src/zoomPlugin.ts:622:7
 
 function getOriginalRange(state: ZoomPluginState, scaleId: string): number | undefined {
   const original = state.originalScaleLimits[scaleId];
-  if (!original) return undefined;
+  if (original) return undefined;
   return (original.max.options ?? original.max.scale) - (original.min.options ?? original.min.scale);
 }
killedBy: zoomPlugin programmatic zoom() zooms out, producing a zoom level below 1 (getZoomLevel's own min<1 branch, not just the max branch)
statusReason: expected 1 to be less than 1

[Killed] ConditionalExpression
src/zoomPlugin.ts:622:7
 
 function getOriginalRange(state: ZoomPluginState, scaleId: string): number | undefined {
   const original = state.originalScaleLimits[scaleId];
-  if (!original) return undefined;
+  if (true) return undefined;
   return (original.max.options ?? original.max.scale) - (original.min.options ?? original.min.scale);
 }
killedBy: zoomPlugin programmatic zoom() zooms out, producing a zoom level below 1 (getZoomLevel's own min<1 branch, not just the max branch)
statusReason: expected 1 to be less than 1

[Killed] LogicalOperator
src/zoomPlugin.ts:623:58
 function getOriginalRange(state: ZoomPluginState, scaleId: string): number | undefined {
   const original = state.originalScaleLimits[scaleId];
   if (!original) return undefined;
-  return (original.max.options ?? original.max.scale) - (original.min.options ?? original.min.scale);
+  return (original.max.options ?? original.max.scale) - (original.min.options && original.min.scale);
 }
 
killedBy: zoomPlugin programmatic zoom() zooms out, producing a zoom level below 1 (getZoomLevel's own min<1 branch, not just the max branch)
statusReason: expected 1 to be less than 1

[Killed] LogicalOperator
src/zoomPlugin.ts:623:11
 function getOriginalRange(state: ZoomPluginState, scaleId: string): number | undefined {
   const original = state.originalScaleLimits[scaleId];
   if (!original) return undefined;
-  return (original.max.options ?? original.max.scale) - (original.min.options ?? original.min.scale);
+  return (original.max.options && original.max.scale) - (original.min.options ?? original.min.scale);
 }
 
killedBy: zoomPlugin programmatic zoom() zooms out, producing a zoom level below 1 (getZoomLevel's own min<1 branch, not just the max branch)
statusReason: expected 1 to be less than 1

[Killed] BlockStatement
src/zoomPlugin.ts:626:52
   return (original.max.options ?? original.max.scale) - (original.min.options ?? original.min.scale);
 }
 
-export function getZoomLevel(chart: Chart): number {
-  const state = getState(chart);
-  let min = 1;
-  let max = 1;
-  for (const scale of liveScales(chart)) {
-    const origRange = getOriginalRange(state, scale.id);
-    if (origRange) {
-      const level = Math.round((origRange / (scale.max - scale.min)) * 100) / 100;
-      min = Math.min(min, level);
-      max = Math.max(max, level);
-    }
-  }
-  return min < 1 ? min : max;
-}
+export function getZoomLevel(chart: Chart): number {}
 
 function panScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, state: ZoomPluginState): void {
killedBy: zoomPlugin programmatic zoom() zooms out, producing a zoom level below 1 (getZoomLevel's own min<1 branch, not just the max branch)
statusReason: actual value must be number or bigint, received "undefined"

[Killed] BlockStatement
src/zoomPlugin.ts:630:42
   const state = getState(chart);
   let min = 1;
   let max = 1;
-  for (const scale of liveScales(chart)) {
-    const origRange = getOriginalRange(state, scale.id);
-    if (origRange) {
-      const level = Math.round((origRange / (scale.max - scale.min)) * 100) / 100;
-      min = Math.min(min, level);
-      max = Math.max(max, level);
-    }
-  }
+  for (const scale of liveScales(chart)) {}
   return min < 1 ? min : max;
 }
killedBy: zoomPlugin programmatic zoom() zooms out, producing a zoom level below 1 (getZoomLevel's own min<1 branch, not just the max branch)
statusReason: expected 1 to be less than 1

[Killed] ConditionalExpression
src/zoomPlugin.ts:632:9
   let max = 1;
   for (const scale of liveScales(chart)) {
     const origRange = getOriginalRange(state, scale.id);
-    if (origRange) {
+    if (false) {
       const level = Math.round((origRange / (scale.max - scale.min)) * 100) / 100;
       min = Math.min(min, level);
killedBy: zoomPlugin programmatic zoom() zooms out, producing a zoom level below 1 (getZoomLevel's own min<1 branch, not just the max branch)
statusReason: expected 1 to be less than 1

[Killed] ConditionalExpression
src/zoomPlugin.ts:632:9
   let max = 1;
   for (const scale of liveScales(chart)) {
     const origRange = getOriginalRange(state, scale.id);
-    if (origRange) {
+    if (true) {
       const level = Math.round((origRange / (scale.max - scale.min)) * 100) / 100;
       min = Math.min(min, level);
killedBy: zoomPlugin getZoomLevel / isZoomedOrPanned / isZoomingOrPanning reports zoom level 1 (no zoom) before any zoom, and something else after
statusReason: expected NaN to be 1 // Object.is equality

[Killed] ArithmeticOperator
src/zoomPlugin.ts:633:33
   for (const scale of liveScales(chart)) {
     const origRange = getOriginalRange(state, scale.id);
     if (origRange) {
-      const level = Math.round((origRange / (scale.max - scale.min)) * 100) / 100;
+      const level = Math.round((origRange * (scale.max - scale.min)) * 100) / 100;
       min = Math.min(min, level);
       max = Math.max(max, level);
killedBy: zoomPlugin programmatic zoom() zooms out, producing a zoom level below 1 (getZoomLevel's own min<1 branch, not just the max branch)
statusReason: expected 15000 to be less than 1

[Killed] ArithmeticOperator
src/zoomPlugin.ts:633:46
   for (const scale of liveScales(chart)) {
     const origRange = getOriginalRange(state, scale.id);
     if (origRange) {
-      const level = Math.round((origRange / (scale.max - scale.min)) * 100) / 100;
+      const level = Math.round((origRange / (scale.max + scale.min)) * 100) / 100;
       min = Math.min(min, level);
       max = Math.max(max, level);
killedBy: zoomPlugin programmatic zoom() zooms out, producing a zoom level below 1 (getZoomLevel's own min<1 branch, not just the max branch)
statusReason: expected 2 to be less than 1

[Killed] MethodExpression
src/zoomPlugin.ts:634:13
     const origRange = getOriginalRange(state, scale.id);
     if (origRange) {
       const level = Math.round((origRange / (scale.max - scale.min)) * 100) / 100;
-      min = Math.min(min, level);
+      min = Math.max(min, level);
       max = Math.max(max, level);
     }
killedBy: zoomPlugin programmatic zoom() zooms out, producing a zoom level below 1 (getZoomLevel's own min<1 branch, not just the max branch)
statusReason: expected 1 to be less than 1

[Killed] MethodExpression
src/zoomPlugin.ts:635:13
     if (origRange) {
       const level = Math.round((origRange / (scale.max - scale.min)) * 100) / 100;
       min = Math.min(min, level);
-      max = Math.max(max, level);
+      max = Math.min(max, level);
     }
   }
killedBy: zoomPlugin getZoomLevel / isZoomedOrPanned / isZoomingOrPanning reports zoom level 1 (no zoom) before any zoom, and something else after
statusReason: expected 1 not to be 1 // Object.is equality

[Killed] EqualityOperator
src/zoomPlugin.ts:638:10
       max = Math.max(max, level);
     }
   }
-  return min < 1 ? min : max;
+  return min <= 1 ? min : max;
 }
 
killedBy: zoomPlugin getZoomLevel / isZoomedOrPanned / isZoomingOrPanning reports zoom level 1 (no zoom) before any zoom, and something else after
statusReason: expected 1 not to be 1 // Object.is equality

[Killed] EqualityOperator
src/zoomPlugin.ts:638:10
       max = Math.max(max, level);
     }
   }
-  return min < 1 ? min : max;
+  return min >= 1 ? min : max;
 }
 
killedBy: zoomPlugin programmatic zoom() zooms out, producing a zoom level below 1 (getZoomLevel's own min<1 branch, not just the max branch)
statusReason: expected 1 to be less than 1

[Killed] BlockStatement
src/zoomPlugin.ts:641:131
   return min < 1 ? min : max;
 }
 
-function panScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, state: ZoomPluginState): void {
-  const { panDelta } = state;
-  const storedDelta = panDelta[scale.id] || 0;
-  const effectiveDelta = Math.sign(storedDelta) === Math.sign(delta) ? delta + storedDelta : delta;
-  const fn = panFunctions[scale.type] ?? panFunctions.default;
-  // The `else` branch below (accumulating an unapplied delta for the
-  // next pan call) needs `fn(...)` to return false — meaning the range
-  // was computed but didn't actually change. Confirmed reachable, not
-  // just theoretical: an extremely small delta (e.g. 1e-7) on a scale
-  // with no configured limits lets `fixRange`'s own epsilon-snap-to-
-  // original logic (`range / 1e6`) snap the computed range exactly back
-  // to the scale's own original bounds, making `updateRange`'s own
-  // final "did this actually change anything" check false — see the
-  // real, working test for this exact scenario in
-  // tests/unit/zoomPlugin.spec.ts.
-  if (fn(scale, effectiveDelta, limits)) {
-    panDelta[scale.id] = 0;
-  } else {
-    panDelta[scale.id] = effectiveDelta;
-  }
-}
+function panScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, state: ZoomPluginState): void {}
 
 export function pan(chart: Chart, delta: number | { x?: number; y?: number }, enabledScales?: LiveScale[], transition = 'none'): void {
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Killed] ConditionalExpression
src/zoomPlugin.ts:643:23
 
 function panScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, state: ZoomPluginState): void {
   const { panDelta } = state;
-  const storedDelta = panDelta[scale.id] || 0;
+  const storedDelta = true;
   const effectiveDelta = Math.sign(storedDelta) === Math.sign(delta) ? delta + storedDelta : delta;
   const fn = panFunctions[scale.type] ?? panFunctions.default;
killedBy: zoomPlugin category scale zoom/pan accumulates an unapplied pan delta rather than losing it, for a delta too small to move the range at all
statusReason: expected -1.0000000999999972 to be +0 // Object.is equality

[Survived] LogicalOperator
src/zoomPlugin.ts:643:23
 
 function panScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, state: ZoomPluginState): void {
   const { panDelta } = state;
-  const storedDelta = panDelta[scale.id] || 0;
+  const storedDelta = panDelta[scale.id] && 0;
   const effectiveDelta = Math.sign(storedDelta) === Math.sign(delta) ? delta + storedDelta : delta;
   const fn = panFunctions[scale.type] ?? panFunctions.default;

[Survived] ConditionalExpression
src/zoomPlugin.ts:644:26
 function panScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, state: ZoomPluginState): void {
   const { panDelta } = state;
   const storedDelta = panDelta[scale.id] || 0;
-  const effectiveDelta = Math.sign(storedDelta) === Math.sign(delta) ? delta + storedDelta : delta;
+  const effectiveDelta = false ? delta + storedDelta : delta;
   const fn = panFunctions[scale.type] ?? panFunctions.default;
   // The `else` branch below (accumulating an unapplied delta for the

[Survived] ConditionalExpression
src/zoomPlugin.ts:644:26
 function panScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, state: ZoomPluginState): void {
   const { panDelta } = state;
   const storedDelta = panDelta[scale.id] || 0;
-  const effectiveDelta = Math.sign(storedDelta) === Math.sign(delta) ? delta + storedDelta : delta;
+  const effectiveDelta = true ? delta + storedDelta : delta;
   const fn = panFunctions[scale.type] ?? panFunctions.default;
   // The `else` branch below (accumulating an unapplied delta for the

[Killed] LogicalOperator
src/zoomPlugin.ts:645:14
   const { panDelta } = state;
   const storedDelta = panDelta[scale.id] || 0;
   const effectiveDelta = Math.sign(storedDelta) === Math.sign(delta) ? delta + storedDelta : delta;
-  const fn = panFunctions[scale.type] ?? panFunctions.default;
+  const fn = panFunctions[scale.type] && panFunctions.default;
   // The `else` branch below (accumulating an unapplied delta for the
   // next pan call) needs `fn(...)` to return false — meaning the range
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: fn is not a function

[Killed] ConditionalExpression
src/zoomPlugin.ts:656:7
   // final "did this actually change anything" check false — see the
   // real, working test for this exact scenario in
   // tests/unit/zoomPlugin.spec.ts.
-  if (fn(scale, effectiveDelta, limits)) {
+  if (true) {
     panDelta[scale.id] = 0;
   } else {
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Killed] ConditionalExpression
src/zoomPlugin.ts:656:7
   // final "did this actually change anything" check false — see the
   // real, working test for this exact scenario in
   // tests/unit/zoomPlugin.spec.ts.
-  if (fn(scale, effectiveDelta, limits)) {
+  if (false) {
     panDelta[scale.id] = 0;
   } else {
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Survived] BlockStatement
src/zoomPlugin.ts:658:10
   // tests/unit/zoomPlugin.spec.ts.
   if (fn(scale, effectiveDelta, limits)) {
     panDelta[scale.id] = 0;
-  } else {
-    panDelta[scale.id] = effectiveDelta;
-  }
+  } else {}
 }
 

[Killed] BlockStatement
src/zoomPlugin.ts:663:135
   }
 }
 
-export function pan(chart: Chart, delta: number | { x?: number; y?: number }, enabledScales?: LiveScale[], transition = 'none'): void {
-  const { x = 0, y = 0 } = typeof delta === 'number' ? { x: delta, y: delta } : delta;
-  const state = getState(chart);
-  const { pan: panOptions, limits } = state.options;
-  storeOriginalScaleLimits(chart, state);
-  const xEnabled = x !== 0;
-  const yEnabled = y !== 0;
-  const scalesToPan = enabledScales?.length ? enabledScales : liveScales(chart);
-  // Unlike `zoom()` above, `pan()`'s own `enabledScales` parameter is
-  // genuinely optional here (undefined when called directly, e.g. via
-  // the public `chart.pan()` API with no explicit scale list) — so this
-  // fallback IS real and intentional, matching the original's own
-  // `enabledScales || chart.scales` for this specific function (whose
-  // own `enabledScales` argument can genuinely be undefined, unlike
-  // `zoom()`'s own always-computed-array `enabledScales`).
-  for (const scale of scalesToPan) {
-    if (scale.isHorizontal() && xEnabled) panScale(scale, x, limits, state);
-    else if (!scale.isHorizontal() && yEnabled) panScale(scale, y, limits, state);
-  }
-  updateChart(chart, transition);
-  invoke(panOptions?.onPan, [{ chart }]);
-}
+export function pan(chart: Chart, delta: number | { x?: number; y?: number }, enabledScales?: LiveScale[], transition = 'none'): void {}
 
 export function getInitialScaleBounds(chart: Chart): Record<string, { min?: number; max?: number }> {
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Killed] EqualityOperator
src/zoomPlugin.ts:664:28
 }
 
 export function pan(chart: Chart, delta: number | { x?: number; y?: number }, enabledScales?: LiveScale[], transition = 'none'): void {
-  const { x = 0, y = 0 } = typeof delta === 'number' ? { x: delta, y: delta } : delta;
+  const { x = 0, y = 0 } = typeof delta !== 'number' ? { x: delta, y: delta } : delta;
   const state = getState(chart);
   const { pan: panOptions, limits } = state.options;
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Killed] ConditionalExpression
src/zoomPlugin.ts:664:28
 }
 
 export function pan(chart: Chart, delta: number | { x?: number; y?: number }, enabledScales?: LiveScale[], transition = 'none'): void {
-  const { x = 0, y = 0 } = typeof delta === 'number' ? { x: delta, y: delta } : delta;
+  const { x = 0, y = 0 } = true ? { x: delta, y: delta } : delta;
   const state = getState(chart);
   const { pan: panOptions, limits } = state.options;
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Killed] EqualityOperator
src/zoomPlugin.ts:668:20
   const state = getState(chart);
   const { pan: panOptions, limits } = state.options;
   storeOriginalScaleLimits(chart, state);
-  const xEnabled = x !== 0;
+  const xEnabled = x === 0;
   const yEnabled = y !== 0;
   const scalesToPan = enabledScales?.length ? enabledScales : liveScales(chart);
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Killed] ConditionalExpression
src/zoomPlugin.ts:668:20
   const state = getState(chart);
   const { pan: panOptions, limits } = state.options;
   storeOriginalScaleLimits(chart, state);
-  const xEnabled = x !== 0;
+  const xEnabled = false;
   const yEnabled = y !== 0;
   const scalesToPan = enabledScales?.length ? enabledScales : liveScales(chart);
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Killed] ConditionalExpression
src/zoomPlugin.ts:669:20
   const { pan: panOptions, limits } = state.options;
   storeOriginalScaleLimits(chart, state);
   const xEnabled = x !== 0;
-  const yEnabled = y !== 0;
+  const yEnabled = false;
   const scalesToPan = enabledScales?.length ? enabledScales : liveScales(chart);
   // Unlike `zoom()` above, `pan()`'s own `enabledScales` parameter is
killedBy: zoomPlugin programmatic pan() pans a y-axis scale too (not just the x-axis branch already covered above)
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/zoomPlugin.ts:669:20
   const { pan: panOptions, limits } = state.options;
   storeOriginalScaleLimits(chart, state);
   const xEnabled = x !== 0;
-  const yEnabled = y !== 0;
+  const yEnabled = y === 0;
   const scalesToPan = enabledScales?.length ? enabledScales : liveScales(chart);
   // Unlike `zoom()` above, `pan()`'s own `enabledScales` parameter is
killedBy: zoomPlugin programmatic pan() pans a y-axis scale too (not just the x-axis branch already covered above)
statusReason: expected undefined to be defined

[Killed] OptionalChaining
src/zoomPlugin.ts:670:23
   storeOriginalScaleLimits(chart, state);
   const xEnabled = x !== 0;
   const yEnabled = y !== 0;
-  const scalesToPan = enabledScales?.length ? enabledScales : liveScales(chart);
+  const scalesToPan = enabledScales.length ? enabledScales : liveScales(chart);
   // Unlike `zoom()` above, `pan()`'s own `enabledScales` parameter is
   // genuinely optional here (undefined when called directly, e.g. via
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BlockStatement
src/zoomPlugin.ts:678:36
   // `enabledScales || chart.scales` for this specific function (whose
   // own `enabledScales` argument can genuinely be undefined, unlike
   // `zoom()`'s own always-computed-array `enabledScales`).
-  for (const scale of scalesToPan) {
-    if (scale.isHorizontal() && xEnabled) panScale(scale, x, limits, state);
-    else if (!scale.isHorizontal() && yEnabled) panScale(scale, y, limits, state);
-  }
+  for (const scale of scalesToPan) {}
   updateChart(chart, transition);
   invoke(panOptions?.onPan, [{ chart }]);
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Killed] ConditionalExpression
src/zoomPlugin.ts:679:9
   // own `enabledScales` argument can genuinely be undefined, unlike
   // `zoom()`'s own always-computed-array `enabledScales`).
   for (const scale of scalesToPan) {
-    if (scale.isHorizontal() && xEnabled) panScale(scale, x, limits, state);
+    if (false) panScale(scale, x, limits, state);
     else if (!scale.isHorizontal() && yEnabled) panScale(scale, y, limits, state);
   }
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Survived] ConditionalExpression
src/zoomPlugin.ts:679:9
   // own `enabledScales` argument can genuinely be undefined, unlike
   // `zoom()`'s own always-computed-array `enabledScales`).
   for (const scale of scalesToPan) {
-    if (scale.isHorizontal() && xEnabled) panScale(scale, x, limits, state);
+    if (true) panScale(scale, x, limits, state);
     else if (!scale.isHorizontal() && yEnabled) panScale(scale, y, limits, state);
   }

[Killed] BooleanLiteral
src/zoomPlugin.ts:680:14
   // `zoom()`'s own always-computed-array `enabledScales`).
   for (const scale of scalesToPan) {
     if (scale.isHorizontal() && xEnabled) panScale(scale, x, limits, state);
-    else if (!scale.isHorizontal() && yEnabled) panScale(scale, y, limits, state);
+    else if (scale.isHorizontal() && yEnabled) panScale(scale, y, limits, state);
   }
   updateChart(chart, transition);
killedBy: zoomPlugin programmatic pan() pans a y-axis scale too (not just the x-axis branch already covered above)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:680:14
   // `zoom()`'s own always-computed-array `enabledScales`).
   for (const scale of scalesToPan) {
     if (scale.isHorizontal() && xEnabled) panScale(scale, x, limits, state);
-    else if (!scale.isHorizontal() && yEnabled) panScale(scale, y, limits, state);
+    else if (false) panScale(scale, y, limits, state);
   }
   updateChart(chart, transition);
killedBy: zoomPlugin programmatic pan() pans a y-axis scale too (not just the x-axis branch already covered above)
statusReason: expected undefined to be defined

[Survived] OptionalChaining
src/zoomPlugin.ts:683:10
     else if (!scale.isHorizontal() && yEnabled) panScale(scale, y, limits, state);
   }
   updateChart(chart, transition);
-  invoke(panOptions?.onPan, [{ chart }]);
+  invoke(panOptions.onPan, [{ chart }]);
 }
 

[Killed] ArrayDeclaration
src/zoomPlugin.ts:683:29
     else if (!scale.isHorizontal() && yEnabled) panScale(scale, y, limits, state);
   }
   updateChart(chart, transition);
-  invoke(panOptions?.onPan, [{ chart }]);
+  invoke(panOptions?.onPan, []);
 }
 
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys invoke()s onPan with the real chart, on a programmatic pan
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

- Array [
-   ObjectContaining {

[Killed] BlockStatement
src/zoomPlugin.ts:686:101
   invoke(panOptions?.onPan, [{ chart }]);
 }
 
-export function getInitialScaleBounds(chart: Chart): Record<string, { min?: number; max?: number }> {
-  const state = getState(chart);
-  storeOriginalScaleLimits(chart, state);
-  const bounds: Record<string, { min?: number; max?: number }> = {};
-  for (const scaleId of Object.keys(chart.scales)) {
-    const entry = state.originalScaleLimits[scaleId];
-    bounds[scaleId] = { min: entry?.min.scale, max: entry?.max.scale };
-  }
-  return bounds;
-}
+export function getInitialScaleBounds(chart: Chart): Record<string, { min?: number; max?: number }> {}
 
 export function getZoomedScaleBounds(chart: Chart): Record<string, { min: number; max: number } | undefined> {
killedBy: zoomPlugin programmatic zoom() reports isZoomedOrPanned true from a max-only change too, not just a min change
statusReason: Cannot read properties of undefined (reading 'x')
