[Killed] BlockStatement
src/zoomPlugin.ts:690:52
   const state = getState(chart);
   storeOriginalScaleLimits(chart, state);
   const bounds: Record<string, { min?: number; max?: number }> = {};
-  for (const scaleId of Object.keys(chart.scales)) {
-    const entry = state.originalScaleLimits[scaleId];
-    bounds[scaleId] = { min: entry?.min.scale, max: entry?.max.scale };
-  }
+  for (const scaleId of Object.keys(chart.scales)) {}
   return bounds;
 }
killedBy: zoomPlugin programmatic zoom() reports isZoomedOrPanned true from a max-only change too, not just a min change
statusReason: Cannot destructure property 'min' of 'bounds[scaleId]' as it is undefined.

[Survived] OptionalChaining
src/zoomPlugin.ts:692:53
   const bounds: Record<string, { min?: number; max?: number }> = {};
   for (const scaleId of Object.keys(chart.scales)) {
     const entry = state.originalScaleLimits[scaleId];
-    bounds[scaleId] = { min: entry?.min.scale, max: entry?.max.scale };
+    bounds[scaleId] = { min: entry?.min.scale, max: entry.max.scale };
   }
   return bounds;

[Survived] OptionalChaining
src/zoomPlugin.ts:692:30
   const bounds: Record<string, { min?: number; max?: number }> = {};
   for (const scaleId of Object.keys(chart.scales)) {
     const entry = state.originalScaleLimits[scaleId];
-    bounds[scaleId] = { min: entry?.min.scale, max: entry?.max.scale };
+    bounds[scaleId] = { min: entry.min.scale, max: entry?.max.scale };
   }
   return bounds;

[Killed] BlockStatement
src/zoomPlugin.ts:697:110
   return bounds;
 }
 
-export function getZoomedScaleBounds(chart: Chart): Record<string, { min: number; max: number } | undefined> {
-  const state = getState(chart);
-  const bounds: Record<string, { min: number; max: number } | undefined> = {};
-  for (const scaleId of Object.keys(chart.scales)) {
-    bounds[scaleId] = state.updatedScaleLimits[scaleId];
-  }
-  return bounds;
-}
+export function getZoomedScaleBounds(chart: Chart): Record<string, { min: number; max: number } | undefined> {}
 
 export function isZoomedOrPanned(chart: Chart): boolean {
killedBy: zoomPlugin getInitialScaleBounds / getZoomedScaleBounds reports the original bounds before zoom, and the updated bounds after
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] BlockStatement
src/zoomPlugin.ts:700:52
 export function getZoomedScaleBounds(chart: Chart): Record<string, { min: number; max: number } | undefined> {
   const state = getState(chart);
   const bounds: Record<string, { min: number; max: number } | undefined> = {};
-  for (const scaleId of Object.keys(chart.scales)) {
-    bounds[scaleId] = state.updatedScaleLimits[scaleId];
-  }
+  for (const scaleId of Object.keys(chart.scales)) {}
   return bounds;
 }
killedBy: zoomPlugin getInitialScaleBounds / getZoomedScaleBounds reports the original bounds before zoom, and the updated bounds after
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/zoomPlugin.ts:706:57
   return bounds;
 }
 
-export function isZoomedOrPanned(chart: Chart): boolean {
-  const bounds = getInitialScaleBounds(chart);
-  const scales = chart.scales as unknown as Record<string, LiveScale>;
-  for (const scaleId of Object.keys(chart.scales)) {
-    const { min: originalMin, max: originalMax } = bounds[scaleId];
-    if (originalMin !== undefined && scales[scaleId].min !== originalMin) return true;
-    if (originalMax !== undefined && scales[scaleId].max !== originalMax) return true;
-  }
-  return false;
-}
+export function isZoomedOrPanned(chart: Chart): boolean {}
 
 export function isZoomingOrPanning(chart: Chart): boolean {
killedBy: zoomPlugin programmatic zoom() reports isZoomedOrPanned true from a max-only change too, not just a min change
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/zoomPlugin.ts:709:52
 export function isZoomedOrPanned(chart: Chart): boolean {
   const bounds = getInitialScaleBounds(chart);
   const scales = chart.scales as unknown as Record<string, LiveScale>;
-  for (const scaleId of Object.keys(chart.scales)) {
-    const { min: originalMin, max: originalMax } = bounds[scaleId];
-    if (originalMin !== undefined && scales[scaleId].min !== originalMin) return true;
-    if (originalMax !== undefined && scales[scaleId].max !== originalMax) return true;
-  }
+  for (const scaleId of Object.keys(chart.scales)) {}
   return false;
 }
killedBy: zoomPlugin programmatic zoom() reports isZoomedOrPanned true from a max-only change too, not just a min change
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:711:9
   const scales = chart.scales as unknown as Record<string, LiveScale>;
   for (const scaleId of Object.keys(chart.scales)) {
     const { min: originalMin, max: originalMax } = bounds[scaleId];
-    if (originalMin !== undefined && scales[scaleId].min !== originalMin) return true;
+    if (false) return true;
     if (originalMax !== undefined && scales[scaleId].max !== originalMax) return true;
   }
killedBy: zoomPlugin getZoomLevel / isZoomedOrPanned / isZoomingOrPanning reports isZoomedOrPanned false before any zoom, true after
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/zoomPlugin.ts:711:82
   const scales = chart.scales as unknown as Record<string, LiveScale>;
   for (const scaleId of Object.keys(chart.scales)) {
     const { min: originalMin, max: originalMax } = bounds[scaleId];
-    if (originalMin !== undefined && scales[scaleId].min !== originalMin) return true;
+    if (originalMin !== undefined && scales[scaleId].min !== originalMin) return false;
     if (originalMax !== undefined && scales[scaleId].max !== originalMax) return true;
   }
killedBy: zoomPlugin getZoomLevel / isZoomedOrPanned / isZoomingOrPanning reports isZoomedOrPanned false before any zoom, true after
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/zoomPlugin.ts:712:38
   for (const scaleId of Object.keys(chart.scales)) {
     const { min: originalMin, max: originalMax } = bounds[scaleId];
     if (originalMin !== undefined && scales[scaleId].min !== originalMin) return true;
-    if (originalMax !== undefined && scales[scaleId].max !== originalMax) return true;
+    if (originalMax !== undefined && scales[scaleId].max === originalMax) return true;
   }
   return false;
killedBy: zoomPlugin programmatic zoom() reports isZoomedOrPanned true from a max-only change too, not just a min change
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/zoomPlugin.ts:712:82
   for (const scaleId of Object.keys(chart.scales)) {
     const { min: originalMin, max: originalMax } = bounds[scaleId];
     if (originalMin !== undefined && scales[scaleId].min !== originalMin) return true;
-    if (originalMax !== undefined && scales[scaleId].max !== originalMax) return true;
+    if (originalMax !== undefined && scales[scaleId].max !== originalMax) return false;
   }
   return false;
killedBy: zoomPlugin programmatic zoom() reports isZoomedOrPanned true from a max-only change too, not just a min change
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/zoomPlugin.ts:717:59
   return false;
 }
 
-export function isZoomingOrPanning(chart: Chart): boolean {
-  const state = getState(chart);
-  return state.panning || state.dragging;
-}
+export function isZoomingOrPanning(chart: Chart): boolean {}
 
 // ---- DOM event handling (wheel zoom, drag-to-zoom-rectangle) ----
killedBy: zoomPlugin getZoomLevel / isZoomedOrPanned / isZoomingOrPanning reports isZoomingOrPanning false outside of an active drag
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:719:10
 
 export function isZoomingOrPanning(chart: Chart): boolean {
   const state = getState(chart);
-  return state.panning || state.dragging;
+  return false;
 }
 
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys beforeEvent: suppresses a genuine "mouseup" event too during an active drag, not just "cl
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:719:10
 
 export function isZoomingOrPanning(chart: Chart): boolean {
   const state = getState(chart);
-  return state.panning || state.dragging;
+  return true;
 }
 
killedBy: zoomPlugin getZoomLevel / isZoomedOrPanned / isZoomingOrPanning reports isZoomingOrPanning false outside of an active drag
statusReason: expected true to be false // Object.is equality

[Killed] MethodExpression
src/zoomPlugin.ts:724:77
 
 // ---- DOM event handling (wheel zoom, drag-to-zoom-rectangle) ----
 
-const clamp = (x: number, from: number, to: number): number => Math.min(to, Math.max(from, x));
+const clamp = (x: number, from: number, to: number): number => Math.min(to, Math.min(from, x));
 
 function removeHandler(chart: Chart, type: string): void {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] MethodExpression
src/zoomPlugin.ts:724:64
 
 // ---- DOM event handling (wheel zoom, drag-to-zoom-rectangle) ----
 
-const clamp = (x: number, from: number, to: number): number => Math.min(to, Math.max(from, x));
+const clamp = (x: number, from: number, to: number): number => Math.max(to, Math.max(from, x));
 
 function removeHandler(chart: Chart, type: string): void {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] ConditionalExpression
src/zoomPlugin.ts:729:7
 function removeHandler(chart: Chart, type: string): void {
   const { handlers } = getState(chart);
   const handler = handlers[type] as (EventListener & { target?: EventTarget }) | undefined;
-  if (handler?.target) {
+  if (true) {
     handler.target.removeEventListener(type, handler);
     delete handlers[type];
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'target')

[Killed] OptionalChaining
src/zoomPlugin.ts:729:7
 function removeHandler(chart: Chart, type: string): void {
   const { handlers } = getState(chart);
   const handler = handlers[type] as (EventListener & { target?: EventTarget }) | undefined;
-  if (handler?.target) {
+  if (handler.target) {
     handler.target.removeEventListener(type, handler);
     delete handlers[type];
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'target')

[Killed] BlockStatement
src/zoomPlugin.ts:734:151
     delete handlers[type];
   }
 }
-function addHandler(chart: Chart, target: EventTarget, type: string, handler: (chart: Chart, event: Event, options: ZoomPluginOptions) => void): void {
-  const { handlers, options } = getState(chart);
-  const oldHandler = handlers[type] as (EventListener & { target?: EventTarget }) | undefined;
-  if (oldHandler?.target === target) return;
-  removeHandler(chart, type);
-  const wrapped = ((event: Event) => handler(chart, event, options)) as EventListener & { target?: EventTarget };
-  wrapped.target = target;
-  handlers[type] = wrapped;
-  const passive = type === 'wheel' ? false : undefined;
-  target.addEventListener(type, wrapped, { passive });
-}
+function addHandler(chart: Chart, target: EventTarget, type: string, handler: (chart: Chart, event: Event, options: ZoomPluginOptions) => void): void {}
 function mouseMove(chart: Chart, event: Event): void {
   const state = getState(chart);
killedBy: zoomPlugin wheel-zoom interaction zooms in on a real wheel event when wheel.enabled is true
statusReason: expected undefined to be defined

[Killed] OptionalChaining
src/zoomPlugin.ts:737:7
 function addHandler(chart: Chart, target: EventTarget, type: string, handler: (chart: Chart, event: Event, options: ZoomPluginOptions) => void): void {
   const { handlers, options } = getState(chart);
   const oldHandler = handlers[type] as (EventListener & { target?: EventTarget }) | undefined;
-  if (oldHandler?.target === target) return;
+  if (oldHandler.target === target) return;
   removeHandler(chart, type);
   const wrapped = ((event: Event) => handler(chart, event, options)) as EventListener & { target?: EventTarget };
killedBy: zoomPlugin programmatic zoom() falls back to zooming every scale when zoom is called with no zoom config at all (getEnabledScalesByPoint's own default)
statusReason: Cannot read properties of undefined (reading 'target')

[Killed] EqualityOperator
src/zoomPlugin.ts:737:7
 function addHandler(chart: Chart, target: EventTarget, type: string, handler: (chart: Chart, event: Event, options: ZoomPluginOptions) => void): void {
   const { handlers, options } = getState(chart);
   const oldHandler = handlers[type] as (EventListener & { target?: EventTarget }) | undefined;
-  if (oldHandler?.target === target) return;
+  if (oldHandler?.target !== target) return;
   removeHandler(chart, type);
   const wrapped = ((event: Event) => handler(chart, event, options)) as EventListener & { target?: EventTarget };
killedBy: zoomPlugin wheel-zoom interaction zooms in on a real wheel event when wheel.enabled is true
statusReason: expected undefined to be defined

[Survived] BooleanLiteral
src/zoomPlugin.ts:742:38
   const wrapped = ((event: Event) => handler(chart, event, options)) as EventListener & { target?: EventTarget };
   wrapped.target = target;
   handlers[type] = wrapped;
-  const passive = type === 'wheel' ? false : undefined;
+  const passive = type === 'wheel' ? true : undefined;
   target.addEventListener(type, wrapped, { passive });
 }

[Survived] ConditionalExpression
src/zoomPlugin.ts:742:19
   const wrapped = ((event: Event) => handler(chart, event, options)) as EventListener & { target?: EventTarget };
   wrapped.target = target;
   handlers[type] = wrapped;
-  const passive = type === 'wheel' ? false : undefined;
+  const passive = true ? false : undefined;
   target.addEventListener(type, wrapped, { passive });
 }

[Survived] ObjectLiteral
src/zoomPlugin.ts:743:42
   wrapped.target = target;
   handlers[type] = wrapped;
   const passive = type === 'wheel' ? false : undefined;
-  target.addEventListener(type, wrapped, { passive });
+  target.addEventListener(type, wrapped, {});
 }
 function mouseMove(chart: Chart, event: Event): void {

[Killed] BlockStatement
src/zoomPlugin.ts:745:54
   const passive = type === 'wheel' ? false : undefined;
   target.addEventListener(type, wrapped, { passive });
 }
-function mouseMove(chart: Chart, event: Event): void {
-  const state = getState(chart);
-  if (state.dragStart) {
-    state.dragging = true;
-    state.dragEnd = event as MouseEvent;
-    updateChart(chart, 'none');
-  }
-}
+function mouseMove(chart: Chart, event: Event): void {}
 function keyDown(chart: Chart, event: Event): void {
   const state = getState(chart);
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys drawDragOverlay: falls back to the real default background color when none is configured
statusReason: expected undefined to be 'rgba(225,225,225,0.3)' // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:747:7
 }
 function mouseMove(chart: Chart, event: Event): void {
   const state = getState(chart);
-  if (state.dragStart) {
+  if (false) {
     state.dragging = true;
     state.dragEnd = event as MouseEvent;
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys drawDragOverlay: falls back to the real default background color when none is configured
statusReason: expected undefined to be 'rgba(225,225,225,0.3)' // Object.is equality

[Killed] BlockStatement
src/zoomPlugin.ts:747:24
 }
 function mouseMove(chart: Chart, event: Event): void {
   const state = getState(chart);
-  if (state.dragStart) {
-    state.dragging = true;
-    state.dragEnd = event as MouseEvent;
-    updateChart(chart, 'none');
-  }
+  if (state.dragStart) {}
 }
 function keyDown(chart: Chart, event: Event): void {
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys drawDragOverlay: falls back to the real default background color when none is configured
statusReason: expected undefined to be 'rgba(225,225,225,0.3)' // Object.is equality

[Killed] BooleanLiteral
src/zoomPlugin.ts:748:22
 function mouseMove(chart: Chart, event: Event): void {
   const state = getState(chart);
   if (state.dragStart) {
-    state.dragging = true;
+    state.dragging = false;
     state.dragEnd = event as MouseEvent;
     updateChart(chart, 'none');
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys beforeEvent: suppresses a genuine "mouseup" event too during an active drag, not just "cl
statusReason: expected undefined to be false // Object.is equality

[Survived] StringLiteral
src/zoomPlugin.ts:750:24
   if (state.dragStart) {
     state.dragging = true;
     state.dragEnd = event as MouseEvent;
-    updateChart(chart, 'none');
+    updateChart(chart, "");
   }
 }

[Killed] BlockStatement
src/zoomPlugin.ts:753:52
     updateChart(chart, 'none');
   }
 }
-function keyDown(chart: Chart, event: Event): void {
-  const state = getState(chart);
-  const keyEvent = event as KeyboardEvent;
-  if (!state.dragStart || keyEvent.key !== 'Escape') return;
-  removeHandler(chart, 'keydown');
-  state.dragging = false;
-  state.dragStart = state.dragEnd = null;
-  updateChart(chart, 'none');
-}
+function keyDown(chart: Chart, event: Event): void {}
 function getPointPosition(event: MouseEvent, chart: Chart): ScreenPoint {
   // Restored from the original rather than a naive
killedBy: zoomPlugin drag-to-zoom-rectangle interaction cancels an in-progress drag when Escape is pressed
statusReason: expected 50 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:756:27
 function keyDown(chart: Chart, event: Event): void {
   const state = getState(chart);
   const keyEvent = event as KeyboardEvent;
-  if (!state.dragStart || keyEvent.key !== 'Escape') return;
+  if (!state.dragStart || false) return;
   removeHandler(chart, 'keydown');
   state.dragging = false;
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys keyDown: a key other than the exact string "Escape" does not cancel an in-progress drag
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] ConditionalExpression
src/zoomPlugin.ts:756:7
 function keyDown(chart: Chart, event: Event): void {
   const state = getState(chart);
   const keyEvent = event as KeyboardEvent;
-  if (!state.dragStart || keyEvent.key !== 'Escape') return;
+  if (false) return;
   removeHandler(chart, 'keydown');
   state.dragging = false;
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys keyDown: a key other than the exact string "Escape" does not cancel an in-progress drag
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Survived] StringLiteral
src/zoomPlugin.ts:757:24
   const state = getState(chart);
   const keyEvent = event as KeyboardEvent;
   if (!state.dragStart || keyEvent.key !== 'Escape') return;
-  removeHandler(chart, 'keydown');
+  removeHandler(chart, "");
   state.dragging = false;
   state.dragStart = state.dragEnd = null;

[Survived] BooleanLiteral
src/zoomPlugin.ts:758:20
   const keyEvent = event as KeyboardEvent;
   if (!state.dragStart || keyEvent.key !== 'Escape') return;
   removeHandler(chart, 'keydown');
-  state.dragging = false;
+  state.dragging = true;
   state.dragStart = state.dragEnd = null;
   updateChart(chart, 'none');

[Survived] StringLiteral
src/zoomPlugin.ts:760:22
   removeHandler(chart, 'keydown');
   state.dragging = false;
   state.dragStart = state.dragEnd = null;
-  updateChart(chart, 'none');
+  updateChart(chart, "");
 }
 function getPointPosition(event: MouseEvent, chart: Chart): ScreenPoint {

[Killed] BlockStatement
src/zoomPlugin.ts:762:73
   state.dragStart = state.dragEnd = null;
   updateChart(chart, 'none');
 }
-function getPointPosition(event: MouseEvent, chart: Chart): ScreenPoint {
-  // Restored from the original rather than a naive
-  // getBoundingClientRect()-only computation: Chart.js's own
-  // `getRelativePosition` accounts for CSS transforms/scaling and
-  // border-box sizing on the canvas that a bare bounding-rect diff
-  // would silently get wrong under those conditions. Confirmed real,
-  // not a guess: this is the original plugin's own exact logic for the
-  // "is this event actually targeting the canvas" branch.
-  if (event.target !== chart.canvas) {
-    const canvasArea = chart.canvas.getBoundingClientRect();
-    return { x: event.clientX - canvasArea.left, y: event.clientY - canvasArea.top };
-  }
-  return getRelativePosition(event, chart);
-}
+function getPointPosition(event: MouseEvent, chart: Chart): ScreenPoint {}
 function zoomStart(chart: Chart, event: MouseEvent, zoomOptions: NonNullable<ZoomPluginOptions['zoom']>): boolean {
   const { onZoomStart, onZoomRejected } = zoomOptions;
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] ConditionalExpression
src/zoomPlugin.ts:770:7
   // would silently get wrong under those conditions. Confirmed real,
   // not a guess: this is the original plugin's own exact logic for the
   // "is this event actually targeting the canvas" branch.
-  if (event.target !== chart.canvas) {
+  if (true) {
     const canvasArea = chart.canvas.getBoundingClientRect();
     return { x: event.clientX - canvasArea.left, y: event.clientY - canvasArea.top };
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys getPointPosition: falls back to getBoundingClientRect-based math when the event does not 
statusReason: expected 20 to be close to 50, received difference is 30, but expected 0.000005

[Killed] BlockStatement
src/zoomPlugin.ts:770:38
   // would silently get wrong under those conditions. Confirmed real,
   // not a guess: this is the original plugin's own exact logic for the
   // "is this event actually targeting the canvas" branch.
-  if (event.target !== chart.canvas) {
-    const canvasArea = chart.canvas.getBoundingClientRect();
-    return { x: event.clientX - canvasArea.left, y: event.clientY - canvasArea.top };
-  }
+  if (event.target !== chart.canvas) {}
   return getRelativePosition(event, chart);
 }
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys getPointPosition: falls back to getBoundingClientRect-based math when the event does not 
statusReason: expected 350 to be close to 320, received difference is 30, but expected 0.000005

[Killed] ArithmeticOperator
src/zoomPlugin.ts:772:17
   // "is this event actually targeting the canvas" branch.
   if (event.target !== chart.canvas) {
     const canvasArea = chart.canvas.getBoundingClientRect();
-    return { x: event.clientX - canvasArea.left, y: event.clientY - canvasArea.top };
+    return { x: event.clientX + canvasArea.left, y: event.clientY - canvasArea.top };
   }
   return getRelativePosition(event, chart);
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys getPointPosition: falls back to getBoundingClientRect-based math when the event does not 
statusReason: expected 380 to be close to 320, received difference is 60, but expected 0.000005

[Survived] ArithmeticOperator
src/zoomPlugin.ts:772:53
   // "is this event actually targeting the canvas" branch.
   if (event.target !== chart.canvas) {
     const canvasArea = chart.canvas.getBoundingClientRect();
-    return { x: event.clientX - canvasArea.left, y: event.clientY - canvasArea.top };
+    return { x: event.clientX - canvasArea.left, y: event.clientY + canvasArea.top };
   }
   return getRelativePosition(event, chart);

[Killed] BlockStatement
src/zoomPlugin.ts:776:115
   }
   return getRelativePosition(event, chart);
 }
-function zoomStart(chart: Chart, event: MouseEvent, zoomOptions: NonNullable<ZoomPluginOptions['zoom']>): boolean {
-  const { onZoomStart, onZoomRejected } = zoomOptions;
-  if (onZoomStart) {
-    const point = getPointPosition(event, chart);
-    if (invoke(onZoomStart, [{ chart, event, point }]) === false) {
-      invoke(onZoomRejected, [{ chart, event }]);
-      return false;
-    }
-  }
-  return true;
-}
+function zoomStart(chart: Chart, event: MouseEvent, zoomOptions: NonNullable<ZoomPluginOptions['zoom']>): boolean {}
 function mouseDown(chart: Chart, event: Event): void {
   const mouseEvent = event as MouseEvent;
killedBy: zoomPlugin wheel-zoom interaction zooms in on a real wheel event when wheel.enabled is true
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/zoomPlugin.ts:778:20
 }
 function zoomStart(chart: Chart, event: MouseEvent, zoomOptions: NonNullable<ZoomPluginOptions['zoom']>): boolean {
   const { onZoomStart, onZoomRejected } = zoomOptions;
-  if (onZoomStart) {
-    const point = getPointPosition(event, chart);
-    if (invoke(onZoomStart, [{ chart, event, point }]) === false) {
-      invoke(onZoomRejected, [{ chart, event }]);
-      return false;
-    }
-  }
+  if (onZoomStart) {}
   return true;
 }
killedBy: zoomPlugin wheel-zoom interaction calls onZoomStart, and aborts the zoom (calling onZoomRejected instead) when it returns false
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/zoomPlugin.ts:778:7
 }
 function zoomStart(chart: Chart, event: MouseEvent, zoomOptions: NonNullable<ZoomPluginOptions['zoom']>): boolean {
   const { onZoomStart, onZoomRejected } = zoomOptions;
-  if (onZoomStart) {
+  if (false) {
     const point = getPointPosition(event, chart);
     if (invoke(onZoomStart, [{ chart, event, point }]) === false) {
killedBy: zoomPlugin wheel-zoom interaction calls onZoomStart, and aborts the zoom (calling onZoomRejected instead) when it returns false
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/zoomPlugin.ts:780:67
   const { onZoomStart, onZoomRejected } = zoomOptions;
   if (onZoomStart) {
     const point = getPointPosition(event, chart);
-    if (invoke(onZoomStart, [{ chart, event, point }]) === false) {
-      invoke(onZoomRejected, [{ chart, event }]);
-      return false;
-    }
+    if (invoke(onZoomStart, [{ chart, event, point }]) === false) {}
   }
   return true;
killedBy: zoomPlugin wheel-zoom interaction calls onZoomStart, and aborts the zoom (calling onZoomRejected instead) when it returns false
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/zoomPlugin.ts:780:9
   const { onZoomStart, onZoomRejected } = zoomOptions;
   if (onZoomStart) {
     const point = getPointPosition(event, chart);
-    if (invoke(onZoomStart, [{ chart, event, point }]) === false) {
+    if (invoke(onZoomStart, [{
+  chart,
+  event,
+  point
+}]) !== false) {
       invoke(onZoomRejected, [{ chart, event }]);
       return false;
killedBy: zoomPlugin wheel-zoom interaction calls onZoomStart, and aborts the zoom (calling onZoomRejected instead) when it returns false
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] ObjectLiteral
src/zoomPlugin.ts:781:31
   if (onZoomStart) {
     const point = getPointPosition(event, chart);
     if (invoke(onZoomStart, [{ chart, event, point }]) === false) {
-      invoke(onZoomRejected, [{ chart, event }]);
+      invoke(onZoomRejected, [{}]);
       return false;
     }

[Killed] BooleanLiteral
src/zoomPlugin.ts:782:14
     const point = getPointPosition(event, chart);
     if (invoke(onZoomStart, [{ chart, event, point }]) === false) {
       invoke(onZoomRejected, [{ chart, event }]);
-      return false;
+      return true;
     }
   }
killedBy: zoomPlugin wheel-zoom interaction calls onZoomStart, and aborts the zoom (calling onZoomRejected instead) when it returns false
statusReason: expected NaN to be undefined
