[Killed] BlockStatement
src/zoomPlugin.ts:787:54
   }
   return true;
 }
-function mouseDown(chart: Chart, event: Event): void {
-  const mouseEvent = event as MouseEvent;
-  if (chart.legend) {
-    const point = getRelativePosition(mouseEvent, chart);
-    // _isPointInArea's own Point parameter allows nullable x/y (for
-    // missing data points) — getRelativePosition's own real return
-    // shape is always non-null, so this widens safely with no cast
-    // needed.
-    if (_isPointInArea(point, chart.legend as unknown as ChartArea)) return;
-  }
-  const state = getState(chart);
-  const { pan: panOptions, zoom: zoomOptions = {} } = state.options;
-  if (
-    mouseEvent.button !== 0 ||
-    keyPressed(getModifierKey(panOptions), mouseEvent) ||
-    keyNotPressed(getModifierKey(zoomOptions.drag), mouseEvent)
-  ) {
-    invoke(zoomOptions.onZoomRejected, [{ chart, event }]);
-    return;
-  }
-  if (!zoomStart(chart, mouseEvent, zoomOptions)) return;
-  state.dragStart = mouseEvent;
-  addHandler(chart, chart.canvas.ownerDocument, 'mousemove', mouseMove);
-  addHandler(chart, window.document, 'keydown', keyDown);
-}
+function mouseDown(chart: Chart, event: Event): void {}
 function applyAspectRatio(points: { begin: ScreenPoint; end: ScreenPoint }, aspectRatio: number): void {
   let width = points.end.x - points.begin.x;
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] ConditionalExpression
src/zoomPlugin.ts:789:7
 }
 function mouseDown(chart: Chart, event: Event): void {
   const mouseEvent = event as MouseEvent;
-  if (chart.legend) {
+  if (true) {
     const point = getRelativePosition(mouseEvent, chart);
     // _isPointInArea's own Point parameter allows nullable x/y (for
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] ConditionalExpression
src/zoomPlugin.ts:789:7
 }
 function mouseDown(chart: Chart, event: Event): void {
   const mouseEvent = event as MouseEvent;
-  if (chart.legend) {
+  if (false) {
     const point = getRelativePosition(mouseEvent, chart);
     // _isPointInArea's own Point parameter allows nullable x/y (for
killedBy: zoomPlugin drag-to-zoom-rectangle interaction does not start a drag when mousedown targets the legend area
statusReason: expected 100 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:795:9
     // missing data points) — getRelativePosition's own real return
     // shape is always non-null, so this widens safely with no cast
     // needed.
-    if (_isPointInArea(point, chart.legend as unknown as ChartArea)) return;
+    if (false) return;
   }
   const state = getState(chart);
killedBy: zoomPlugin drag-to-zoom-rectangle interaction does not start a drag when mousedown targets the legend area
statusReason: expected 100 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:795:9
     // missing data points) — getRelativePosition's own real return
     // shape is always non-null, so this widens safely with no cast
     // needed.
-    if (_isPointInArea(point, chart.legend as unknown as ChartArea)) return;
+    if (true) return;
   }
   const state = getState(chart);
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys mouseDown: a point one pixel below the legend area does start a drag (the exclusive side 
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:800:5
   const state = getState(chart);
   const { pan: panOptions, zoom: zoomOptions = {} } = state.options;
   if (
-    mouseEvent.button !== 0 ||
-    keyPressed(getModifierKey(panOptions), mouseEvent) ||
-    keyNotPressed(getModifierKey(zoomOptions.drag), mouseEvent)
+    false
   ) {
     invoke(zoomOptions.onZoomRejected, [{ chart, event }]);
killedBy: zoomPlugin drag-to-zoom-rectangle interaction does not start a drag-to-zoom when a required drag modifier key is not held
statusReason: expected 50 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:800:5
   const state = getState(chart);
   const { pan: panOptions, zoom: zoomOptions = {} } = state.options;
   if (
-    mouseEvent.button !== 0 ||
-    keyPressed(getModifierKey(panOptions), mouseEvent) ||
+    false ||
     keyNotPressed(getModifierKey(zoomOptions.drag), mouseEvent)
   ) {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction rejects a drag-to-zoom start when the pan modifier key is held (pan takes priority over drag-zoom)
statusReason: expected 50 to be undefined

[Killed] BlockStatement
src/zoomPlugin.ts:803:5
     mouseEvent.button !== 0 ||
     keyPressed(getModifierKey(panOptions), mouseEvent) ||
     keyNotPressed(getModifierKey(zoomOptions.drag), mouseEvent)
-  ) {
-    invoke(zoomOptions.onZoomRejected, [{ chart, event }]);
-    return;
-  }
+  ) {}
   if (!zoomStart(chart, mouseEvent, zoomOptions)) return;
   state.dragStart = mouseEvent;
killedBy: zoomPlugin drag-to-zoom-rectangle interaction does not start a drag-to-zoom when a required drag modifier key is not held
statusReason: expected 50 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:807:7
     invoke(zoomOptions.onZoomRejected, [{ chart, event }]);
     return;
   }
-  if (!zoomStart(chart, mouseEvent, zoomOptions)) return;
+  if (true) return;
   state.dragStart = mouseEvent;
   addHandler(chart, chart.canvas.ownerDocument, 'mousemove', mouseMove);
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] ConditionalExpression
src/zoomPlugin.ts:807:7
     invoke(zoomOptions.onZoomRejected, [{ chart, event }]);
     return;
   }
-  if (!zoomStart(chart, mouseEvent, zoomOptions)) return;
+  if (false) return;
   state.dragStart = mouseEvent;
   addHandler(chart, chart.canvas.ownerDocument, 'mousemove', mouseMove);
killedBy: zoomPlugin drag-to-zoom-rectangle interaction aborts a drag-to-zoom start when onZoomStart returns false (mouseDown's own zoomStart-rejected branch, not just wheel's)
statusReason: expected "spy" to be called at least once

[Killed] BlockStatement
src/zoomPlugin.ts:812:104
   addHandler(chart, chart.canvas.ownerDocument, 'mousemove', mouseMove);
   addHandler(chart, window.document, 'keydown', keyDown);
 }
-function applyAspectRatio(points: { begin: ScreenPoint; end: ScreenPoint }, aspectRatio: number): void {
-  let width = points.end.x - points.begin.x;
-  let height = points.end.y - points.begin.y;
-  const ratio = Math.abs(width / height);
-  if (ratio > aspectRatio) {
-    width = Math.sign(width) * Math.abs(height * aspectRatio);
-  } else if (ratio < aspectRatio) {
-    height = Math.sign(height) * Math.abs(width / aspectRatio);
-  }
-  points.end.x = points.begin.x + width;
-  points.end.y = points.begin.y + height;
-}
+function applyAspectRatio(points: { begin: ScreenPoint; end: ScreenPoint }, aspectRatio: number): void {}
 function applyMinMaxProps(
   rect: Record<string, number>,
killedBy: zoomPlugin drag-to-zoom-rectangle interaction applies drag-to-zoom with maintainAspectRatio, constraining the drag rectangle to the chart area's own aspect ratio
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/zoomPlugin.ts:813:15
   addHandler(chart, window.document, 'keydown', keyDown);
 }
 function applyAspectRatio(points: { begin: ScreenPoint; end: ScreenPoint }, aspectRatio: number): void {
-  let width = points.end.x - points.begin.x;
+  let width = points.end.x + points.begin.x;
   let height = points.end.y - points.begin.y;
   const ratio = Math.abs(width / height);

[Survived] ArithmeticOperator
src/zoomPlugin.ts:814:16
 }
 function applyAspectRatio(points: { begin: ScreenPoint; end: ScreenPoint }, aspectRatio: number): void {
   let width = points.end.x - points.begin.x;
-  let height = points.end.y - points.begin.y;
+  let height = points.end.y + points.begin.y;
   const ratio = Math.abs(width / height);
   if (ratio > aspectRatio) {

[Killed] ArithmeticOperator
src/zoomPlugin.ts:815:26
 function applyAspectRatio(points: { begin: ScreenPoint; end: ScreenPoint }, aspectRatio: number): void {
   let width = points.end.x - points.begin.x;
   let height = points.end.y - points.begin.y;
-  const ratio = Math.abs(width / height);
+  const ratio = Math.abs(width * height);
   if (ratio > aspectRatio) {
     width = Math.sign(width) * Math.abs(height * aspectRatio);
killedBy: zoomPlugin drag-to-zoom-rectangle interaction applies drag-to-zoom with maintainAspectRatio the other way (ratio < aspectRatio, adjusting height instead of width)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/zoomPlugin.ts:816:7
   let width = points.end.x - points.begin.x;
   let height = points.end.y - points.begin.y;
   const ratio = Math.abs(width / height);
-  if (ratio > aspectRatio) {
+  if (ratio <= aspectRatio) {
     width = Math.sign(width) * Math.abs(height * aspectRatio);
   } else if (ratio < aspectRatio) {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction applies drag-to-zoom with maintainAspectRatio, constraining the drag rectangle to the chart area's own aspect ratio
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/zoomPlugin.ts:816:28
   let width = points.end.x - points.begin.x;
   let height = points.end.y - points.begin.y;
   const ratio = Math.abs(width / height);
-  if (ratio > aspectRatio) {
-    width = Math.sign(width) * Math.abs(height * aspectRatio);
-  } else if (ratio < aspectRatio) {
+  if (ratio > aspectRatio) {} else if (ratio < aspectRatio) {
     height = Math.sign(height) * Math.abs(width / aspectRatio);
   }
killedBy: zoomPlugin drag-to-zoom-rectangle interaction applies drag-to-zoom with maintainAspectRatio, constraining the drag rectangle to the chart area's own aspect ratio
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/zoomPlugin.ts:817:41
   let height = points.end.y - points.begin.y;
   const ratio = Math.abs(width / height);
   if (ratio > aspectRatio) {
-    width = Math.sign(width) * Math.abs(height * aspectRatio);
+    width = Math.sign(width) * Math.abs(height / aspectRatio);
   } else if (ratio < aspectRatio) {
     height = Math.sign(height) * Math.abs(width / aspectRatio);

[Survived] ArithmeticOperator
src/zoomPlugin.ts:817:13
   let height = points.end.y - points.begin.y;
   const ratio = Math.abs(width / height);
   if (ratio > aspectRatio) {
-    width = Math.sign(width) * Math.abs(height * aspectRatio);
+    width = Math.sign(width) / Math.abs(height * aspectRatio);
   } else if (ratio < aspectRatio) {
     height = Math.sign(height) * Math.abs(width / aspectRatio);

[Killed] ConditionalExpression
src/zoomPlugin.ts:818:14
   const ratio = Math.abs(width / height);
   if (ratio > aspectRatio) {
     width = Math.sign(width) * Math.abs(height * aspectRatio);
-  } else if (ratio < aspectRatio) {
+  } else if (false) {
     height = Math.sign(height) * Math.abs(width / aspectRatio);
   }
killedBy: zoomPlugin drag-to-zoom-rectangle interaction applies drag-to-zoom with maintainAspectRatio the other way (ratio < aspectRatio, adjusting height instead of width)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/zoomPlugin.ts:818:35
   const ratio = Math.abs(width / height);
   if (ratio > aspectRatio) {
     width = Math.sign(width) * Math.abs(height * aspectRatio);
-  } else if (ratio < aspectRatio) {
-    height = Math.sign(height) * Math.abs(width / aspectRatio);
-  }
+  } else if (ratio < aspectRatio) {}
   points.end.x = points.begin.x + width;
   points.end.y = points.begin.y + height;
killedBy: zoomPlugin drag-to-zoom-rectangle interaction applies drag-to-zoom with maintainAspectRatio the other way (ratio < aspectRatio, adjusting height instead of width)
statusReason: expected false to be true // Object.is equality

[Survived] ArithmeticOperator
src/zoomPlugin.ts:819:14
   if (ratio > aspectRatio) {
     width = Math.sign(width) * Math.abs(height * aspectRatio);
   } else if (ratio < aspectRatio) {
-    height = Math.sign(height) * Math.abs(width / aspectRatio);
+    height = Math.sign(height) / Math.abs(width / aspectRatio);
   }
   points.end.x = points.begin.x + width;

[Survived] ArithmeticOperator
src/zoomPlugin.ts:819:43
   if (ratio > aspectRatio) {
     width = Math.sign(width) * Math.abs(height * aspectRatio);
   } else if (ratio < aspectRatio) {
-    height = Math.sign(height) * Math.abs(width / aspectRatio);
+    height = Math.sign(height) * Math.abs(width * aspectRatio);
   }
   points.end.x = points.begin.x + width;

[Killed] ArithmeticOperator
src/zoomPlugin.ts:821:18
   } else if (ratio < aspectRatio) {
     height = Math.sign(height) * Math.abs(width / aspectRatio);
   }
-  points.end.x = points.begin.x + width;
+  points.end.x = points.begin.x - width;
   points.end.y = points.begin.y + height;
 }
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) applyAspectRatio: a drag whose ratio exactly matches the chart area's own aspect ratio take
statusReason: expected +0 to be close to 50, received difference is 50, but expected 0.000005

[Survived] ArithmeticOperator
src/zoomPlugin.ts:822:18
     height = Math.sign(height) * Math.abs(width / aspectRatio);
   }
   points.end.x = points.begin.x + width;
-  points.end.y = points.begin.y + height;
+  points.end.y = points.begin.y - height;
 }
 function applyMinMaxProps(

[Killed] BlockStatement
src/zoomPlugin.ts:829:9
   chartArea: ChartArea,
   points: { begin: ScreenPoint; end: ScreenPoint },
   spec: { min: 'left' | 'top'; max: 'right' | 'bottom'; prop: 'x' | 'y' },
-): void {
-  const areaRecord = chartArea as unknown as Record<string, number>;
-  rect[spec.min] = clamp(Math.min(points.begin[spec.prop], points.end[spec.prop]), areaRecord[spec.min], areaRecord[spec.max]);
-  rect[spec.max] = clamp(Math.max(points.begin[spec.prop], points.end[spec.prop]), areaRecord[spec.min], areaRecord[spec.max]);
-}
+): void {}
 function getRelativePoints(chart: Chart, pointEvents: { dragStart: MouseEvent; dragEnd: MouseEvent }, maintainAspectRatio: boolean): { begin: ScreenPoint; end: ScreenPoint } {
   const points = {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected +0 to be close to 50, received difference is 50, but expected 0.000005

[Killed] MethodExpression
src/zoomPlugin.ts:831:26
   spec: { min: 'left' | 'top'; max: 'right' | 'bottom'; prop: 'x' | 'y' },
 ): void {
   const areaRecord = chartArea as unknown as Record<string, number>;
-  rect[spec.min] = clamp(Math.min(points.begin[spec.prop], points.end[spec.prop]), areaRecord[spec.min], areaRecord[spec.max]);
+  rect[spec.min] = clamp(Math.max(points.begin[spec.prop], points.end[spec.prop]), areaRecord[spec.min], areaRecord[spec.max]);
   rect[spec.max] = clamp(Math.max(points.begin[spec.prop], points.end[spec.prop]), areaRecord[spec.min], areaRecord[spec.max]);
 }
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] MethodExpression
src/zoomPlugin.ts:832:26
 ): void {
   const areaRecord = chartArea as unknown as Record<string, number>;
   rect[spec.min] = clamp(Math.min(points.begin[spec.prop], points.end[spec.prop]), areaRecord[spec.min], areaRecord[spec.max]);
-  rect[spec.max] = clamp(Math.max(points.begin[spec.prop], points.end[spec.prop]), areaRecord[spec.min], areaRecord[spec.max]);
+  rect[spec.max] = clamp(Math.min(points.begin[spec.prop], points.end[spec.prop]), areaRecord[spec.min], areaRecord[spec.max]);
 }
 function getRelativePoints(chart: Chart, pointEvents: { dragStart: MouseEvent; dragEnd: MouseEvent }, maintainAspectRatio: boolean): { begin: ScreenPoint; end: ScreenPoint } {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] BlockStatement
src/zoomPlugin.ts:834:175
   rect[spec.min] = clamp(Math.min(points.begin[spec.prop], points.end[spec.prop]), areaRecord[spec.min], areaRecord[spec.max]);
   rect[spec.max] = clamp(Math.max(points.begin[spec.prop], points.end[spec.prop]), areaRecord[spec.min], areaRecord[spec.max]);
 }
-function getRelativePoints(chart: Chart, pointEvents: { dragStart: MouseEvent; dragEnd: MouseEvent }, maintainAspectRatio: boolean): { begin: ScreenPoint; end: ScreenPoint } {
-  const points = {
-    begin: getPointPosition(pointEvents.dragStart, chart),
-    end: getPointPosition(pointEvents.dragEnd, chart),
-  };
-  if (maintainAspectRatio) {
-    const aspectRatio = chart.chartArea.width / chart.chartArea.height;
-    applyAspectRatio(points, aspectRatio);
-  }
-  return points;
-}
+function getRelativePoints(chart: Chart, pointEvents: { dragStart: MouseEvent; dragEnd: MouseEvent }, maintainAspectRatio: boolean): { begin: ScreenPoint; end: ScreenPoint } {}
 interface DragRect {
   top: number;
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] ConditionalExpression
src/zoomPlugin.ts:839:7
     begin: getPointPosition(pointEvents.dragStart, chart),
     end: getPointPosition(pointEvents.dragEnd, chart),
   };
-  if (maintainAspectRatio) {
+  if (false) {
     const aspectRatio = chart.chartArea.width / chart.chartArea.height;
     applyAspectRatio(points, aspectRatio);
killedBy: zoomPlugin drag-to-zoom-rectangle interaction applies drag-to-zoom with maintainAspectRatio, constraining the drag rectangle to the chart area's own aspect ratio
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:839:7
     begin: getPointPosition(pointEvents.dragStart, chart),
     end: getPointPosition(pointEvents.dragEnd, chart),
   };
-  if (maintainAspectRatio) {
+  if (true) {
     const aspectRatio = chart.chartArea.width / chart.chartArea.height;
     applyAspectRatio(points, aspectRatio);
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms using only the y distance when mode is y-only (the distanceY branch, not just distanceX)
statusReason: expected 200 to be close to 250, received difference is 50, but expected 0.000005

[Killed] ArithmeticOperator
src/zoomPlugin.ts:840:25
     end: getPointPosition(pointEvents.dragEnd, chart),
   };
   if (maintainAspectRatio) {
-    const aspectRatio = chart.chartArea.width / chart.chartArea.height;
+    const aspectRatio = chart.chartArea.width * chart.chartArea.height;
     applyAspectRatio(points, aspectRatio);
   }
killedBy: zoomPlugin drag-to-zoom-rectangle interaction applies drag-to-zoom with maintainAspectRatio, constraining the drag rectangle to the chart area's own aspect ratio
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/zoomPlugin.ts:860:13
   mode: ZoomMode | undefined,
   pointEvents: { dragStart: MouseEvent; dragEnd: MouseEvent },
   maintainAspectRatio: boolean | undefined,
-): DragRect {
-  const xEnabled = directionEnabled(mode, 'x', chart);
-  const yEnabled = directionEnabled(mode, 'y', chart);
-  const { top, left, right, bottom, width: chartWidth, height: chartHeight } = chart.chartArea;
-  const rect: Record<string, number> = { top, left, right, bottom };
-  const points = getRelativePoints(chart, pointEvents, !!(maintainAspectRatio && xEnabled && yEnabled));
-  if (xEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'left', max: 'right', prop: 'x' });
-  if (yEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'top', max: 'bottom', prop: 'y' });
-  const width = rect.right - rect.left;
-  const height = rect.bottom - rect.top;
-  return {
-    top: rect.top,
-    left: rect.left,
-    right: rect.right,
-    bottom: rect.bottom,
-    width,
-    height,
-    zoomX: xEnabled && width ? 1 + (chartWidth - width) / chartWidth : 1,
-    zoomY: yEnabled && height ? 1 + (chartHeight - height) / chartHeight : 1,
-  };
-}
+): DragRect {}
 function mouseUp(chart: Chart, event: Event): void {
   const state = getState(chart);
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] LogicalOperator
src/zoomPlugin.ts:865:59
   const yEnabled = directionEnabled(mode, 'y', chart);
   const { top, left, right, bottom, width: chartWidth, height: chartHeight } = chart.chartArea;
   const rect: Record<string, number> = { top, left, right, bottom };
-  const points = getRelativePoints(chart, pointEvents, !!(maintainAspectRatio && xEnabled && yEnabled));
+  const points = getRelativePoints(chart, pointEvents, !!(maintainAspectRatio && xEnabled || yEnabled));
   if (xEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'left', max: 'right', prop: 'x' });
   if (yEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'top', max: 'bottom', prop: 'y' });
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms using only the y distance when mode is y-only (the distanceY branch, not just distanceX)
statusReason: expected 200 to be close to 250, received difference is 50, but expected 0.000005

[Killed] BooleanLiteral
src/zoomPlugin.ts:865:56
   const yEnabled = directionEnabled(mode, 'y', chart);
   const { top, left, right, bottom, width: chartWidth, height: chartHeight } = chart.chartArea;
   const rect: Record<string, number> = { top, left, right, bottom };
-  const points = getRelativePoints(chart, pointEvents, !!(maintainAspectRatio && xEnabled && yEnabled));
+  const points = getRelativePoints(chart, pointEvents, !(maintainAspectRatio && xEnabled && yEnabled));
   if (xEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'left', max: 'right', prop: 'x' });
   if (yEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'top', max: 'bottom', prop: 'y' });
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms using only the y distance when mode is y-only (the distanceY branch, not just distanceX)
statusReason: expected 200 to be close to 250, received difference is 50, but expected 0.000005

[Killed] ConditionalExpression
src/zoomPlugin.ts:866:7
   const { top, left, right, bottom, width: chartWidth, height: chartHeight } = chart.chartArea;
   const rect: Record<string, number> = { top, left, right, bottom };
   const points = getRelativePoints(chart, pointEvents, !!(maintainAspectRatio && xEnabled && yEnabled));
-  if (xEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'left', max: 'right', prop: 'x' });
+  if (false) applyMinMaxProps(rect, chart.chartArea, points, { min: 'left', max: 'right', prop: 'x' });
   if (yEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'top', max: 'bottom', prop: 'y' });
   const width = rect.right - rect.left;
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected +0 to be close to 50, received difference is 50, but expected 0.000005

[Survived] ConditionalExpression
src/zoomPlugin.ts:866:7
   const { top, left, right, bottom, width: chartWidth, height: chartHeight } = chart.chartArea;
   const rect: Record<string, number> = { top, left, right, bottom };
   const points = getRelativePoints(chart, pointEvents, !!(maintainAspectRatio && xEnabled && yEnabled));
-  if (xEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'left', max: 'right', prop: 'x' });
+  if (true) applyMinMaxProps(rect, chart.chartArea, points, { min: 'left', max: 'right', prop: 'x' });
   if (yEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'top', max: 'bottom', prop: 'y' });
   const width = rect.right - rect.left;

[Killed] ConditionalExpression
src/zoomPlugin.ts:867:7
   const rect: Record<string, number> = { top, left, right, bottom };
   const points = getRelativePoints(chart, pointEvents, !!(maintainAspectRatio && xEnabled && yEnabled));
   if (xEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'left', max: 'right', prop: 'x' });
-  if (yEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'top', max: 'bottom', prop: 'y' });
+  if (false) applyMinMaxProps(rect, chart.chartArea, points, { min: 'top', max: 'bottom', prop: 'y' });
   const width = rect.right - rect.left;
   const height = rect.bottom - rect.top;
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms using only the y distance when mode is y-only (the distanceY branch, not just distanceX)
statusReason: expected +0 to be close to 50, received difference is 50, but expected 0.000005

[Survived] ConditionalExpression
src/zoomPlugin.ts:867:7
   const rect: Record<string, number> = { top, left, right, bottom };
   const points = getRelativePoints(chart, pointEvents, !!(maintainAspectRatio && xEnabled && yEnabled));
   if (xEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'left', max: 'right', prop: 'x' });
-  if (yEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'top', max: 'bottom', prop: 'y' });
+  if (true) applyMinMaxProps(rect, chart.chartArea, points, { min: 'top', max: 'bottom', prop: 'y' });
   const width = rect.right - rect.left;
   const height = rect.bottom - rect.top;

[Killed] ArithmeticOperator
src/zoomPlugin.ts:868:17
   const points = getRelativePoints(chart, pointEvents, !!(maintainAspectRatio && xEnabled && yEnabled));
   if (xEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'left', max: 'right', prop: 'x' });
   if (yEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'top', max: 'bottom', prop: 'y' });
-  const width = rect.right - rect.left;
+  const width = rect.right + rect.left;
   const height = rect.bottom - rect.top;
   return {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction does not zoom when the drag distance stays under the configured threshold
statusReason: expected 50 to be undefined

[Killed] ArithmeticOperator
src/zoomPlugin.ts:869:18
   if (xEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'left', max: 'right', prop: 'x' });
   if (yEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'top', max: 'bottom', prop: 'y' });
   const width = rect.right - rect.left;
-  const height = rect.bottom - rect.top;
+  const height = rect.bottom + rect.top;
   return {
     top: rect.top,
killedBy: zoomPlugin drag-to-zoom-rectangle interaction does not zoom when the drag distance stays under the configured threshold
statusReason: expected 50 to be undefined

[Killed] ObjectLiteral
src/zoomPlugin.ts:870:10
   if (yEnabled) applyMinMaxProps(rect, chart.chartArea, points, { min: 'top', max: 'bottom', prop: 'y' });
   const width = rect.right - rect.left;
   const height = rect.bottom - rect.top;
-  return {
-    top: rect.top,
-    left: rect.left,
-    right: rect.right,
-    bottom: rect.bottom,
-    width,
-    height,
-    zoomX: xEnabled && width ? 1 + (chartWidth - width) / chartWidth : 1,
-    zoomY: yEnabled && height ? 1 + (chartHeight - height) / chartHeight : 1,
-  };
+  return {};
 }
 function mouseUp(chart: Chart, event: Event): void {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected NaN to be close to 50, received difference is NaN, but expected 0.000005

[Survived] ConditionalExpression
src/zoomPlugin.ts:877:12
     bottom: rect.bottom,
     width,
     height,
-    zoomX: xEnabled && width ? 1 + (chartWidth - width) / chartWidth : 1,
+    zoomX: false ? 1 + (chartWidth - width) / chartWidth : 1,
     zoomY: yEnabled && height ? 1 + (chartHeight - height) / chartHeight : 1,
   };

[Survived] ArithmeticOperator
src/zoomPlugin.ts:877:36
     bottom: rect.bottom,
     width,
     height,
-    zoomX: xEnabled && width ? 1 + (chartWidth - width) / chartWidth : 1,
+    zoomX: xEnabled && width ? 1 + (chartWidth - width) * chartWidth : 1,
     zoomY: yEnabled && height ? 1 + (chartHeight - height) / chartHeight : 1,
   };

[Survived] ArithmeticOperator
src/zoomPlugin.ts:878:37
     width,
     height,
     zoomX: xEnabled && width ? 1 + (chartWidth - width) / chartWidth : 1,
-    zoomY: yEnabled && height ? 1 + (chartHeight - height) / chartHeight : 1,
+    zoomY: yEnabled && height ? 1 + (chartHeight - height) * chartHeight : 1,
   };
 }

[Survived] ConditionalExpression
src/zoomPlugin.ts:878:12
     width,
     height,
     zoomX: xEnabled && width ? 1 + (chartWidth - width) / chartWidth : 1,
-    zoomY: yEnabled && height ? 1 + (chartHeight - height) / chartHeight : 1,
+    zoomY: false ? 1 + (chartHeight - height) / chartHeight : 1,
   };
 }
