[Killed] BlockStatement
src/zoomPlugin.ts:881:52
     zoomY: yEnabled && height ? 1 + (chartHeight - height) / chartHeight : 1,
   };
 }
-function mouseUp(chart: Chart, event: Event): void {
-  const state = getState(chart);
-  if (!state.dragStart) return;
-  removeHandler(chart, 'mousemove');
-  const zoomOptions = state.options.zoom!;
-  const mode = zoomOptions.mode;
-  const { threshold = 0, maintainAspectRatio } = zoomOptions.drag!;
-  const rect = computeDragRect(chart, mode, { dragStart: state.dragStart, dragEnd: event as MouseEvent }, maintainAspectRatio);
-  const distanceX = directionEnabled(mode, 'x', chart) ? rect.width : 0;
-  const distanceY = directionEnabled(mode, 'y', chart) ? rect.height : 0;
-  const distance = Math.sqrt(distanceX * distanceX + distanceY * distanceY);
-  state.dragStart = state.dragEnd = null;
-  if (distance <= threshold) {
-    state.dragging = false;
-    updateChart(chart, 'none');
-    return;
-  }
-  zoomRect(chart, { x: rect.left, y: rect.top }, { x: rect.right, y: rect.bottom }, 'zoom', 'drag');
-  state.dragging = false;
-  state.filterNextClick = true;
-  invoke(zoomOptions.onZoomComplete, [{ chart }]);
-}
+function mouseUp(chart: Chart, event: Event): void {}
 function wheelPreconditions(chart: Chart, event: WheelEvent, zoomOptions: NonNullable<ZoomPluginOptions['zoom']>): boolean {
   if (keyNotPressed(getModifierKey(zoomOptions.wheel), event)) {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] BooleanLiteral
src/zoomPlugin.ts:883:7
 }
 function mouseUp(chart: Chart, event: Event): void {
   const state = getState(chart);
-  if (!state.dragStart) return;
+  if (state.dragStart) return;
   removeHandler(chart, 'mousemove');
   const zoomOptions = state.options.zoom!;
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] ConditionalExpression
src/zoomPlugin.ts:883:7
 }
 function mouseUp(chart: Chart, event: Event): void {
   const state = getState(chart);
-  if (!state.dragStart) return;
+  if (true) return;
   removeHandler(chart, 'mousemove');
   const zoomOptions = state.options.zoom!;
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Survived] StringLiteral
src/zoomPlugin.ts:884:24
 function mouseUp(chart: Chart, event: Event): void {
   const state = getState(chart);
   if (!state.dragStart) return;
-  removeHandler(chart, 'mousemove');
+  removeHandler(chart, "");
   const zoomOptions = state.options.zoom!;
   const mode = zoomOptions.mode;

[Killed] ArithmeticOperator
src/zoomPlugin.ts:891:54
   const rect = computeDragRect(chart, mode, { dragStart: state.dragStart, dragEnd: event as MouseEvent }, maintainAspectRatio);
   const distanceX = directionEnabled(mode, 'x', chart) ? rect.width : 0;
   const distanceY = directionEnabled(mode, 'y', chart) ? rect.height : 0;
-  const distance = Math.sqrt(distanceX * distanceX + distanceY * distanceY);
+  const distance = Math.sqrt(distanceX * distanceX + distanceY / distanceY);
   state.dragStart = state.dragEnd = null;
   if (distance <= threshold) {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms using only the y distance when mode is y-only (the distanceY branch, not just distanceX)
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] ArithmeticOperator
src/zoomPlugin.ts:891:30
   const rect = computeDragRect(chart, mode, { dragStart: state.dragStart, dragEnd: event as MouseEvent }, maintainAspectRatio);
   const distanceX = directionEnabled(mode, 'x', chart) ? rect.width : 0;
   const distanceY = directionEnabled(mode, 'y', chart) ? rect.height : 0;
-  const distance = Math.sqrt(distanceX * distanceX + distanceY * distanceY);
+  const distance = Math.sqrt(distanceX * distanceX - distanceY * distanceY);
   state.dragStart = state.dragEnd = null;
   if (distance <= threshold) {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Killed] BlockStatement
src/zoomPlugin.ts:893:30
   const distanceY = directionEnabled(mode, 'y', chart) ? rect.height : 0;
   const distance = Math.sqrt(distanceX * distanceX + distanceY * distanceY);
   state.dragStart = state.dragEnd = null;
-  if (distance <= threshold) {
-    state.dragging = false;
-    updateChart(chart, 'none');
-    return;
-  }
+  if (distance <= threshold) {}
   zoomRect(chart, { x: rect.left, y: rect.top }, { x: rect.right, y: rect.bottom }, 'zoom', 'drag');
   state.dragging = false;
killedBy: zoomPlugin drag-to-zoom-rectangle interaction does not zoom when the drag distance stays under the configured threshold
statusReason: expected 50 to be undefined

[Killed] EqualityOperator
src/zoomPlugin.ts:893:7
   const distanceY = directionEnabled(mode, 'y', chart) ? rect.height : 0;
   const distance = Math.sqrt(distanceX * distanceX + distanceY * distanceY);
   state.dragStart = state.dragEnd = null;
-  if (distance <= threshold) {
+  if (distance > threshold) {
     state.dragging = false;
     updateChart(chart, 'none');
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Survived] BooleanLiteral
src/zoomPlugin.ts:894:22
   const distance = Math.sqrt(distanceX * distanceX + distanceY * distanceY);
   state.dragStart = state.dragEnd = null;
   if (distance <= threshold) {
-    state.dragging = false;
+    state.dragging = true;
     updateChart(chart, 'none');
     return;

[Killed] ObjectLiteral
src/zoomPlugin.ts:898:19
     updateChart(chart, 'none');
     return;
   }
-  zoomRect(chart, { x: rect.left, y: rect.top }, { x: rect.right, y: rect.bottom }, 'zoom', 'drag');
+  zoomRect(chart, {}, { x: rect.right, y: rect.bottom }, 'zoom', 'drag');
   state.dragging = false;
   state.filterNextClick = true;
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected NaN to be close to 50, received difference is NaN, but expected 0.000005

[Killed] BooleanLiteral
src/zoomPlugin.ts:899:20
     return;
   }
   zoomRect(chart, { x: rect.left, y: rect.top }, { x: rect.right, y: rect.bottom }, 'zoom', 'drag');
-  state.dragging = false;
+  state.dragging = true;
   state.filterNextClick = true;
   invoke(zoomOptions.onZoomComplete, [{ chart }]);
killedBy: zoomPlugin beforeEvent suppresses exactly the one click immediately following a completed drag-to-zoom, then stops suppressing
statusReason: expected false to be undefined

[Killed] BooleanLiteral
src/zoomPlugin.ts:900:27
   }
   zoomRect(chart, { x: rect.left, y: rect.top }, { x: rect.right, y: rect.bottom }, 'zoom', 'drag');
   state.dragging = false;
-  state.filterNextClick = true;
+  state.filterNextClick = false;
   invoke(zoomOptions.onZoomComplete, [{ chart }]);
 }
killedBy: zoomPlugin beforeEvent suppresses exactly the one click immediately following a completed drag-to-zoom, then stops suppressing
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/zoomPlugin.ts:903:124
   state.filterNextClick = true;
   invoke(zoomOptions.onZoomComplete, [{ chart }]);
 }
-function wheelPreconditions(chart: Chart, event: WheelEvent, zoomOptions: NonNullable<ZoomPluginOptions['zoom']>): boolean {
-  if (keyNotPressed(getModifierKey(zoomOptions.wheel), event)) {
-    invoke(zoomOptions.onZoomRejected, [{ chart, event }]);
-    return false;
-  }
-  if (!zoomStart(chart, event, zoomOptions)) return false;
-  if (event.cancelable) event.preventDefault();
-  return event.deltaY !== undefined;
-}
+function wheelPreconditions(chart: Chart, event: WheelEvent, zoomOptions: NonNullable<ZoomPluginOptions['zoom']>): boolean {}
 function wheel(chart: Chart, event: Event): void {
   const state = getState(chart);
killedBy: zoomPlugin wheel-zoom interaction zooms in on a real wheel event when wheel.enabled is true
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:904:7
   invoke(zoomOptions.onZoomComplete, [{ chart }]);
 }
 function wheelPreconditions(chart: Chart, event: WheelEvent, zoomOptions: NonNullable<ZoomPluginOptions['zoom']>): boolean {
-  if (keyNotPressed(getModifierKey(zoomOptions.wheel), event)) {
+  if (true) {
     invoke(zoomOptions.onZoomRejected, [{ chart, event }]);
     return false;
killedBy: zoomPlugin wheel-zoom interaction zooms in on a real wheel event when wheel.enabled is true
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/zoomPlugin.ts:904:64
   invoke(zoomOptions.onZoomComplete, [{ chart }]);
 }
 function wheelPreconditions(chart: Chart, event: WheelEvent, zoomOptions: NonNullable<ZoomPluginOptions['zoom']>): boolean {
-  if (keyNotPressed(getModifierKey(zoomOptions.wheel), event)) {
-    invoke(zoomOptions.onZoomRejected, [{ chart, event }]);
-    return false;
-  }
+  if (keyNotPressed(getModifierKey(zoomOptions.wheel), event)) {}
   if (!zoomStart(chart, event, zoomOptions)) return false;
   if (event.cancelable) event.preventDefault();
killedBy: zoomPlugin wheel-zoom interaction rejects the wheel zoom (and calls onZoomRejected) when a required wheel modifier key is not held
statusReason: expected NaN to be undefined

[Survived] ArrayDeclaration
src/zoomPlugin.ts:905:40
 }
 function wheelPreconditions(chart: Chart, event: WheelEvent, zoomOptions: NonNullable<ZoomPluginOptions['zoom']>): boolean {
   if (keyNotPressed(getModifierKey(zoomOptions.wheel), event)) {
-    invoke(zoomOptions.onZoomRejected, [{ chart, event }]);
+    invoke(zoomOptions.onZoomRejected, []);
     return false;
   }

[Killed] BooleanLiteral
src/zoomPlugin.ts:906:12
 function wheelPreconditions(chart: Chart, event: WheelEvent, zoomOptions: NonNullable<ZoomPluginOptions['zoom']>): boolean {
   if (keyNotPressed(getModifierKey(zoomOptions.wheel), event)) {
     invoke(zoomOptions.onZoomRejected, [{ chart, event }]);
-    return false;
+    return true;
   }
   if (!zoomStart(chart, event, zoomOptions)) return false;
killedBy: zoomPlugin wheel-zoom interaction rejects the wheel zoom (and calls onZoomRejected) when a required wheel modifier key is not held
statusReason: expected NaN to be undefined

[Killed] BooleanLiteral
src/zoomPlugin.ts:908:7
     invoke(zoomOptions.onZoomRejected, [{ chart, event }]);
     return false;
   }
-  if (!zoomStart(chart, event, zoomOptions)) return false;
+  if (zoomStart(chart, event, zoomOptions)) return false;
   if (event.cancelable) event.preventDefault();
   return event.deltaY !== undefined;
killedBy: zoomPlugin wheel-zoom interaction zooms in on a real wheel event when wheel.enabled is true
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:908:7
     invoke(zoomOptions.onZoomRejected, [{ chart, event }]);
     return false;
   }
-  if (!zoomStart(chart, event, zoomOptions)) return false;
+  if (true) return false;
   if (event.cancelable) event.preventDefault();
   return event.deltaY !== undefined;
killedBy: zoomPlugin wheel-zoom interaction zooms in on a real wheel event when wheel.enabled is true
statusReason: expected undefined to be defined

[Survived] ConditionalExpression
src/zoomPlugin.ts:909:7
     return false;
   }
   if (!zoomStart(chart, event, zoomOptions)) return false;
-  if (event.cancelable) event.preventDefault();
+  if (true) event.preventDefault();
   return event.deltaY !== undefined;
 }

[Survived] ConditionalExpression
src/zoomPlugin.ts:909:7
     return false;
   }
   if (!zoomStart(chart, event, zoomOptions)) return false;
-  if (event.cancelable) event.preventDefault();
+  if (false) event.preventDefault();
   return event.deltaY !== undefined;
 }

[Killed] ConditionalExpression
src/zoomPlugin.ts:910:10
   }
   if (!zoomStart(chart, event, zoomOptions)) return false;
   if (event.cancelable) event.preventDefault();
-  return event.deltaY !== undefined;
+  return false;
 }
 function wheel(chart: Chart, event: Event): void {
killedBy: zoomPlugin wheel-zoom interaction zooms in on a real wheel event when wheel.enabled is true
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:910:10
   }
   if (!zoomStart(chart, event, zoomOptions)) return false;
   if (event.cancelable) event.preventDefault();
-  return event.deltaY !== undefined;
+  return true;
 }
 function wheel(chart: Chart, event: Event): void {
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys wheelPreconditions: does not zoom when the wheel event genuinely has no deltaY at all (th
statusReason: expected NaN to be undefined

[Killed] BlockStatement
src/zoomPlugin.ts:912:50
   if (event.cancelable) event.preventDefault();
   return event.deltaY !== undefined;
 }
-function wheel(chart: Chart, event: Event): void {
-  const state = getState(chart);
-  const zoomOptions = state.options.zoom!;
-  const wheelEvent = event as WheelEvent;
-  if (!wheelPreconditions(chart, wheelEvent, zoomOptions)) return;
-  const rect = (wheelEvent.target as HTMLElement).getBoundingClientRect();
-  const speed = zoomOptions.wheel!.speed!;
-  const percentage = wheelEvent.deltaY >= 0 ? 2 - 1 / (1 - speed) : 1 + speed;
-  const amount: ZoomAmount = {
-    x: percentage,
-    y: percentage,
-    focalPoint: { x: wheelEvent.clientX - rect.left, y: wheelEvent.clientY - rect.top },
-  };
-  zoom(chart, amount, 'zoom', 'wheel');
-  const onZoomComplete = getState(chart).handlers.onZoomComplete as (() => void) | undefined;
-  onZoomComplete?.();
-}
+function wheel(chart: Chart, event: Event): void {}
 function addDebouncedHandler(chart: Chart, name: string, handler: ((ctx: { chart: Chart }) => void) | undefined, delay: number): void {
   if (handler) {
killedBy: zoomPlugin wheel-zoom interaction zooms in on a real wheel event when wheel.enabled is true
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:916:7
   const state = getState(chart);
   const zoomOptions = state.options.zoom!;
   const wheelEvent = event as WheelEvent;
-  if (!wheelPreconditions(chart, wheelEvent, zoomOptions)) return;
+  if (false) return;
   const rect = (wheelEvent.target as HTMLElement).getBoundingClientRect();
   const speed = zoomOptions.wheel!.speed!;
killedBy: zoomPlugin wheel-zoom interaction rejects the wheel zoom (and calls onZoomRejected) when a required wheel modifier key is not held
statusReason: expected NaN to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:916:7
   const state = getState(chart);
   const zoomOptions = state.options.zoom!;
   const wheelEvent = event as WheelEvent;
-  if (!wheelPreconditions(chart, wheelEvent, zoomOptions)) return;
+  if (true) return;
   const rect = (wheelEvent.target as HTMLElement).getBoundingClientRect();
   const speed = zoomOptions.wheel!.speed!;
killedBy: zoomPlugin wheel-zoom interaction zooms in on a real wheel event when wheel.enabled is true
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/zoomPlugin.ts:919:22
   if (!wheelPreconditions(chart, wheelEvent, zoomOptions)) return;
   const rect = (wheelEvent.target as HTMLElement).getBoundingClientRect();
   const speed = zoomOptions.wheel!.speed!;
-  const percentage = wheelEvent.deltaY >= 0 ? 2 - 1 / (1 - speed) : 1 + speed;
+  const percentage = wheelEvent.deltaY < 0 ? 2 - 1 / (1 - speed) : 1 + speed;
   const amount: ZoomAmount = {
     x: percentage,
killedBy: zoomPlugin wheel-zoom interaction zooms out on a positive deltaY wheel event (wheel's own deltaY>=0 branch, not just the negative one)
statusReason: expected 45 to be greater than 50

[Killed] ConditionalExpression
src/zoomPlugin.ts:919:22
   if (!wheelPreconditions(chart, wheelEvent, zoomOptions)) return;
   const rect = (wheelEvent.target as HTMLElement).getBoundingClientRect();
   const speed = zoomOptions.wheel!.speed!;
-  const percentage = wheelEvent.deltaY >= 0 ? 2 - 1 / (1 - speed) : 1 + speed;
+  const percentage = false ? 2 - 1 / (1 - speed) : 1 + speed;
   const amount: ZoomAmount = {
     x: percentage,
killedBy: zoomPlugin wheel-zoom interaction zooms out on a positive deltaY wheel event (wheel's own deltaY>=0 branch, not just the negative one)
statusReason: expected 45 to be greater than 50

[Survived] ArithmeticOperator
src/zoomPlugin.ts:923:57
   const amount: ZoomAmount = {
     x: percentage,
     y: percentage,
-    focalPoint: { x: wheelEvent.clientX - rect.left, y: wheelEvent.clientY - rect.top },
+    focalPoint: { x: wheelEvent.clientX - rect.left, y: wheelEvent.clientY + rect.top },
   };
   zoom(chart, amount, 'zoom', 'wheel');

[Survived] ArithmeticOperator
src/zoomPlugin.ts:923:22
   const amount: ZoomAmount = {
     x: percentage,
     y: percentage,
-    focalPoint: { x: wheelEvent.clientX - rect.left, y: wheelEvent.clientY - rect.top },
+    focalPoint: { x: wheelEvent.clientX + rect.left, y: wheelEvent.clientY - rect.top },
   };
   zoom(chart, amount, 'zoom', 'wheel');

[Killed] StringLiteral
src/zoomPlugin.ts:925:31
     y: percentage,
     focalPoint: { x: wheelEvent.clientX - rect.left, y: wheelEvent.clientY - rect.top },
   };
-  zoom(chart, amount, 'zoom', 'wheel');
+  zoom(chart, amount, 'zoom', "");
   const onZoomComplete = getState(chart).handlers.onZoomComplete as (() => void) | undefined;
   onZoomComplete?.();
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys invoke()s onZoom with the exact "wheel" trigger string on a real wheel zoom, not some oth
statusReason: expected "spy" to be called with arguments: [ ObjectContaining{…} ]

Received: 

  1st spy call:

  Array [
-   ObjectContaining {

[Survived] StringLiteral
src/zoomPlugin.ts:925:23
     y: percentage,
     focalPoint: { x: wheelEvent.clientX - rect.left, y: wheelEvent.clientY - rect.top },
   };
-  zoom(chart, amount, 'zoom', 'wheel');
+  zoom(chart, amount, "", 'wheel');
   const onZoomComplete = getState(chart).handlers.onZoomComplete as (() => void) | undefined;
   onZoomComplete?.();

[Killed] BlockStatement
src/zoomPlugin.ts:929:135
   const onZoomComplete = getState(chart).handlers.onZoomComplete as (() => void) | undefined;
   onZoomComplete?.();
 }
-function addDebouncedHandler(chart: Chart, name: string, handler: ((ctx: { chart: Chart }) => void) | undefined, delay: number): void {
-  if (handler) {
-    getState(chart).handlers[name] = debounce(() => invoke(handler, [{ chart }]), delay);
-  }
-}
+function addDebouncedHandler(chart: Chart, name: string, handler: ((ctx: { chart: Chart }) => void) | undefined, delay: number): void {}
 
 // ---- Pointer Events API: touch/pen pan + pinch-zoom (Hammer.js replacement) ----
killedBy: zoomPlugin wheel-zoom interaction calls the debounced onZoomComplete callback after a real wheel zoom
statusReason: expected "spy" to be called at least once

[Killed] ConditionalExpression
src/zoomPlugin.ts:930:7
   onZoomComplete?.();
 }
 function addDebouncedHandler(chart: Chart, name: string, handler: ((ctx: { chart: Chart }) => void) | undefined, delay: number): void {
-  if (handler) {
+  if (false) {
     getState(chart).handlers[name] = debounce(() => invoke(handler, [{ chart }]), delay);
   }
killedBy: zoomPlugin wheel-zoom interaction calls the debounced onZoomComplete callback after a real wheel zoom
statusReason: expected "spy" to be called at least once

[Killed] BlockStatement
src/zoomPlugin.ts:930:16
   onZoomComplete?.();
 }
 function addDebouncedHandler(chart: Chart, name: string, handler: ((ctx: { chart: Chart }) => void) | undefined, delay: number): void {
-  if (handler) {
-    getState(chart).handlers[name] = debounce(() => invoke(handler, [{ chart }]), delay);
-  }
+  if (handler) {}
 }
 
killedBy: zoomPlugin wheel-zoom interaction calls the debounced onZoomComplete callback after a real wheel zoom
statusReason: expected "spy" to be called at least once

[Killed] ArrowFunction
src/zoomPlugin.ts:931:47
 }
 function addDebouncedHandler(chart: Chart, name: string, handler: ((ctx: { chart: Chart }) => void) | undefined, delay: number): void {
   if (handler) {
-    getState(chart).handlers[name] = debounce(() => invoke(handler, [{ chart }]), delay);
+    getState(chart).handlers[name] = debounce(() => undefined, delay);
   }
 }
killedBy: zoomPlugin wheel-zoom interaction calls the debounced onZoomComplete callback after a real wheel zoom
statusReason: expected "spy" to be called at least once

[Survived] ArrayDeclaration
src/zoomPlugin.ts:931:69
 }
 function addDebouncedHandler(chart: Chart, name: string, handler: ((ctx: { chart: Chart }) => void) | undefined, delay: number): void {
   if (handler) {
-    getState(chart).handlers[name] = debounce(() => invoke(handler, [{ chart }]), delay);
+    getState(chart).handlers[name] = debounce(() => invoke(handler, []), delay);
   }
 }

[Killed] BlockStatement
src/zoomPlugin.ts:937:62
 
 // ---- Pointer Events API: touch/pen pan + pinch-zoom (Hammer.js replacement) ----
 
-function getDistance(a: ScreenPoint, b: ScreenPoint): number {
-  return Math.sqrt((a.x - b.x) ** 2 + (a.y - b.y) ** 2);
-}
+function getDistance(a: ScreenPoint, b: ScreenPoint): number {}
 function getMidpoint(a: ScreenPoint, b: ScreenPoint): ScreenPoint {
   return { x: (a.x + b.x) / 2, y: (a.y + b.y) / 2 };
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not call onPanComplete when the finger lifts before ever crossing the threshold
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Object {

[Killed] ArithmeticOperator
src/zoomPlugin.ts:938:20
 // ---- Pointer Events API: touch/pen pan + pinch-zoom (Hammer.js replacement) ----
 
 function getDistance(a: ScreenPoint, b: ScreenPoint): number {
-  return Math.sqrt((a.x - b.x) ** 2 + (a.y - b.y) ** 2);
+  return Math.sqrt((a.x - b.x) ** 2 - (a.y - b.y) ** 2);
 }
 function getMidpoint(a: ScreenPoint, b: ScreenPoint): ScreenPoint {
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys getDistance/getMidpoint: a real pinch computes the exact finger-to-finger distance and mi
statusReason: expected NaN to be less than 100

[Killed] ArithmeticOperator
src/zoomPlugin.ts:938:40
 // ---- Pointer Events API: touch/pen pan + pinch-zoom (Hammer.js replacement) ----
 
 function getDistance(a: ScreenPoint, b: ScreenPoint): number {
-  return Math.sqrt((a.x - b.x) ** 2 + (a.y - b.y) ** 2);
+  return Math.sqrt((a.x - b.x) ** 2 + (a.y + b.y) ** 2);
 }
 function getMidpoint(a: ScreenPoint, b: ScreenPoint): ScreenPoint {
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys getDistance/getMidpoint: a real pinch computes the exact finger-to-finger distance and mi
statusReason: expected 113.66929020915298 to be less than 100

[Survived] BlockStatement
src/zoomPlugin.ts:940:67
 function getDistance(a: ScreenPoint, b: ScreenPoint): number {
   return Math.sqrt((a.x - b.x) ** 2 + (a.y - b.y) ** 2);
 }
-function getMidpoint(a: ScreenPoint, b: ScreenPoint): ScreenPoint {
-  return { x: (a.x + b.x) / 2, y: (a.y + b.y) / 2 };
-}
+function getMidpoint(a: ScreenPoint, b: ScreenPoint): ScreenPoint {}
 /** `getPointPosition` above already works correctly for a `PointerEvent`
  * as-is (it only reads `target`/`clientX`/`clientY`, all real,

[Survived] ArithmeticOperator
src/zoomPlugin.ts:941:35
   return Math.sqrt((a.x - b.x) ** 2 + (a.y - b.y) ** 2);
 }
 function getMidpoint(a: ScreenPoint, b: ScreenPoint): ScreenPoint {
-  return { x: (a.x + b.x) / 2, y: (a.y + b.y) / 2 };
+  return { x: (a.x + b.x) / 2, y: (a.y + b.y) * 2 };
 }
 /** `getPointPosition` above already works correctly for a `PointerEvent`

[Survived] ArithmeticOperator
src/zoomPlugin.ts:941:36
   return Math.sqrt((a.x - b.x) ** 2 + (a.y - b.y) ** 2);
 }
 function getMidpoint(a: ScreenPoint, b: ScreenPoint): ScreenPoint {
-  return { x: (a.x + b.x) / 2, y: (a.y + b.y) / 2 };
+  return { x: (a.x + b.x) / 2, y: (a.y - b.y) / 2 };
 }
 /** `getPointPosition` above already works correctly for a `PointerEvent`

[Killed] BlockStatement
src/zoomPlugin.ts:948:74
  * standard `PointerEvent` properties inherited from `MouseEvent`) —
  * this thin wrapper exists purely so call sites below read naturally
  * without an inline cast at every use. */
-function pointerPosition(event: PointerEvent, chart: Chart): ScreenPoint {
-  return getPointPosition(event as unknown as MouseEvent, chart);
-}
+function pointerPosition(event: PointerEvent, chart: Chart): ScreenPoint {}
 function pointerDown(chart: Chart, event: Event): void {
   const pointerEvent = event as PointerEvent;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:959:7
   // have no mouse-gesture equivalent at all (see this file's own header
   // comment). Explicitly excluding 'mouse' here avoids double-handling
   // the same physical click through two separate event systems.
-  if (pointerEvent.pointerType === 'mouse') return;
+  if (true) return;
   const state = getState(chart);
   const { pointers } = state;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/zoomPlugin.ts:959:7
   // have no mouse-gesture equivalent at all (see this file's own header
   // comment). Explicitly excluding 'mouse' here avoids double-handling
   // the same physical click through two separate event systems.
-  if (pointerEvent.pointerType === 'mouse') return;
+  if (pointerEvent.pointerType !== 'mouse') return;
   const state = getState(chart);
   const { pointers } = state;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:962:7
   if (pointerEvent.pointerType === 'mouse') return;
   const state = getState(chart);
   const { pointers } = state;
-  if (pointers.size >= 2) return; // only ever track the first two touches
+  if (true) return; // only ever track the first two touches
   if (chart.legend) {
     // Same real guard mouseDown's own legend check applies for mouse —
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/zoomPlugin.ts:962:7
   if (pointerEvent.pointerType === 'mouse') return;
   const state = getState(chart);
   const { pointers } = state;
-  if (pointers.size >= 2) return; // only ever track the first two touches
+  if (pointers.size < 2) return; // only ever track the first two touches
   if (chart.legend) {
     // Same real guard mouseDown's own legend check applies for mouse —
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:963:7
   const state = getState(chart);
   const { pointers } = state;
   if (pointers.size >= 2) return; // only ever track the first two touches
-  if (chart.legend) {
+  if (true) {
     // Same real guard mouseDown's own legend check applies for mouse —
     // don't start a touch gesture over the legend area either.
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Survived] BlockStatement
src/zoomPlugin.ts:963:21
   const state = getState(chart);
   const { pointers } = state;
   if (pointers.size >= 2) return; // only ever track the first two touches
-  if (chart.legend) {
-    // Same real guard mouseDown's own legend check applies for mouse —
-    // don't start a touch gesture over the legend area either.
-    const point = pointerPosition(pointerEvent, chart);
-    if (_isPointInArea(point, chart.legend as unknown as ChartArea)) return;
-  }
+  if (chart.legend) {}
   const point = pointerPosition(pointerEvent, chart);
   pointers.set(pointerEvent.pointerId, point);
