[Survived] ConditionalExpression
src/zoomPlugin.ts:967:9
     // Same real guard mouseDown's own legend check applies for mouse —
     // don't start a touch gesture over the legend area either.
     const point = pointerPosition(pointerEvent, chart);
-    if (_isPointInArea(point, chart.legend as unknown as ChartArea)) return;
+    if (true) return;
   }
   const point = pointerPosition(pointerEvent, chart);

[Survived] ConditionalExpression
src/zoomPlugin.ts:967:9
     // Same real guard mouseDown's own legend check applies for mouse —
     // don't start a touch gesture over the legend area either.
     const point = pointerPosition(pointerEvent, chart);
-    if (_isPointInArea(point, chart.legend as unknown as ChartArea)) return;
+    if (false) return;
   }
   const point = pointerPosition(pointerEvent, chart);

[Survived] BlockStatement
src/zoomPlugin.ts:988:7
   // "real capture happens" branch is separately confirmed genuinely
   // untestable in this project's own jsdom test environment: jsdom has
   // no `setPointerCapture` on `Element.prototype` at all.
-  try {
-    (event.target as Element).setPointerCapture?.(pointerEvent.pointerId);
-  } catch {
+  try {} catch {
     // Best-effort only — see the comment above.
   }

[Survived] OptionalChaining
src/zoomPlugin.ts:989:5
   // untestable in this project's own jsdom test environment: jsdom has
   // no `setPointerCapture` on `Element.prototype` at all.
   try {
-    (event.target as Element).setPointerCapture?.(pointerEvent.pointerId);
+    (event.target as Element).setPointerCapture(pointerEvent.pointerId);
   } catch {
     // Best-effort only — see the comment above.

[Killed] LogicalOperator
src/zoomPlugin.ts:993:23
   } catch {
     // Best-effort only — see the comment above.
   }
-  const zoomOptions = state.options.zoom ?? {};
+  const zoomOptions = state.options.zoom && {};
   if (pointers.size === 2 && zoomOptions.pinch?.enabled) {
     // A second finger landing while pinch is enabled always takes over
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) starts a pinch-zoom gesture on a second touch when pinch.enabled, and zooms as the fingers move apart
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/zoomPlugin.ts:994:7
     // Best-effort only — see the comment above.
   }
   const zoomOptions = state.options.zoom ?? {};
-  if (pointers.size === 2 && zoomOptions.pinch?.enabled) {
+  if (pointers.size !== 2 && zoomOptions.pinch?.enabled) {
     // A second finger landing while pinch is enabled always takes over
     // from any single-finger pan already in progress — matches the
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) starts a pinch-zoom gesture on a second touch when pinch.enabled, and zooms as the fingers move apart
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:994:7
     // Best-effort only — see the comment above.
   }
   const zoomOptions = state.options.zoom ?? {};
-  if (pointers.size === 2 && zoomOptions.pinch?.enabled) {
+  if (true) {
     // A second finger landing while pinch is enabled always takes over
     // from any single-finger pan already in progress — matches the
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/zoomPlugin.ts:999:9
     // from any single-finger pan already in progress — matches the
     // original's own real Hammer-based behavior (a pinch gesture
     // supersedes an in-progress pan the moment a 2nd touch appears).
-    if (!zoomStart(chart, pointerEvent, zoomOptions)) return;
+    if (zoomStart(chart, pointerEvent, zoomOptions)) return;
     const [p1, p2] = Array.from(pointers.values());
     state.pinch = { lastDistance: getDistance(p1, p2) };
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) starts a pinch-zoom gesture on a second touch when pinch.enabled, and zooms as the fingers move apart
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:999:9
     // from any single-finger pan already in progress — matches the
     // original's own real Hammer-based behavior (a pinch gesture
     // supersedes an in-progress pan the moment a 2nd touch appears).
-    if (!zoomStart(chart, pointerEvent, zoomOptions)) return;
+    if (true) return;
     const [p1, p2] = Array.from(pointers.values());
     state.pinch = { lastDistance: getDistance(p1, p2) };
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) starts a pinch-zoom gesture on a second touch when pinch.enabled, and zooms as the fingers move apart
statusReason: expected undefined to be defined

[Killed] ObjectLiteral
src/zoomPlugin.ts:1001:19
     // supersedes an in-progress pan the moment a 2nd touch appears).
     if (!zoomStart(chart, pointerEvent, zoomOptions)) return;
     const [p1, p2] = Array.from(pointers.values());
-    state.pinch = { lastDistance: getDistance(p1, p2) };
+    state.pinch = {};
     state.panning = false;
     state.panStart = undefined;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) starts a pinch-zoom gesture on a second touch when pinch.enabled, and zooms as the fingers move apart
statusReason: expected undefined to be defined

[Survived] BooleanLiteral
src/zoomPlugin.ts:1002:21
     if (!zoomStart(chart, pointerEvent, zoomOptions)) return;
     const [p1, p2] = Array.from(pointers.values());
     state.pinch = { lastDistance: getDistance(p1, p2) };
-    state.panning = false;
+    state.panning = true;
     state.panStart = undefined;
   } else if (pointers.size === 1 && state.options.pan?.enabled) {

[Killed] EqualityOperator
src/zoomPlugin.ts:1004:14
     state.pinch = { lastDistance: getDistance(p1, p2) };
     state.panning = false;
     state.panStart = undefined;
-  } else if (pointers.size === 1 && state.options.pan?.enabled) {
+  } else if (pointers.size !== 1 && state.options.pan?.enabled) {
     // Not yet a confirmed pan — only a candidate until pointerMove sees
     // it cross `pan.threshold` (see pointerMove's own check below).
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/zoomPlugin.ts:1004:65
     state.pinch = { lastDistance: getDistance(p1, p2) };
     state.panning = false;
     state.panStart = undefined;
-  } else if (pointers.size === 1 && state.options.pan?.enabled) {
-    // Not yet a confirmed pan — only a candidate until pointerMove sees
-    // it cross `pan.threshold` (see pointerMove's own check below).
-    state.panStart = point;
-  }
+  } else if (pointers.size === 1 && state.options.pan?.enabled) {}
 }
 function pointerMove(chart: Chart, event: Event): void {
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:1012:7
 }
 function pointerMove(chart: Chart, event: Event): void {
   const pointerEvent = event as PointerEvent;
-  if (pointerEvent.pointerType === 'mouse') return;
+  if (true) return;
   const state = getState(chart);
   const { pointers } = state;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/zoomPlugin.ts:1012:7
 }
 function pointerMove(chart: Chart, event: Event): void {
   const pointerEvent = event as PointerEvent;
-  if (pointerEvent.pointerType === 'mouse') return;
+  if (pointerEvent.pointerType !== 'mouse') return;
   const state = getState(chart);
   const { pointers } = state;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:1015:7
   if (pointerEvent.pointerType === 'mouse') return;
   const state = getState(chart);
   const { pointers } = state;
-  if (!pointers.has(pointerEvent.pointerId)) return;
+  if (true) return;
   const previous = pointers.get(pointerEvent.pointerId)!;
   const current = pointerPosition(pointerEvent, chart);
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/zoomPlugin.ts:1015:7
   if (pointerEvent.pointerType === 'mouse') return;
   const state = getState(chart);
   const { pointers } = state;
-  if (!pointers.has(pointerEvent.pointerId)) return;
+  if (pointers.has(pointerEvent.pointerId)) return;
   const previous = pointers.get(pointerEvent.pointerId)!;
   const current = pointerPosition(pointerEvent, chart);
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/zoomPlugin.ts:1020:43
   const current = pointerPosition(pointerEvent, chart);
   pointers.set(pointerEvent.pointerId, current);
 
-  if (pointers.size === 2 && state.pinch) {
-    const [p1, p2] = Array.from(pointers.values());
-    const distance = getDistance(p1, p2);
-    // Guards against a division-by-near-zero spike (fingers briefly
-    // overlapping mid-gesture) producing a wild, single-frame zoom jump.
-    if (state.pinch.lastDistance > 0) {
-      const ratio = distance / state.pinch.lastDistance;
-      zoom(chart, { x: ratio, y: ratio, focalPoint: getMidpoint(p1, p2) }, 'none', 'pinch');
-    }
-    state.pinch.lastDistance = distance;
-    return;
-  }
+  if (pointers.size === 2 && state.pinch) {}
 
   if (pointers.size !== 1 || !state.options.pan?.enabled) return;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) starts a pinch-zoom gesture on a second touch when pinch.enabled, and zooms as the fingers move apart
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:1020:7
   const current = pointerPosition(pointerEvent, chart);
   pointers.set(pointerEvent.pointerId, current);
 
-  if (pointers.size === 2 && state.pinch) {
+  if (true) {
     const [p1, p2] = Array.from(pointers.values());
     const distance = getDistance(p1, p2);
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/zoomPlugin.ts:1025:39
     const distance = getDistance(p1, p2);
     // Guards against a division-by-near-zero spike (fingers briefly
     // overlapping mid-gesture) producing a wild, single-frame zoom jump.
-    if (state.pinch.lastDistance > 0) {
-      const ratio = distance / state.pinch.lastDistance;
-      zoom(chart, { x: ratio, y: ratio, focalPoint: getMidpoint(p1, p2) }, 'none', 'pinch');
-    }
+    if (state.pinch.lastDistance > 0) {}
     state.pinch.lastDistance = distance;
     return;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) starts a pinch-zoom gesture on a second touch when pinch.enabled, and zooms as the fingers move apart
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/zoomPlugin.ts:1025:9
     const distance = getDistance(p1, p2);
     // Guards against a division-by-near-zero spike (fingers briefly
     // overlapping mid-gesture) producing a wild, single-frame zoom jump.
-    if (state.pinch.lastDistance > 0) {
+    if (state.pinch.lastDistance <= 0) {
       const ratio = distance / state.pinch.lastDistance;
       zoom(chart, { x: ratio, y: ratio, focalPoint: getMidpoint(p1, p2) }, 'none', 'pinch');
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) starts a pinch-zoom gesture on a second touch when pinch.enabled, and zooms as the fingers move apart
statusReason: expected undefined to be defined

[Survived] ArithmeticOperator
src/zoomPlugin.ts:1026:21
     // Guards against a division-by-near-zero spike (fingers briefly
     // overlapping mid-gesture) producing a wild, single-frame zoom jump.
     if (state.pinch.lastDistance > 0) {
-      const ratio = distance / state.pinch.lastDistance;
+      const ratio = distance * state.pinch.lastDistance;
       zoom(chart, { x: ratio, y: ratio, focalPoint: getMidpoint(p1, p2) }, 'none', 'pinch');
     }

[Killed] ObjectLiteral
src/zoomPlugin.ts:1027:19
     // overlapping mid-gesture) producing a wild, single-frame zoom jump.
     if (state.pinch.lastDistance > 0) {
       const ratio = distance / state.pinch.lastDistance;
-      zoom(chart, { x: ratio, y: ratio, focalPoint: getMidpoint(p1, p2) }, 'none', 'pinch');
+      zoom(chart, {}, 'none', 'pinch');
     }
     state.pinch.lastDistance = distance;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) starts a pinch-zoom gesture on a second touch when pinch.enabled, and zooms as the fingers move apart
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/zoomPlugin.ts:1033:7
     return;
   }
 
-  if (pointers.size !== 1 || !state.options.pan?.enabled) return;
+  if (pointers.size === 1 || !state.options.pan?.enabled) return;
   const panOptions = state.options.pan;
   if (!state.panning) {
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/zoomPlugin.ts:1033:30
     return;
   }
 
-  if (pointers.size !== 1 || !state.options.pan?.enabled) return;
+  if (pointers.size !== 1 || state.options.pan?.enabled) return;
   const panOptions = state.options.pan;
   if (!state.panning) {
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/zoomPlugin.ts:1035:23
 
   if (pointers.size !== 1 || !state.options.pan?.enabled) return;
   const panOptions = state.options.pan;
-  if (!state.panning) {
-    if (!state.panStart) return; // gesture already rejected below, or superseded by a pinch
-    const threshold = panOptions.threshold ?? 0;
-    if (getDistance(state.panStart, current) < threshold) return; // still within threshold, not a pan yet
-    if (invoke(panOptions.onPanStart, [{ chart, event: pointerEvent, point: current }]) === false) {
-      invoke(panOptions.onPanRejected, [{ chart, event: pointerEvent }]);
-      state.panStart = undefined; // don't keep re-checking every frame after an explicit rejection
-      return;
-    }
-    state.panning = true;
-    return;
-  }
+  if (!state.panning) {}
   const dx = current.x - previous.x;
   const dy = current.y - previous.y;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not pan until movement crosses the configured pan.threshold
statusReason: expected -50 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:1035:7
 
   if (pointers.size !== 1 || !state.options.pan?.enabled) return;
   const panOptions = state.options.pan;
-  if (!state.panning) {
+  if (true) {
     if (!state.panStart) return; // gesture already rejected below, or superseded by a pinch
     const threshold = panOptions.threshold ?? 0;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:1036:9
   if (pointers.size !== 1 || !state.options.pan?.enabled) return;
   const panOptions = state.options.pan;
   if (!state.panning) {
-    if (!state.panStart) return; // gesture already rejected below, or superseded by a pinch
+    if (true) return; // gesture already rejected below, or superseded by a pinch
     const threshold = panOptions.threshold ?? 0;
     if (getDistance(state.panStart, current) < threshold) return; // still within threshold, not a pan yet
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/zoomPlugin.ts:1036:9
   if (pointers.size !== 1 || !state.options.pan?.enabled) return;
   const panOptions = state.options.pan;
   if (!state.panning) {
-    if (!state.panStart) return; // gesture already rejected below, or superseded by a pinch
+    if (state.panStart) return; // gesture already rejected below, or superseded by a pinch
     const threshold = panOptions.threshold ?? 0;
     if (getDistance(state.panStart, current) < threshold) return; // still within threshold, not a pan yet
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] LogicalOperator
src/zoomPlugin.ts:1037:23
   const panOptions = state.options.pan;
   if (!state.panning) {
     if (!state.panStart) return; // gesture already rejected below, or superseded by a pinch
-    const threshold = panOptions.threshold ?? 0;
+    const threshold = panOptions.threshold && 0;
     if (getDistance(state.panStart, current) < threshold) return; // still within threshold, not a pan yet
     if (invoke(panOptions.onPanStart, [{ chart, event: pointerEvent, point: current }]) === false) {
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not call onPanComplete when the finger lifts before ever crossing the threshold
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Object {

[Killed] ConditionalExpression
src/zoomPlugin.ts:1038:9
   if (!state.panning) {
     if (!state.panStart) return; // gesture already rejected below, or superseded by a pinch
     const threshold = panOptions.threshold ?? 0;
-    if (getDistance(state.panStart, current) < threshold) return; // still within threshold, not a pan yet
+    if (true) return; // still within threshold, not a pan yet
     if (invoke(panOptions.onPanStart, [{ chart, event: pointerEvent, point: current }]) === false) {
       invoke(panOptions.onPanRejected, [{ chart, event: pointerEvent }]);
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] EqualityOperator
src/zoomPlugin.ts:1038:9
   if (!state.panning) {
     if (!state.panStart) return; // gesture already rejected below, or superseded by a pinch
     const threshold = panOptions.threshold ?? 0;
-    if (getDistance(state.panStart, current) < threshold) return; // still within threshold, not a pan yet
+    if (getDistance(state.panStart, current) >= threshold) return; // still within threshold, not a pan yet
     if (invoke(panOptions.onPanStart, [{ chart, event: pointerEvent, point: current }]) === false) {
       invoke(panOptions.onPanRejected, [{ chart, event: pointerEvent }]);
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] BooleanLiteral
src/zoomPlugin.ts:1039:93
     if (!state.panStart) return; // gesture already rejected below, or superseded by a pinch
     const threshold = panOptions.threshold ?? 0;
     if (getDistance(state.panStart, current) < threshold) return; // still within threshold, not a pan yet
-    if (invoke(panOptions.onPanStart, [{ chart, event: pointerEvent, point: current }]) === false) {
+    if (invoke(panOptions.onPanStart, [{ chart, event: pointerEvent, point: current }]) === true) {
       invoke(panOptions.onPanRejected, [{ chart, event: pointerEvent }]);
       state.panStart = undefined; // don't keep re-checking every frame after an explicit rejection
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) calls onPanStart once threshold is crossed, and onPanRejected instead when it returns false
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/zoomPlugin.ts:1039:9
     if (!state.panStart) return; // gesture already rejected below, or superseded by a pinch
     const threshold = panOptions.threshold ?? 0;
     if (getDistance(state.panStart, current) < threshold) return; // still within threshold, not a pan yet
-    if (invoke(panOptions.onPanStart, [{ chart, event: pointerEvent, point: current }]) === false) {
+    if (false) {
       invoke(panOptions.onPanRejected, [{ chart, event: pointerEvent }]);
       state.panStart = undefined; // don't keep re-checking every frame after an explicit rejection
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) calls onPanStart once threshold is crossed, and onPanRejected instead when it returns false
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] ArrayDeclaration
src/zoomPlugin.ts:1040:40
     const threshold = panOptions.threshold ?? 0;
     if (getDistance(state.panStart, current) < threshold) return; // still within threshold, not a pan yet
     if (invoke(panOptions.onPanStart, [{ chart, event: pointerEvent, point: current }]) === false) {
-      invoke(panOptions.onPanRejected, [{ chart, event: pointerEvent }]);
+      invoke(panOptions.onPanRejected, []);
       state.panStart = undefined; // don't keep re-checking every frame after an explicit rejection
       return;

[Killed] BooleanLiteral
src/zoomPlugin.ts:1044:21
       state.panStart = undefined; // don't keep re-checking every frame after an explicit rejection
       return;
     }
-    state.panning = true;
+    state.panning = false;
     return;
   }
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Survived] ArithmeticOperator
src/zoomPlugin.ts:1047:14
     state.panning = true;
     return;
   }
-  const dx = current.x - previous.x;
+  const dx = current.x + previous.x;
   const dy = current.y - previous.y;
   if (dx !== 0 || dy !== 0) pan(chart, { x: dx, y: dy });

[Survived] ArithmeticOperator
src/zoomPlugin.ts:1048:14
     return;
   }
   const dx = current.x - previous.x;
-  const dy = current.y - previous.y;
+  const dy = current.y + previous.y;
   if (dx !== 0 || dy !== 0) pan(chart, { x: dx, y: dy });
 }

[Killed] ConditionalExpression
src/zoomPlugin.ts:1049:19
   }
   const dx = current.x - previous.x;
   const dy = current.y - previous.y;
-  if (dx !== 0 || dy !== 0) pan(chart, { x: dx, y: dy });
+  if (dx !== 0 || false) pan(chart, { x: dx, y: dy });
 }
 function pointerUp(chart: Chart, event: Event): void {
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) pans a y-axis scale with a purely vertical touch drag (pointerMove's own dy!==0 branch, not just dx)
statusReason: expected undefined to be defined

[Killed] ConditionalExpression
src/zoomPlugin.ts:1049:7
   }
   const dx = current.x - previous.x;
   const dy = current.y - previous.y;
-  if (dx !== 0 || dy !== 0) pan(chart, { x: dx, y: dy });
+  if (false) pan(chart, { x: dx, y: dy });
 }
 function pointerUp(chart: Chart, event: Event): void {
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] BlockStatement
src/zoomPlugin.ts:1051:54
   const dy = current.y - previous.y;
   if (dx !== 0 || dy !== 0) pan(chart, { x: dx, y: dy });
 }
-function pointerUp(chart: Chart, event: Event): void {
-  const pointerEvent = event as PointerEvent;
-  if (pointerEvent.pointerType === 'mouse') return;
-  const state = getState(chart);
-  const { pointers } = state;
-  if (!pointers.has(pointerEvent.pointerId)) return;
-  pointers.delete(pointerEvent.pointerId);
-
-  if (pointers.size < 2 && state.pinch) {
-    state.pinch = undefined;
-    invoke(state.options.zoom?.onZoomComplete, [{ chart }]);
-  }
-  if (pointers.size === 1 && state.options.pan?.enabled && !state.pinch) {
-    // One finger lifted out of a two-finger pinch, one finger still
-    // down — re-baseline as a fresh pan candidate from here, rather than
-    // computing a delta against a stale pre-pinch position (which could
-    // otherwise produce a spurious jump).
-    state.panStart = pointers.values().next().value;
-    state.panning = false;
-  } else if (pointers.size === 0) {
-    if (state.panning) invoke(state.options.pan?.onPanComplete, [{ chart }]);
-    state.panning = false;
-    state.panStart = undefined;
-  }
-}
+function pointerUp(chart: Chart, event: Event): void {}
 function addListeners(chart: Chart, options: ZoomPluginOptions): void {
   const canvas = chart.canvas;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) calls onPanComplete when the finger lifts after a real pan
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/zoomPlugin.ts:1059:41
   if (!pointers.has(pointerEvent.pointerId)) return;
   pointers.delete(pointerEvent.pointerId);
 
-  if (pointers.size < 2 && state.pinch) {
-    state.pinch = undefined;
-    invoke(state.options.zoom?.onZoomComplete, [{ chart }]);
-  }
+  if (pointers.size < 2 && state.pinch) {}
   if (pointers.size === 1 && state.options.pan?.enabled && !state.pinch) {
     // One finger lifted out of a two-finger pinch, one finger still
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) ends the pinch and calls onZoomComplete when a finger lifts back down to one pointer
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/zoomPlugin.ts:1059:7
   if (!pointers.has(pointerEvent.pointerId)) return;
   pointers.delete(pointerEvent.pointerId);
 
-  if (pointers.size < 2 && state.pinch) {
+  if (pointers.size >= 2 && state.pinch) {
     state.pinch = undefined;
     invoke(state.options.zoom?.onZoomComplete, [{ chart }]);
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) ends the pinch and calls onZoomComplete when a finger lifts back down to one pointer
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] OptionalChaining
src/zoomPlugin.ts:1061:12
 
   if (pointers.size < 2 && state.pinch) {
     state.pinch = undefined;
-    invoke(state.options.zoom?.onZoomComplete, [{ chart }]);
+    invoke(state.options.zoom.onZoomComplete, [{ chart }]);
   }
   if (pointers.size === 1 && state.options.pan?.enabled && !state.pinch) {

[Survived] ArrayDeclaration
src/zoomPlugin.ts:1061:48
 
   if (pointers.size < 2 && state.pinch) {
     state.pinch = undefined;
-    invoke(state.options.zoom?.onZoomComplete, [{ chart }]);
+    invoke(state.options.zoom?.onZoomComplete, []);
   }
   if (pointers.size === 1 && state.options.pan?.enabled && !state.pinch) {

[Killed] ConditionalExpression
src/zoomPlugin.ts:1063:7
     state.pinch = undefined;
     invoke(state.options.zoom?.onZoomComplete, [{ chart }]);
   }
-  if (pointers.size === 1 && state.options.pan?.enabled && !state.pinch) {
+  if (true) {
     // One finger lifted out of a two-finger pinch, one finger still
     // down — re-baseline as a fresh pan candidate from here, rather than
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) calls onPanComplete when the finger lifts after a real pan
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/zoomPlugin.ts:1063:7
     state.pinch = undefined;
     invoke(state.options.zoom?.onZoomComplete, [{ chart }]);
   }
-  if (pointers.size === 1 && state.options.pan?.enabled && !state.pinch) {
+  if (true && !state.pinch) {
     // One finger lifted out of a two-finger pinch, one finger still
     // down — re-baseline as a fresh pan candidate from here, rather than
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) calls onPanComplete when the finger lifts after a real pan
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] BooleanLiteral
src/zoomPlugin.ts:1069:21
     // computing a delta against a stale pre-pinch position (which could
     // otherwise produce a spurious jump).
     state.panStart = pointers.values().next().value;
-    state.panning = false;
+    state.panning = true;
   } else if (pointers.size === 0) {
     if (state.panning) invoke(state.options.pan?.onPanComplete, [{ chart }]);
