[Killed] ConditionalExpression
src/zoomPlugin.ts:1070:14
     // otherwise produce a spurious jump).
     state.panStart = pointers.values().next().value;
     state.panning = false;
-  } else if (pointers.size === 0) {
+  } else if (false) {
     if (state.panning) invoke(state.options.pan?.onPanComplete, [{ chart }]);
     state.panning = false;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) calls onPanComplete when the finger lifts after a real pan
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] EqualityOperator
src/zoomPlugin.ts:1070:14
     // otherwise produce a spurious jump).
     state.panStart = pointers.values().next().value;
     state.panning = false;
-  } else if (pointers.size === 0) {
+  } else if (pointers.size !== 0) {
     if (state.panning) invoke(state.options.pan?.onPanComplete, [{ chart }]);
     state.panning = false;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) calls onPanComplete when the finger lifts after a real pan
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/zoomPlugin.ts:1071:9
     state.panStart = pointers.values().next().value;
     state.panning = false;
   } else if (pointers.size === 0) {
-    if (state.panning) invoke(state.options.pan?.onPanComplete, [{ chart }]);
+    if (false) invoke(state.options.pan?.onPanComplete, [{ chart }]);
     state.panning = false;
     state.panStart = undefined;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) calls onPanComplete when the finger lifts after a real pan
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/zoomPlugin.ts:1071:9
     state.panStart = pointers.values().next().value;
     state.panning = false;
   } else if (pointers.size === 0) {
-    if (state.panning) invoke(state.options.pan?.onPanComplete, [{ chart }]);
+    if (true) invoke(state.options.pan?.onPanComplete, [{ chart }]);
     state.panning = false;
     state.panStart = undefined;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not call onPanComplete when the finger lifts before ever crossing the threshold
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Object {

[Survived] BooleanLiteral
src/zoomPlugin.ts:1072:21
     state.panning = false;
   } else if (pointers.size === 0) {
     if (state.panning) invoke(state.options.pan?.onPanComplete, [{ chart }]);
-    state.panning = false;
+    state.panning = true;
     state.panStart = undefined;
   }

[Killed] OptionalChaining
src/zoomPlugin.ts:1078:24
 }
 function addListeners(chart: Chart, options: ZoomPluginOptions): void {
   const canvas = chart.canvas;
-  const wheelOptions = options.zoom?.wheel;
+  const wheelOptions = options.zoom.wheel;
   const dragOptions = options.zoom?.drag;
   const onZoomComplete = options.zoom?.onZoomComplete;
killedBy: zoomPlugin programmatic zoom() falls back to zooming every scale when zoom is called with no zoom config at all (getEnabledScalesByPoint's own default)
statusReason: Cannot read properties of undefined (reading 'wheel')

[Killed] OptionalChaining
src/zoomPlugin.ts:1079:23
 function addListeners(chart: Chart, options: ZoomPluginOptions): void {
   const canvas = chart.canvas;
   const wheelOptions = options.zoom?.wheel;
-  const dragOptions = options.zoom?.drag;
+  const dragOptions = options.zoom.drag;
   const onZoomComplete = options.zoom?.onZoomComplete;
   const pinchEnabled = options.zoom?.pinch?.enabled;
killedBy: zoomPlugin programmatic zoom() falls back to zooming every scale when zoom is called with no zoom config at all (getEnabledScalesByPoint's own default)
statusReason: Cannot read properties of undefined (reading 'drag')

[Killed] OptionalChaining
src/zoomPlugin.ts:1080:26
   const canvas = chart.canvas;
   const wheelOptions = options.zoom?.wheel;
   const dragOptions = options.zoom?.drag;
-  const onZoomComplete = options.zoom?.onZoomComplete;
+  const onZoomComplete = options.zoom.onZoomComplete;
   const pinchEnabled = options.zoom?.pinch?.enabled;
   const panEnabled = options.pan?.enabled;
killedBy: zoomPlugin programmatic zoom() falls back to zooming every scale when zoom is called with no zoom config at all (getEnabledScalesByPoint's own default)
statusReason: Cannot read properties of undefined (reading 'onZoomComplete')

[Killed] OptionalChaining
src/zoomPlugin.ts:1081:24
   const wheelOptions = options.zoom?.wheel;
   const dragOptions = options.zoom?.drag;
   const onZoomComplete = options.zoom?.onZoomComplete;
-  const pinchEnabled = options.zoom?.pinch?.enabled;
+  const pinchEnabled = options.zoom.pinch?.enabled;
   const panEnabled = options.pan?.enabled;
   if (wheelOptions?.enabled) {
killedBy: zoomPlugin programmatic zoom() falls back to zooming every scale when zoom is called with no zoom config at all (getEnabledScalesByPoint's own default)
statusReason: Cannot read properties of undefined (reading 'pinch')

[Killed] OptionalChaining
src/zoomPlugin.ts:1081:24
   const wheelOptions = options.zoom?.wheel;
   const dragOptions = options.zoom?.drag;
   const onZoomComplete = options.zoom?.onZoomComplete;
-  const pinchEnabled = options.zoom?.pinch?.enabled;
+  const pinchEnabled = options.zoom?.pinch.enabled;
   const panEnabled = options.pan?.enabled;
   if (wheelOptions?.enabled) {
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'enabled')

[Killed] OptionalChaining
src/zoomPlugin.ts:1082:22
   const dragOptions = options.zoom?.drag;
   const onZoomComplete = options.zoom?.onZoomComplete;
   const pinchEnabled = options.zoom?.pinch?.enabled;
-  const panEnabled = options.pan?.enabled;
+  const panEnabled = options.pan.enabled;
   if (wheelOptions?.enabled) {
     addHandler(chart, canvas, 'wheel', wheel);
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'enabled')

[Killed] ConditionalExpression
src/zoomPlugin.ts:1083:7
   const onZoomComplete = options.zoom?.onZoomComplete;
   const pinchEnabled = options.zoom?.pinch?.enabled;
   const panEnabled = options.pan?.enabled;
-  if (wheelOptions?.enabled) {
+  if (true) {
     addHandler(chart, canvas, 'wheel', wheel);
     addDebouncedHandler(chart, 'onZoomComplete', onZoomComplete, 250);
killedBy: zoomPlugin wheel-zoom interaction does not zoom when wheel.enabled is false (default)
statusReason: expected NaN to be undefined

[Killed] OptionalChaining
src/zoomPlugin.ts:1083:7
   const onZoomComplete = options.zoom?.onZoomComplete;
   const pinchEnabled = options.zoom?.pinch?.enabled;
   const panEnabled = options.pan?.enabled;
-  if (wheelOptions?.enabled) {
+  if (wheelOptions.enabled) {
     addHandler(chart, canvas, 'wheel', wheel);
     addDebouncedHandler(chart, 'onZoomComplete', onZoomComplete, 250);
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: Cannot read properties of undefined (reading 'enabled')

[Survived] BlockStatement
src/zoomPlugin.ts:1086:10
   if (wheelOptions?.enabled) {
     addHandler(chart, canvas, 'wheel', wheel);
     addDebouncedHandler(chart, 'onZoomComplete', onZoomComplete, 250);
-  } else {
-    removeHandler(chart, 'wheel');
-  }
+  } else {}
   if (dragOptions?.enabled) {
     addHandler(chart, canvas, 'mousedown', mouseDown);

[Killed] ConditionalExpression
src/zoomPlugin.ts:1089:7
   } else {
     removeHandler(chart, 'wheel');
   }
-  if (dragOptions?.enabled) {
+  if (true) {
     addHandler(chart, canvas, 'mousedown', mouseDown);
     addHandler(chart, canvas.ownerDocument!, 'mouseup', mouseUp);
killedBy: zoomPlugin precise mutation-hardening: event-type isolation (addListeners/removeListeners) a mousedown event does nothing when only wheel is enabled (mousedown handler genuinely never attached)
statusReason: expected 50 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:1089:7
   } else {
     removeHandler(chart, 'wheel');
   }
-  if (dragOptions?.enabled) {
+  if (false) {
     addHandler(chart, canvas, 'mousedown', mouseDown);
     addHandler(chart, canvas.ownerDocument!, 'mouseup', mouseUp);
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected undefined to be close to 50, received difference is NaN, but expected 0.000005

[Survived] BlockStatement
src/zoomPlugin.ts:1092:10
   if (dragOptions?.enabled) {
     addHandler(chart, canvas, 'mousedown', mouseDown);
     addHandler(chart, canvas.ownerDocument!, 'mouseup', mouseUp);
-  } else {
-    removeHandler(chart, 'mousedown');
-    removeHandler(chart, 'mousemove');
-    removeHandler(chart, 'mouseup');
-    removeHandler(chart, 'keydown');
-  }
+  } else {}
   if (panEnabled || pinchEnabled) {
     addHandler(chart, canvas, 'pointerdown', pointerDown);

[Survived] StringLiteral
src/zoomPlugin.ts:1095:26
   } else {
     removeHandler(chart, 'mousedown');
     removeHandler(chart, 'mousemove');
-    removeHandler(chart, 'mouseup');
+    removeHandler(chart, "");
     removeHandler(chart, 'keydown');
   }

[Killed] ConditionalExpression
src/zoomPlugin.ts:1098:7
     removeHandler(chart, 'mouseup');
     removeHandler(chart, 'keydown');
   }
-  if (panEnabled || pinchEnabled) {
+  if (true) {
     addHandler(chart, canvas, 'pointerdown', pointerDown);
     addHandler(chart, canvas.ownerDocument!, 'pointermove', pointerMove);
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) sets touch-action:none on the canvas while pan or pinch is enabled, and clears it when neither is
statusReason: expected 'none' to be '' // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:1098:7
     removeHandler(chart, 'mouseup');
     removeHandler(chart, 'keydown');
   }
-  if (panEnabled || pinchEnabled) {
+  if (false) {
     addHandler(chart, canvas, 'pointerdown', pointerDown);
     addHandler(chart, canvas.ownerDocument!, 'pointermove', pointerMove);
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Killed] StringLiteral
src/zoomPlugin.ts:1100:46
   }
   if (panEnabled || pinchEnabled) {
     addHandler(chart, canvas, 'pointerdown', pointerDown);
-    addHandler(chart, canvas.ownerDocument!, 'pointermove', pointerMove);
+    addHandler(chart, canvas.ownerDocument!, "", pointerMove);
     addHandler(chart, canvas.ownerDocument!, 'pointerup', pointerUp);
     addHandler(chart, canvas.ownerDocument!, 'pointercancel', pointerUp);
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) does not abort the gesture when setPointerCapture throws (a real, confirmed browser exception, not just a jsdom gap)
statusReason: expected undefined to be defined

[Survived] StringLiteral
src/zoomPlugin.ts:1102:46
     addHandler(chart, canvas, 'pointerdown', pointerDown);
     addHandler(chart, canvas.ownerDocument!, 'pointermove', pointerMove);
     addHandler(chart, canvas.ownerDocument!, 'pointerup', pointerUp);
-    addHandler(chart, canvas.ownerDocument!, 'pointercancel', pointerUp);
+    addHandler(chart, canvas.ownerDocument!, "", pointerUp);
     // Without this, the browser's own native touch panning/pinch-zoom on
     // the canvas fights with this plugin's own gesture handling (both

[Killed] BlockStatement
src/zoomPlugin.ts:1109:10
     // full control of touch gestures on this element over to this
     // plugin's own JS-driven pan/zoom instead.
     canvas.style.touchAction = 'none';
-  } else {
-    removeHandler(chart, 'pointerdown');
-    removeHandler(chart, 'pointermove');
-    removeHandler(chart, 'pointerup');
-    removeHandler(chart, 'pointercancel');
-    canvas.style.touchAction = '';
-  }
+  } else {}
 }
 function removeListeners(chart: Chart): void {
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) sets touch-action:none on the canvas while pan or pinch is enabled, and clears it when neither is
statusReason: expected 'none' to be '' // Object.is equality

[Survived] StringLiteral
src/zoomPlugin.ts:1111:26
     canvas.style.touchAction = 'none';
   } else {
     removeHandler(chart, 'pointerdown');
-    removeHandler(chart, 'pointermove');
+    removeHandler(chart, "");
     removeHandler(chart, 'pointerup');
     removeHandler(chart, 'pointercancel');

[Survived] StringLiteral
src/zoomPlugin.ts:1112:26
   } else {
     removeHandler(chart, 'pointerdown');
     removeHandler(chart, 'pointermove');
-    removeHandler(chart, 'pointerup');
+    removeHandler(chart, "");
     removeHandler(chart, 'pointercancel');
     canvas.style.touchAction = '';

[Killed] BlockStatement
src/zoomPlugin.ts:1117:46
     canvas.style.touchAction = '';
   }
 }
-function removeListeners(chart: Chart): void {
-  removeHandler(chart, 'mousedown');
-  removeHandler(chart, 'mousemove');
-  removeHandler(chart, 'mouseup');
-  removeHandler(chart, 'wheel');
-  removeHandler(chart, 'click');
-  removeHandler(chart, 'keydown');
-  removeHandler(chart, 'pointerdown');
-  removeHandler(chart, 'pointermove');
-  removeHandler(chart, 'pointerup');
-  removeHandler(chart, 'pointercancel');
-  chart.canvas.style.touchAction = '';
-}
+function removeListeners(chart: Chart): void {}
 
 // ---- drag-rectangle overlay ----
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) clears touch-action and stops responding to pointer events after stop()
statusReason: expected 'none' to be '' // Object.is equality

[Survived] StringLiteral
src/zoomPlugin.ts:1119:24
 }
 function removeListeners(chart: Chart): void {
   removeHandler(chart, 'mousedown');
-  removeHandler(chart, 'mousemove');
+  removeHandler(chart, "");
   removeHandler(chart, 'mouseup');
   removeHandler(chart, 'wheel');

[Killed] BlockStatement
src/zoomPlugin.ts:1133:90
 
 // ---- drag-rectangle overlay ----
 
-function drawDragOverlay(chart: Chart, caller: string, options: ZoomPluginOptions): void {
-  const dragOptions = options.zoom!.drag!;
-  const { dragStart, dragEnd } = getState(chart);
-  if (dragOptions.drawTime !== caller || !dragEnd) return;
-  const { left, top, width, height } = computeDragRect(chart, options.zoom!.mode, { dragStart: dragStart!, dragEnd }, dragOptions.maintainAspectRatio);
-  const ctx = chart.ctx;
-  ctx.save();
-  ctx.beginPath();
-  ctx.fillStyle = dragOptions.backgroundColor || 'rgba(225,225,225,0.3)';
-  ctx.fillRect(left, top, width, height);
-  if (dragOptions.borderWidth && dragOptions.borderWidth > 0) {
-    ctx.lineWidth = dragOptions.borderWidth;
-    ctx.strokeStyle = dragOptions.borderColor || 'rgba(225,225,225)';
-    ctx.strokeRect(left, top, width, height);
-  }
-  ctx.restore();
-}
+function drawDragOverlay(chart: Chart, caller: string, options: ZoomPluginOptions): void {}
 
 const DEFAULT_OPTIONS: ZoomPluginOptions = {
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys drawDragOverlay: falls back to the real default background color when none is configured
statusReason: expected undefined to be 'rgba(225,225,225,0.3)' // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:1136:7
 function drawDragOverlay(chart: Chart, caller: string, options: ZoomPluginOptions): void {
   const dragOptions = options.zoom!.drag!;
   const { dragStart, dragEnd } = getState(chart);
-  if (dragOptions.drawTime !== caller || !dragEnd) return;
+  if (true) return;
   const { left, top, width, height } = computeDragRect(chart, options.zoom!.mode, { dragStart: dragStart!, dragEnd }, dragOptions.maintainAspectRatio);
   const ctx = chart.ctx;
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys drawDragOverlay: falls back to the real default background color when none is configured
statusReason: expected undefined to be 'rgba(225,225,225,0.3)' // Object.is equality

[Killed] LogicalOperator
src/zoomPlugin.ts:1136:7
 function drawDragOverlay(chart: Chart, caller: string, options: ZoomPluginOptions): void {
   const dragOptions = options.zoom!.drag!;
   const { dragStart, dragEnd } = getState(chart);
-  if (dragOptions.drawTime !== caller || !dragEnd) return;
+  if (dragOptions.drawTime !== caller && !dragEnd) return;
   const { left, top, width, height } = computeDragRect(chart, options.zoom!.mode, { dragStart: dragStart!, dragEnd }, dragOptions.maintainAspectRatio);
   const ctx = chart.ctx;
killedBy: zoomPlugin drag-rectangle overlay drawing does not draw at a drawTime hook other than the one configured
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      50,

[Killed] ObjectLiteral
src/zoomPlugin.ts:1137:83
   const dragOptions = options.zoom!.drag!;
   const { dragStart, dragEnd } = getState(chart);
   if (dragOptions.drawTime !== caller || !dragEnd) return;
-  const { left, top, width, height } = computeDragRect(chart, options.zoom!.mode, { dragStart: dragStart!, dragEnd }, dragOptions.maintainAspectRatio);
+  const { left, top, width, height } = computeDragRect(chart, options.zoom!.mode, {}, dragOptions.maintainAspectRatio);
   const ctx = chart.ctx;
   ctx.save();
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys drawDragOverlay: falls back to the real default background color when none is configured
statusReason: Cannot read properties of undefined (reading 'target')

[Killed] ConditionalExpression
src/zoomPlugin.ts:1141:19
   const ctx = chart.ctx;
   ctx.save();
   ctx.beginPath();
-  ctx.fillStyle = dragOptions.backgroundColor || 'rgba(225,225,225,0.3)';
+  ctx.fillStyle = true;
   ctx.fillRect(left, top, width, height);
   if (dragOptions.borderWidth && dragOptions.borderWidth > 0) {
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys drawDragOverlay: falls back to the real default background color when none is configured
statusReason: expected true to be 'rgba(225,225,225,0.3)' // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:1141:19
   const ctx = chart.ctx;
   ctx.save();
   ctx.beginPath();
-  ctx.fillStyle = dragOptions.backgroundColor || 'rgba(225,225,225,0.3)';
+  ctx.fillStyle = false;
   ctx.fillRect(left, top, width, height);
   if (dragOptions.borderWidth && dragOptions.borderWidth > 0) {
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys drawDragOverlay: falls back to the real default background color when none is configured
statusReason: expected false to be 'rgba(225,225,225,0.3)' // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:1143:7
   ctx.beginPath();
   ctx.fillStyle = dragOptions.backgroundColor || 'rgba(225,225,225,0.3)';
   ctx.fillRect(left, top, width, height);
-  if (dragOptions.borderWidth && dragOptions.borderWidth > 0) {
+  if (true) {
     ctx.lineWidth = dragOptions.borderWidth;
     ctx.strokeStyle = dragOptions.borderColor || 'rgba(225,225,225)';
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys drawDragOverlay: a borderWidth of exactly 0 does not stroke (the > 0 boundary, not >= )
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      50,

[Killed] EqualityOperator
src/zoomPlugin.ts:1143:34
   ctx.beginPath();
   ctx.fillStyle = dragOptions.backgroundColor || 'rgba(225,225,225,0.3)';
   ctx.fillRect(left, top, width, height);
-  if (dragOptions.borderWidth && dragOptions.borderWidth > 0) {
+  if (dragOptions.borderWidth && dragOptions.borderWidth <= 0) {
     ctx.lineWidth = dragOptions.borderWidth;
     ctx.strokeStyle = dragOptions.borderColor || 'rgba(225,225,225)';
killedBy: zoomPlugin drag-rectangle overlay drawing draws the drag overlay via the configured drawTime hook while a drag is in progress
statusReason: expected "spy" to be called at least once

[Killed] ConditionalExpression
src/zoomPlugin.ts:1145:23
   ctx.fillRect(left, top, width, height);
   if (dragOptions.borderWidth && dragOptions.borderWidth > 0) {
     ctx.lineWidth = dragOptions.borderWidth;
-    ctx.strokeStyle = dragOptions.borderColor || 'rgba(225,225,225)';
+    ctx.strokeStyle = false;
     ctx.strokeRect(left, top, width, height);
   }
killedBy: zoomPlugin drag-rectangle overlay drawing falls back to the default border color when borderWidth is set but borderColor is not (drawDragOverlay's own strokeStyle fallback)
statusReason: expected false to be 'rgba(225,225,225)' // Object.is equality

[Killed] LogicalOperator
src/zoomPlugin.ts:1145:23
   ctx.fillRect(left, top, width, height);
   if (dragOptions.borderWidth && dragOptions.borderWidth > 0) {
     ctx.lineWidth = dragOptions.borderWidth;
-    ctx.strokeStyle = dragOptions.borderColor || 'rgba(225,225,225)';
+    ctx.strokeStyle = dragOptions.borderColor && 'rgba(225,225,225)';
     ctx.strokeRect(left, top, width, height);
   }
killedBy: zoomPlugin drag-rectangle overlay drawing falls back to the default border color when borderWidth is set but borderColor is not (drawDragOverlay's own strokeStyle fallback)
statusReason: expected undefined to be 'rgba(225,225,225)' // Object.is equality

[Survived] BooleanLiteral
src/zoomPlugin.ts:1152:19
 }
 
 const DEFAULT_OPTIONS: ZoomPluginOptions = {
-  pan: { enabled: false, mode: 'xy', threshold: 10, modifierKey: null },
+  pan: { enabled: true, mode: 'xy', threshold: 10, modifierKey: null },
   zoom: {
     wheel: { enabled: false, speed: 0.1, modifierKey: null },

[Survived] ObjectLiteral
src/zoomPlugin.ts:1152:8
 }
 
 const DEFAULT_OPTIONS: ZoomPluginOptions = {
-  pan: { enabled: false, mode: 'xy', threshold: 10, modifierKey: null },
+  pan: {},
   zoom: {
     wheel: { enabled: false, speed: 0.1, modifierKey: null },

[Survived] BooleanLiteral
src/zoomPlugin.ts:1154:23
 const DEFAULT_OPTIONS: ZoomPluginOptions = {
   pan: { enabled: false, mode: 'xy', threshold: 10, modifierKey: null },
   zoom: {
-    wheel: { enabled: false, speed: 0.1, modifierKey: null },
+    wheel: { enabled: true, speed: 0.1, modifierKey: null },
     drag: { enabled: false, drawTime: 'beforeDatasetsDraw', modifierKey: null },
     pinch: { enabled: false },

[Survived] BooleanLiteral
src/zoomPlugin.ts:1155:22
   pan: { enabled: false, mode: 'xy', threshold: 10, modifierKey: null },
   zoom: {
     wheel: { enabled: false, speed: 0.1, modifierKey: null },
-    drag: { enabled: false, drawTime: 'beforeDatasetsDraw', modifierKey: null },
+    drag: { enabled: true, drawTime: 'beforeDatasetsDraw', modifierKey: null },
     pinch: { enabled: false },
     mode: 'xy',

[Survived] StringLiteral
src/zoomPlugin.ts:1155:39
   pan: { enabled: false, mode: 'xy', threshold: 10, modifierKey: null },
   zoom: {
     wheel: { enabled: false, speed: 0.1, modifierKey: null },
-    drag: { enabled: false, drawTime: 'beforeDatasetsDraw', modifierKey: null },
+    drag: { enabled: false, drawTime: "", modifierKey: null },
     pinch: { enabled: false },
     mode: 'xy',

[Survived] BooleanLiteral
src/zoomPlugin.ts:1156:23
   zoom: {
     wheel: { enabled: false, speed: 0.1, modifierKey: null },
     drag: { enabled: false, drawTime: 'beforeDatasetsDraw', modifierKey: null },
-    pinch: { enabled: false },
+    pinch: { enabled: true },
     mode: 'xy',
   },

[Survived] ObjectLiteral
src/zoomPlugin.ts:1156:12
   zoom: {
     wheel: { enabled: false, speed: 0.1, modifierKey: null },
     drag: { enabled: false, drawTime: 'beforeDatasetsDraw', modifierKey: null },
-    pinch: { enabled: false },
+    pinch: {},
     mode: 'xy',
   },

[Killed] BlockStatement
src/zoomPlugin.ts:1174:64
 export const zoomPlugin: Plugin<ChartType, ZoomPluginOptions> = {
   id: 'zoom',
 
-  start(chart: Chart, _args, options: ZoomPluginOptions): void {
-    const state = getState(chart);
-    state.options = options;
-    const chartWithApi = chart as Chart & Record<string, unknown>;
-    chartWithApi.pan = (delta: number | { x?: number; y?: number }, enabledScales?: LiveScale[], transition?: string) => pan(chart, delta, enabledScales, transition);
-    chartWithApi.zoom = (amount: ZoomAmount, transition?: string) => zoom(chart, amount, transition);
-    chartWithApi.zoomRect = (p0: ScreenPoint, p1: ScreenPoint, transition?: string) => zoomRect(chart, p0, p1, transition);
-    chartWithApi.zoomScale = (id: string, range: { min: number; max: number }, transition?: string) => zoomScale(chart, id, range, transition);
-    chartWithApi.resetZoom = (transition?: string) => resetZoom(chart, transition);
-    chartWithApi.getZoomLevel = () => getZoomLevel(chart);
-    chartWithApi.getInitialScaleBounds = () => getInitialScaleBounds(chart);
-    chartWithApi.getZoomedScaleBounds = () => getZoomedScaleBounds(chart);
-    chartWithApi.isZoomedOrPanned = () => isZoomedOrPanned(chart);
-    chartWithApi.isZoomingOrPanning = () => isZoomingOrPanning(chart);
-  },
+  start(chart: Chart, _args, options: ZoomPluginOptions): void {},
 
   beforeEvent(chart: Chart, args): boolean | void {
killedBy: zoomPlugin start attaches the full programmatic API onto the live chart instance
statusReason: expected undefined to deeply equal Any<Function>

[Killed] ArrowFunction
src/zoomPlugin.ts:1178:24
     const state = getState(chart);
     state.options = options;
     const chartWithApi = chart as Chart & Record<string, unknown>;
-    chartWithApi.pan = (delta: number | { x?: number; y?: number }, enabledScales?: LiveScale[], transition?: string) => pan(chart, delta, enabledScales, transition);
+    chartWithApi.pan = () => undefined;
     chartWithApi.zoom = (amount: ZoomAmount, transition?: string) => zoom(chart, amount, transition);
     chartWithApi.zoomRect = (p0: ScreenPoint, p1: ScreenPoint, transition?: string) => zoomRect(chart, p0, p1, transition);
killedBy: zoomPlugin programmatic pan() shifts the scale range by the given delta, without changing its span, and calls chart.update
statusReason: expected NaN to be close to 100, received difference is NaN, but expected 0.05

[Killed] ArrowFunction
src/zoomPlugin.ts:1179:25
     state.options = options;
     const chartWithApi = chart as Chart & Record<string, unknown>;
     chartWithApi.pan = (delta: number | { x?: number; y?: number }, enabledScales?: LiveScale[], transition?: string) => pan(chart, delta, enabledScales, transition);
-    chartWithApi.zoom = (amount: ZoomAmount, transition?: string) => zoom(chart, amount, transition);
+    chartWithApi.zoom = () => undefined;
     chartWithApi.zoomRect = (p0: ScreenPoint, p1: ScreenPoint, transition?: string) => zoomRect(chart, p0, p1, transition);
     chartWithApi.zoomScale = (id: string, range: { min: number; max: number }, transition?: string) => zoomScale(chart, id, range, transition);
killedBy: zoomPlugin programmatic zoom() zooms in the enabled directions, changing scale.options.min/max, and calls chart.update
statusReason: expected undefined to be defined

[Killed] ArrowFunction
src/zoomPlugin.ts:1180:29
     const chartWithApi = chart as Chart & Record<string, unknown>;
     chartWithApi.pan = (delta: number | { x?: number; y?: number }, enabledScales?: LiveScale[], transition?: string) => pan(chart, delta, enabledScales, transition);
     chartWithApi.zoom = (amount: ZoomAmount, transition?: string) => zoom(chart, amount, transition);
-    chartWithApi.zoomRect = (p0: ScreenPoint, p1: ScreenPoint, transition?: string) => zoomRect(chart, p0, p1, transition);
+    chartWithApi.zoomRect = () => undefined;
     chartWithApi.zoomScale = (id: string, range: { min: number; max: number }, transition?: string) => zoomScale(chart, id, range, transition);
     chartWithApi.resetZoom = (transition?: string) => resetZoom(chart, transition);
killedBy: zoomPlugin programmatic zoom() resolves mode as a function of the chart, not just a string literal
statusReason: expected undefined to be defined

[Killed] ArrowFunction
src/zoomPlugin.ts:1181:30
     chartWithApi.pan = (delta: number | { x?: number; y?: number }, enabledScales?: LiveScale[], transition?: string) => pan(chart, delta, enabledScales, transition);
     chartWithApi.zoom = (amount: ZoomAmount, transition?: string) => zoom(chart, amount, transition);
     chartWithApi.zoomRect = (p0: ScreenPoint, p1: ScreenPoint, transition?: string) => zoomRect(chart, p0, p1, transition);
-    chartWithApi.zoomScale = (id: string, range: { min: number; max: number }, transition?: string) => zoomScale(chart, id, range, transition);
+    chartWithApi.zoomScale = () => undefined;
     chartWithApi.resetZoom = (transition?: string) => resetZoom(chart, transition);
     chartWithApi.getZoomLevel = () => getZoomLevel(chart);
killedBy: zoomPlugin programmatic zoom() reports isZoomedOrPanned true from a max-only change too, not just a min change
statusReason: expected false to be true // Object.is equality
