[Killed] ArrowFunction
src/zoomPlugin.ts:1182:30
     chartWithApi.zoom = (amount: ZoomAmount, transition?: string) => zoom(chart, amount, transition);
     chartWithApi.zoomRect = (p0: ScreenPoint, p1: ScreenPoint, transition?: string) => zoomRect(chart, p0, p1, transition);
     chartWithApi.zoomScale = (id: string, range: { min: number; max: number }, transition?: string) => zoomScale(chart, id, range, transition);
-    chartWithApi.resetZoom = (transition?: string) => resetZoom(chart, transition);
+    chartWithApi.resetZoom = () => undefined;
     chartWithApi.getZoomLevel = () => getZoomLevel(chart);
     chartWithApi.getInitialScaleBounds = () => getInitialScaleBounds(chart);
killedBy: zoomPlugin programmatic resetZoom() restores each scale to its original min/max options, clearing any zoom applied since
statusReason: expected 100 to be 5 // Object.is equality

[Killed] ArrowFunction
src/zoomPlugin.ts:1183:33
     chartWithApi.zoomRect = (p0: ScreenPoint, p1: ScreenPoint, transition?: string) => zoomRect(chart, p0, p1, transition);
     chartWithApi.zoomScale = (id: string, range: { min: number; max: number }, transition?: string) => zoomScale(chart, id, range, transition);
     chartWithApi.resetZoom = (transition?: string) => resetZoom(chart, transition);
-    chartWithApi.getZoomLevel = () => getZoomLevel(chart);
+    chartWithApi.getZoomLevel = () => undefined;
     chartWithApi.getInitialScaleBounds = () => getInitialScaleBounds(chart);
     chartWithApi.getZoomedScaleBounds = () => getZoomedScaleBounds(chart);
killedBy: zoomPlugin programmatic zoom() zooms out, producing a zoom level below 1 (getZoomLevel's own min<1 branch, not just the max branch)
statusReason: actual value must be number or bigint, received "undefined"

[Killed] ArrowFunction
src/zoomPlugin.ts:1184:42
     chartWithApi.zoomScale = (id: string, range: { min: number; max: number }, transition?: string) => zoomScale(chart, id, range, transition);
     chartWithApi.resetZoom = (transition?: string) => resetZoom(chart, transition);
     chartWithApi.getZoomLevel = () => getZoomLevel(chart);
-    chartWithApi.getInitialScaleBounds = () => getInitialScaleBounds(chart);
+    chartWithApi.getInitialScaleBounds = () => undefined;
     chartWithApi.getZoomedScaleBounds = () => getZoomedScaleBounds(chart);
     chartWithApi.isZoomedOrPanned = () => isZoomedOrPanned(chart);
killedBy: zoomPlugin getInitialScaleBounds / getZoomedScaleBounds reports the original bounds before zoom, and the updated bounds after
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] ArrowFunction
src/zoomPlugin.ts:1185:41
     chartWithApi.resetZoom = (transition?: string) => resetZoom(chart, transition);
     chartWithApi.getZoomLevel = () => getZoomLevel(chart);
     chartWithApi.getInitialScaleBounds = () => getInitialScaleBounds(chart);
-    chartWithApi.getZoomedScaleBounds = () => getZoomedScaleBounds(chart);
+    chartWithApi.getZoomedScaleBounds = () => undefined;
     chartWithApi.isZoomedOrPanned = () => isZoomedOrPanned(chart);
     chartWithApi.isZoomingOrPanning = () => isZoomingOrPanning(chart);
killedBy: zoomPlugin getInitialScaleBounds / getZoomedScaleBounds reports the original bounds before zoom, and the updated bounds after
statusReason: Cannot read properties of undefined (reading 'x')

[Killed] ArrowFunction
src/zoomPlugin.ts:1186:37
     chartWithApi.getZoomLevel = () => getZoomLevel(chart);
     chartWithApi.getInitialScaleBounds = () => getInitialScaleBounds(chart);
     chartWithApi.getZoomedScaleBounds = () => getZoomedScaleBounds(chart);
-    chartWithApi.isZoomedOrPanned = () => isZoomedOrPanned(chart);
+    chartWithApi.isZoomedOrPanned = () => undefined;
     chartWithApi.isZoomingOrPanning = () => isZoomingOrPanning(chart);
   },
killedBy: zoomPlugin programmatic zoom() reports isZoomedOrPanned true from a max-only change too, not just a min change
statusReason: expected undefined to be true // Object.is equality

[Killed] ArrowFunction
src/zoomPlugin.ts:1187:39
     chartWithApi.getInitialScaleBounds = () => getInitialScaleBounds(chart);
     chartWithApi.getZoomedScaleBounds = () => getZoomedScaleBounds(chart);
     chartWithApi.isZoomedOrPanned = () => isZoomedOrPanned(chart);
-    chartWithApi.isZoomingOrPanning = () => isZoomingOrPanning(chart);
+    chartWithApi.isZoomingOrPanning = () => undefined;
   },
 
killedBy: zoomPlugin getZoomLevel / isZoomedOrPanned / isZoomingOrPanning reports isZoomingOrPanning false outside of an active drag
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/zoomPlugin.ts:1190:51
     chartWithApi.isZoomingOrPanning = () => isZoomingOrPanning(chart);
   },
 
-  beforeEvent(chart: Chart, args): boolean | void {
-    if (isZoomingOrPanning(chart)) return false;
-    const event = args.event;
-    if (event.type === 'click' || event.type === 'mouseup') {
-      const state = getState(chart);
-      if (state.filterNextClick) {
-        state.filterNextClick = false;
-        return false;
-      }
-    }
-  },
+  beforeEvent(chart: Chart, args): boolean | void {},
 
   beforeUpdate(chart: Chart, _args, options: ZoomPluginOptions): void {
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys beforeEvent: suppresses a genuine "mouseup" event too during an active drag, not just "cl
statusReason: expected undefined to be false // Object.is equality

[Killed] BooleanLiteral
src/zoomPlugin.ts:1191:43
   },
 
   beforeEvent(chart: Chart, args): boolean | void {
-    if (isZoomingOrPanning(chart)) return false;
+    if (isZoomingOrPanning(chart)) return true;
     const event = args.event;
     if (event.type === 'click' || event.type === 'mouseup') {
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys beforeEvent: suppresses a genuine "mouseup" event too during an active drag, not just "cl
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:1191:9
   },
 
   beforeEvent(chart: Chart, args): boolean | void {
-    if (isZoomingOrPanning(chart)) return false;
+    if (false) return false;
     const event = args.event;
     if (event.type === 'click' || event.type === 'mouseup') {
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys beforeEvent: suppresses a genuine "mouseup" event too during an active drag, not just "cl
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/zoomPlugin.ts:1193:61
   beforeEvent(chart: Chart, args): boolean | void {
     if (isZoomingOrPanning(chart)) return false;
     const event = args.event;
-    if (event.type === 'click' || event.type === 'mouseup') {
-      const state = getState(chart);
-      if (state.filterNextClick) {
-        state.filterNextClick = false;
-        return false;
-      }
-    }
+    if (event.type === 'click' || event.type === 'mouseup') {}
   },
 
killedBy: zoomPlugin beforeEvent suppresses exactly the one click immediately following a completed drag-to-zoom, then stops suppressing
statusReason: expected undefined to be false // Object.is equality

[Killed] LogicalOperator
src/zoomPlugin.ts:1193:9
   beforeEvent(chart: Chart, args): boolean | void {
     if (isZoomingOrPanning(chart)) return false;
     const event = args.event;
-    if (event.type === 'click' || event.type === 'mouseup') {
+    if (event.type === 'click' && event.type === 'mouseup') {
       const state = getState(chart);
       if (state.filterNextClick) {
killedBy: zoomPlugin beforeEvent suppresses exactly the one click immediately following a completed drag-to-zoom, then stops suppressing
statusReason: expected undefined to be false // Object.is equality

[Killed] BlockStatement
src/zoomPlugin.ts:1195:34
     const event = args.event;
     if (event.type === 'click' || event.type === 'mouseup') {
       const state = getState(chart);
-      if (state.filterNextClick) {
-        state.filterNextClick = false;
-        return false;
-      }
+      if (state.filterNextClick) {}
     }
   },
killedBy: zoomPlugin beforeEvent suppresses exactly the one click immediately following a completed drag-to-zoom, then stops suppressing
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/zoomPlugin.ts:1195:11
     const event = args.event;
     if (event.type === 'click' || event.type === 'mouseup') {
       const state = getState(chart);
-      if (state.filterNextClick) {
+      if (true) {
         state.filterNextClick = false;
         return false;
killedBy: zoomPlugin beforeEvent suppresses exactly the one click immediately following a completed drag-to-zoom, then stops suppressing
statusReason: expected false to be undefined

[Killed] BooleanLiteral
src/zoomPlugin.ts:1196:33
     if (event.type === 'click' || event.type === 'mouseup') {
       const state = getState(chart);
       if (state.filterNextClick) {
-        state.filterNextClick = false;
+        state.filterNextClick = true;
         return false;
       }
killedBy: zoomPlugin beforeEvent suppresses exactly the one click immediately following a completed drag-to-zoom, then stops suppressing
statusReason: expected false to be undefined

[Killed] BooleanLiteral
src/zoomPlugin.ts:1197:16
       const state = getState(chart);
       if (state.filterNextClick) {
         state.filterNextClick = false;
-        return false;
+        return true;
       }
     }
killedBy: zoomPlugin beforeEvent suppresses exactly the one click immediately following a completed drag-to-zoom, then stops suppressing
statusReason: expected true to be false // Object.is equality

[Killed] BlockStatement
src/zoomPlugin.ts:1202:71
     }
   },
 
-  beforeUpdate(chart: Chart, _args, options: ZoomPluginOptions): void {
-    const state = getState(chart);
-    state.options = options;
-    addListeners(chart, options);
-  },
+  beforeUpdate(chart: Chart, _args, options: ZoomPluginOptions): void {},
 
   beforeDatasetsDraw(chart: Chart, _args, options: ZoomPluginOptions): void {
killedBy: zoomPlugin wheel-zoom interaction zooms in on a real wheel event when wheel.enabled is true
statusReason: expected undefined to be defined

[Survived] BlockStatement
src/zoomPlugin.ts:1208:77
     addListeners(chart, options);
   },
 
-  beforeDatasetsDraw(chart: Chart, _args, options: ZoomPluginOptions): void {
-    drawDragOverlay(chart, 'beforeDatasetsDraw', options);
-  },
+  beforeDatasetsDraw(chart: Chart, _args, options: ZoomPluginOptions): void {},
   afterDatasetsDraw(chart: Chart, _args, options: ZoomPluginOptions): void {
     drawDragOverlay(chart, 'afterDatasetsDraw', options);

[Killed] BlockStatement
src/zoomPlugin.ts:1211:76
   beforeDatasetsDraw(chart: Chart, _args, options: ZoomPluginOptions): void {
     drawDragOverlay(chart, 'beforeDatasetsDraw', options);
   },
-  afterDatasetsDraw(chart: Chart, _args, options: ZoomPluginOptions): void {
-    drawDragOverlay(chart, 'afterDatasetsDraw', options);
-  },
+  afterDatasetsDraw(chart: Chart, _args, options: ZoomPluginOptions): void {},
   beforeDraw(chart: Chart, _args, options: ZoomPluginOptions): void {
     drawDragOverlay(chart, 'beforeDraw', options);
killedBy: zoomPlugin drag-rectangle overlay drawing draws the drag overlay via the configured drawTime hook while a drag is in progress
statusReason: expected "spy" to be called at least once

[Killed] BlockStatement
src/zoomPlugin.ts:1214:69
   afterDatasetsDraw(chart: Chart, _args, options: ZoomPluginOptions): void {
     drawDragOverlay(chart, 'afterDatasetsDraw', options);
   },
-  beforeDraw(chart: Chart, _args, options: ZoomPluginOptions): void {
-    drawDragOverlay(chart, 'beforeDraw', options);
-  },
+  beforeDraw(chart: Chart, _args, options: ZoomPluginOptions): void {},
   afterDraw(chart: Chart, _args, options: ZoomPluginOptions): void {
     drawDragOverlay(chart, 'afterDraw', options);
killedBy: zoomPlugin precise mutation-hardening part 2: getCenter, invoke() trigger strings, updateRange, panScale, keys drawDragOverlay: falls back to the real default background color when none is configured
statusReason: expected undefined to be 'rgba(225,225,225,0.3)' // Object.is equality

[Killed] BlockStatement
src/zoomPlugin.ts:1217:68
   beforeDraw(chart: Chart, _args, options: ZoomPluginOptions): void {
     drawDragOverlay(chart, 'beforeDraw', options);
   },
-  afterDraw(chart: Chart, _args, options: ZoomPluginOptions): void {
-    drawDragOverlay(chart, 'afterDraw', options);
-  },
+  afterDraw(chart: Chart, _args, options: ZoomPluginOptions): void {},
 
   stop(chart: Chart): void {
killedBy: zoomPlugin drag-rectangle overlay drawing draws via the afterDraw hook too, not just the other three drawTime hooks
statusReason: expected "spy" to be called at least once

[Killed] BlockStatement
src/zoomPlugin.ts:1221:28
     drawDragOverlay(chart, 'afterDraw', options);
   },
 
-  stop(chart: Chart): void {
-    removeListeners(chart);
-    removeState(chart);
-  },
+  stop(chart: Chart): void {},
 
   defaults: DEFAULT_OPTIONS as unknown as Record<string, unknown>,
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) clears touch-action and stops responding to pointer events after stop()
statusReason: expected 'none' to be '' // Object.is equality
