[Killed] BooleanLiteral
src/plugins.ts:13:28
  * singletons, so a dedicated boolean each is simpler than a generic
  * cache for a fixed, small set.
  */
-let annotationRegistered = false;
+let annotationRegistered = true;
 let dataLabelsRegistered = false;
 let timestackRegistered = false;
killedBy: mod.default ?? mod fallback (a plugin package with no default export) withAnnotation registers the module namespace itself when there is no default export
statusReason: expected "spy" to be called with arguments: [ { default: undefined, …(1) } ]

Received: 



Number of calls: 0

[Killed] BooleanLiteral
src/plugins.ts:14:28
  * cache for a fixed, small set.
  */
 let annotationRegistered = false;
-let dataLabelsRegistered = false;
+let dataLabelsRegistered = true;
 let timestackRegistered = false;
 let hierarchicalRegistered = false;
killedBy: mod.default ?? mod fallback (a plugin package with no default export) withDataLabels registers the module namespace itself when there is no default export
statusReason: expected "spy" to be called with arguments: [ { default: undefined, …(1) } ]

Received: 



Number of calls: 0

[Survived] BooleanLiteral
src/plugins.ts:15:27
  */
 let annotationRegistered = false;
 let dataLabelsRegistered = false;
-let timestackRegistered = false;
+let timestackRegistered = true;
 let hierarchicalRegistered = false;
 

[Killed] BooleanLiteral
src/plugins.ts:16:30
 let annotationRegistered = false;
 let dataLabelsRegistered = false;
 let timestackRegistered = false;
-let hierarchicalRegistered = false;
+let hierarchicalRegistered = true;
 
 type Options = NonNullable<ChartConfiguration['options']>;
killedBy: withHierarchical — fresh-module registration (kills the initial-flag-value mutant) registers on the very first call against a freshly-imported module instance
statusReason: expected "spy" to be called with arguments: [ { id: 'hierarchical-fresh' } ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/plugins.ts:36:135
  * zoomPlugin.ts's own header comment for the real scope this port
  * covers — notably, no Hammer.js-dependent pinch/gesture-pan support).
  */
-export async function withZoom(options: Options, zoomOptions: ZoomPluginOptions = {}): Promise<{ options: Options; plugin: unknown }> {
-  return {
-    options: {
-      ...options,
-      plugins: {
-        ...options.plugins,
-        // Cast needed: Chart.js's own `PluginOptionsByType` has no
-        // knowledge of this local plugin's own option shape — safe at
-        // runtime since Chart.js itself does no compile-time shape
-        // checking, only reads whatever object is actually passed.
-        zoom: zoomOptions,
-      } as Options['plugins'],
-    },
-    plugin: zoomPlugin,
-  };
-}
+export async function withZoom(options: Options, zoomOptions: ZoomPluginOptions = {}): Promise<{ options: Options; plugin: unknown }> {}
 
 /**
killedBy: withZoom merges pan/zoom options into options.plugins.zoom without touching other plugins entries
statusReason: Cannot read properties of undefined (reading 'options')

[Killed] BooleanLiteral
src/plugins.ts:60:7
  * without touching any other existing `plugins.*` entries.
  */
 export async function withAnnotation(options: Options, annotationOptions: AnnotationPluginOptions): Promise<Options> {
-  if (!annotationRegistered) {
+  if (annotationRegistered) {
     // Stryker disable next-line StringLiteral: see withZoom's own comment
     // above for the full reasoning — same issue, same fix.
killedBy: withAnnotation registers the plugin exactly once no matter how many times it is called
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/plugins.ts:60:7
  * without touching any other existing `plugins.*` entries.
  */
 export async function withAnnotation(options: Options, annotationOptions: AnnotationPluginOptions): Promise<Options> {
-  if (!annotationRegistered) {
+  if (true) {
     // Stryker disable next-line StringLiteral: see withZoom's own comment
     // above for the full reasoning — same issue, same fix.
killedBy: withAnnotation registers the plugin exactly once no matter how many times it is called
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] LogicalOperator
src/plugins.ts:64:20
     // Stryker disable next-line StringLiteral: see withZoom's own comment
     // above for the full reasoning — same issue, same fix.
     const mod = await import(/* @vite-ignore */ 'chartjs-plugin-annotation');
-    Chart.register(mod.default ?? mod);
+    Chart.register(mod.default && mod);
     annotationRegistered = true;
   }
killedBy: withAnnotation registers the plugin exactly once no matter how many times it is called
statusReason: [vitest] No "$$typeof" export is defined on the "chartjs-plugin-annotation" mock. Did you forget to return it from "vi.mock"?
If you need to partially mock a module, you can use "importOriginal" helper inside:

[Killed] BooleanLiteral
src/plugins.ts:65:28
     // above for the full reasoning — same issue, same fix.
     const mod = await import(/* @vite-ignore */ 'chartjs-plugin-annotation');
     Chart.register(mod.default ?? mod);
-    annotationRegistered = true;
+    annotationRegistered = false;
   }
   return {
killedBy: withAnnotation registers the plugin exactly once no matter how many times it is called
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/plugins.ts:94:123
  * the given config merged into `options.plugins.datalabels`, without
  * touching any other existing `plugins.*` entries.
  */
-export async function withDataLabels(options: Options, dataLabelsOptions: DataLabelsPluginOptions = {}): Promise<Options> {
-  if (!dataLabelsRegistered) {
-    // Stryker disable next-line StringLiteral: see withZoom's own comment
-    // above for the full reasoning — same issue, same fix.
-    const mod = await import(/* @vite-ignore */ 'chartjs-plugin-datalabels');
-    Chart.register(mod.default ?? mod);
-    dataLabelsRegistered = true;
-  }
-  return {
-    ...options,
-    plugins: {
-      ...options.plugins,
-      datalabels: dataLabelsOptions,
-    },
-  };
-}
+export async function withDataLabels(options: Options, dataLabelsOptions: DataLabelsPluginOptions = {}): Promise<Options> {}
 
 /**
killedBy: withDataLabels merges options into options.plugins.datalabels without touching other plugins entries
statusReason: Cannot read properties of undefined (reading 'plugins')

[Killed] BooleanLiteral
src/plugins.ts:95:7
  * touching any other existing `plugins.*` entries.
  */
 export async function withDataLabels(options: Options, dataLabelsOptions: DataLabelsPluginOptions = {}): Promise<Options> {
-  if (!dataLabelsRegistered) {
+  if (dataLabelsRegistered) {
     // Stryker disable next-line StringLiteral: see withZoom's own comment
     // above for the full reasoning — same issue, same fix.
killedBy: withDataLabels registers the plugin exactly once no matter how many times it is called
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/plugins.ts:95:30
  * touching any other existing `plugins.*` entries.
  */
 export async function withDataLabels(options: Options, dataLabelsOptions: DataLabelsPluginOptions = {}): Promise<Options> {
-  if (!dataLabelsRegistered) {
-    // Stryker disable next-line StringLiteral: see withZoom's own comment
-    // above for the full reasoning — same issue, same fix.
-    const mod = await import(/* @vite-ignore */ 'chartjs-plugin-datalabels');
-    Chart.register(mod.default ?? mod);
-    dataLabelsRegistered = true;
-  }
+  if (!dataLabelsRegistered) {}
   return {
     ...options,
killedBy: withDataLabels registers the plugin exactly once no matter how many times it is called
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] LogicalOperator
src/plugins.ts:99:20
     // Stryker disable next-line StringLiteral: see withZoom's own comment
     // above for the full reasoning — same issue, same fix.
     const mod = await import(/* @vite-ignore */ 'chartjs-plugin-datalabels');
-    Chart.register(mod.default ?? mod);
+    Chart.register(mod.default && mod);
     dataLabelsRegistered = true;
   }
killedBy: withDataLabels registers the plugin exactly once no matter how many times it is called
statusReason: [vitest] No "$$typeof" export is defined on the "chartjs-plugin-datalabels" mock. Did you forget to return it from "vi.mock"?
If you need to partially mock a module, you can use "importOriginal" helper inside:

[Killed] BooleanLiteral
src/plugins.ts:100:28
     // above for the full reasoning — same issue, same fix.
     const mod = await import(/* @vite-ignore */ 'chartjs-plugin-datalabels');
     Chart.register(mod.default ?? mod);
-    dataLabelsRegistered = true;
+    dataLabelsRegistered = false;
   }
   return {
killedBy: withDataLabels registers the plugin exactly once no matter how many times it is called
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] BlockStatement
src/plugins.ts:133:102
  * (registration only), unlike `zoom`/`dataLabels` (boolean-or-config-
  * object) or `annotation` (config-object required).
  */
-export async function withGradient(options: Options): Promise<{ options: Options; plugin: unknown }> {
-  return { options, plugin: gradientPlugin };
-}
+export async function withGradient(options: Options): Promise<{ options: Options; plugin: unknown }> {}
 
 /**
killedBy: withGradient returns options completely unchanged — there is no plugin-level config to merge
statusReason: Cannot read properties of undefined (reading 'options')

[Killed] ObjectLiteral
src/plugins.ts:134:10
  * object) or `annotation` (config-object required).
  */
 export async function withGradient(options: Options): Promise<{ options: Options; plugin: unknown }> {
-  return { options, plugin: gradientPlugin };
+  return {};
 }
 
killedBy: withGradient returns options completely unchanged — there is no plugin-level config to merge
statusReason: expected undefined to deeply equal { plugins: { legend: { …(1) } } }

[Killed] BlockStatement
src/plugins.ts:185:73
  * `Chart.register(HierarchicalScale)` call gives every one of its own
  * guard mutations a real, observable side effect to fail against.
  */
-export async function withTimestack(options: Options): Promise<Options> {
-  if (!timestackRegistered) {
-    // Stryker disable next-line StringLiteral: see withZoom's own comment
-    // above for the full reasoning — same issue, same fix.
-    await import(/* @vite-ignore */ 'chartjs-scale-timestack');
-    timestackRegistered = true;
-  }
-  return options;
-}
+export async function withTimestack(options: Options): Promise<Options> {}
 
 /**
killedBy: withTimestack returns options completely unchanged — like withGradient, there is no plugin-level config to merge
statusReason: expected undefined to deeply equal { plugins: { legend: { …(1) } } }

[Survived] BlockStatement
src/plugins.ts:186:29
  * guard mutations a real, observable side effect to fail against.
  */
 export async function withTimestack(options: Options): Promise<Options> {
-  if (!timestackRegistered) {
-    // Stryker disable next-line StringLiteral: see withZoom's own comment
-    // above for the full reasoning — same issue, same fix.
-    await import(/* @vite-ignore */ 'chartjs-scale-timestack');
-    timestackRegistered = true;
-  }
+  if (!timestackRegistered) {}
   return options;
 }

[Survived] ConditionalExpression
src/plugins.ts:186:7
  * guard mutations a real, observable side effect to fail against.
  */
 export async function withTimestack(options: Options): Promise<Options> {
-  if (!timestackRegistered) {
+  if (false) {
     // Stryker disable next-line StringLiteral: see withZoom's own comment
     // above for the full reasoning — same issue, same fix.

[Survived] BooleanLiteral
src/plugins.ts:190:27
     // Stryker disable next-line StringLiteral: see withZoom's own comment
     // above for the full reasoning — same issue, same fix.
     await import(/* @vite-ignore */ 'chartjs-scale-timestack');
-    timestackRegistered = true;
+    timestackRegistered = false;
   }
   return options;

[Killed] BlockStatement
src/plugins.ts:227:76
  * either, but a real, meaningfully different shape a consumer needs to
  * know about (see the docs site's own example).
  */
-export async function withHierarchical(options: Options): Promise<Options> {
-  if (!hierarchicalRegistered) {
-    // Stryker disable next-line StringLiteral: see withZoom's own comment
-    // above for the full reasoning — same issue, same fix.
-    const mod = await import(/* @vite-ignore */ 'chartjs-plugin-hierarchical');
-    Chart.register(mod.HierarchicalScale);
-    hierarchicalRegistered = true;
-  }
-  return options;
-}
+export async function withHierarchical(options: Options): Promise<Options> {}
 
 /**
killedBy: withHierarchical returns options completely unchanged — like withGradient/withTimestack, there is no plugin-level config to merge
statusReason: expected undefined to deeply equal { plugins: { legend: { …(1) } } }

[Killed] BooleanLiteral
src/plugins.ts:228:7
  * know about (see the docs site's own example).
  */
 export async function withHierarchical(options: Options): Promise<Options> {
-  if (!hierarchicalRegistered) {
+  if (hierarchicalRegistered) {
     // Stryker disable next-line StringLiteral: see withZoom's own comment
     // above for the full reasoning — same issue, same fix.
killedBy: withHierarchical registers via its own real, confirmed named export (HierarchicalScale), not mod.default ?? mod
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/plugins.ts:228:32
  * know about (see the docs site's own example).
  */
 export async function withHierarchical(options: Options): Promise<Options> {
-  if (!hierarchicalRegistered) {
-    // Stryker disable next-line StringLiteral: see withZoom's own comment
-    // above for the full reasoning — same issue, same fix.
-    const mod = await import(/* @vite-ignore */ 'chartjs-plugin-hierarchical');
-    Chart.register(mod.HierarchicalScale);
-    hierarchicalRegistered = true;
-  }
+  if (!hierarchicalRegistered) {}
   return options;
 }
killedBy: withHierarchical registers via its own real, confirmed named export (HierarchicalScale), not mod.default ?? mod
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/plugins.ts:233:30
     // above for the full reasoning — same issue, same fix.
     const mod = await import(/* @vite-ignore */ 'chartjs-plugin-hierarchical');
     Chart.register(mod.HierarchicalScale);
-    hierarchicalRegistered = true;
+    hierarchicalRegistered = false;
   }
   return options;
killedBy: withHierarchical registers the scale exactly once no matter how many times it is called
statusReason: expected "spy" to be called 1 times, but got 3 times

[Killed] BlockStatement
src/plugins.ts:256:51
 export async function withImageLabel(
   options: Options,
   imageLabelOptions: ImageLabelPluginOptions,
-): Promise<{ options: Options; plugin: unknown }> {
-  return {
-    options: {
-      ...options,
-      plugins: {
-        ...options.plugins,
-        // Cast needed: Chart.js's own `PluginOptionsByType` has no
-        // knowledge of `imageLabel` as a valid key at all — this is a
-        // local plugin, not one with any type augmentation to Chart.js's
-        // own types. Safe at runtime: Chart.js itself does no
-        // compile-time shape checking, only reads whatever object is
-        // actually passed — imageLabelPlugin.ts's own `afterDraw` reads
-        // this key directly.
-        imageLabel: imageLabelOptions,
-      } as Options['plugins'],
-    },
-    plugin: imageLabelPlugin,
-  };
-}
+): Promise<{ options: Options; plugin: unknown }> {}
 
 /**
killedBy: withImageLabel merges the given config into options.plugins.imageLabel without touching other plugins entries
statusReason: Cannot read properties of undefined (reading 'options')

[Killed] BlockStatement
src/plugins.ts:285:48
  * no module-level registration cache left, since porting each one in
  * removed its own dynamic import entirely.)
  */
-export function __resetPluginsForTests(): void {
-  annotationRegistered = false;
-  dataLabelsRegistered = false;
-  timestackRegistered = false;
-  hierarchicalRegistered = false;
-}
+export function __resetPluginsForTests(): void {}
 
killedBy: withAnnotation registers the plugin exactly once no matter how many times it is called
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/plugins.ts:286:26
  * removed its own dynamic import entirely.)
  */
 export function __resetPluginsForTests(): void {
-  annotationRegistered = false;
+  annotationRegistered = true;
   dataLabelsRegistered = false;
   timestackRegistered = false;
killedBy: withAnnotation registers the plugin exactly once no matter how many times it is called
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BooleanLiteral
src/plugins.ts:287:26
  */
 export function __resetPluginsForTests(): void {
   annotationRegistered = false;
-  dataLabelsRegistered = false;
+  dataLabelsRegistered = true;
   timestackRegistered = false;
   hierarchicalRegistered = false;
killedBy: withDataLabels registers the plugin exactly once no matter how many times it is called
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] BooleanLiteral
src/plugins.ts:288:25
 export function __resetPluginsForTests(): void {
   annotationRegistered = false;
   dataLabelsRegistered = false;
-  timestackRegistered = false;
+  timestackRegistered = true;
   hierarchicalRegistered = false;
 }

[Killed] BooleanLiteral
src/plugins.ts:289:28
   annotationRegistered = false;
   dataLabelsRegistered = false;
   timestackRegistered = false;
-  hierarchicalRegistered = false;
+  hierarchicalRegistered = true;
 }
 
killedBy: withHierarchical registers via its own real, confirmed named export (HierarchicalScale), not mod.default ?? mod
statusReason: expected "spy" to be called 1 times, but got 0 times
