[Killed] StringLiteral
src/registry.ts:144:10
  */
 async function importExtensionModule(kind: ChartKind): Promise<Record<string, unknown>> {
   switch (kind) {
-    case 'candlestick':
+    case "":
     case 'ohlc':
       // Stryker disable next-line StringLiteral
killedBy: ensureChartKindRegistered registers candlestick on first use, with both of its expected exports
statusReason: keystone-chartjs-core: no extension package registered for chart kind "candlestick"

[Killed] ConditionalExpression
src/registry.ts:145:5
 async function importExtensionModule(kind: ChartKind): Promise<Record<string, unknown>> {
   switch (kind) {
     case 'candlestick':
-    case 'ohlc':
-      // Stryker disable next-line StringLiteral
-      return import('chartjs-chart-financial');
+    case 'ohlc':
     case 'boxplot':
     case 'violin':
killedBy: ensureChartKindRegistered registers candlestick on first use, with both of its expected exports
statusReason: [vitest] No "CandlestickController" export is defined on the "@sgratzl/chartjs-chart-boxplot" mock. Did you forget to return it from "vi.mock"?
If you need to partially mock a module, you can use "importOriginal" helper inside:

[Killed] StringLiteral
src/registry.ts:148:10
     case 'ohlc':
       // Stryker disable next-line StringLiteral
       return import('chartjs-chart-financial');
-    case 'boxplot':
+    case "":
     case 'violin':
       // Stryker disable next-line StringLiteral
killedBy: ensureChartKindRegistered registers boxplot on first use, with both of its expected exports
statusReason: keystone-chartjs-core: no extension package registered for chart kind "boxplot"

[Killed] ConditionalExpression
src/registry.ts:149:5
       // Stryker disable next-line StringLiteral
       return import('chartjs-chart-financial');
     case 'boxplot':
-    case 'violin':
-      // Stryker disable next-line StringLiteral
-      return import('@sgratzl/chartjs-chart-boxplot');
+    case 'violin':
     case 'matrix':
       // Stryker disable next-line StringLiteral
killedBy: ensureChartKindRegistered registers boxplot on first use, with both of its expected exports
statusReason: [vitest] No "BoxPlotController" export is defined on the "chartjs-chart-matrix" mock. Did you forget to return it from "vi.mock"?
If you need to partially mock a module, you can use "importOriginal" helper inside:

[Killed] ConditionalExpression
src/registry.ts:152:5
     case 'violin':
       // Stryker disable next-line StringLiteral
       return import('@sgratzl/chartjs-chart-boxplot');
-    case 'matrix':
-      // Stryker disable next-line StringLiteral
-      return import('chartjs-chart-matrix');
+    case 'matrix':
     case 'sankey':
       // Stryker disable next-line StringLiteral
killedBy: ensureChartKindRegistered registers matrix on first use, with both of its expected exports
statusReason: [vitest] No "MatrixController" export is defined on the "chartjs-chart-sankey" mock. Did you forget to return it from "vi.mock"?
If you need to partially mock a module, you can use "importOriginal" helper inside:

[Killed] StringLiteral
src/registry.ts:152:10
     case 'violin':
       // Stryker disable next-line StringLiteral
       return import('@sgratzl/chartjs-chart-boxplot');
-    case 'matrix':
+    case "":
       // Stryker disable next-line StringLiteral
       return import('chartjs-chart-matrix');
killedBy: ensureChartKindRegistered registers matrix on first use, with both of its expected exports
statusReason: keystone-chartjs-core: no extension package registered for chart kind "matrix"

[Killed] ConditionalExpression
src/registry.ts:155:5
     case 'matrix':
       // Stryker disable next-line StringLiteral
       return import('chartjs-chart-matrix');
-    case 'sankey':
-      // Stryker disable next-line StringLiteral
-      return import('chartjs-chart-sankey');
+    case 'sankey':
     case 'treemap':
       // Stryker disable next-line StringLiteral
killedBy: createChartController — mount registers every kind present across mixed-chart datasets, not just the top-level type
statusReason: keystone-chartjs-core: expected "chartjs-chart-sankey" to export "SankeyController" for chart kind "sankey", but it did not. The installed version of that package may have renamed or removed this export — see docs/CHARTJS_ANALYSIS.md §3.

[Killed] StringLiteral
src/registry.ts:155:10
     case 'matrix':
       // Stryker disable next-line StringLiteral
       return import('chartjs-chart-matrix');
-    case 'sankey':
+    case "":
       // Stryker disable next-line StringLiteral
       return import('chartjs-chart-sankey');
killedBy: createChartController — mount registers every kind present across mixed-chart datasets, not just the top-level type
statusReason: keystone-chartjs-core: no extension package registered for chart kind "sankey"

[Killed] ConditionalExpression
src/registry.ts:158:5
     case 'sankey':
       // Stryker disable next-line StringLiteral
       return import('chartjs-chart-sankey');
-    case 'treemap':
-      // Stryker disable next-line StringLiteral
-      return import('chartjs-chart-treemap');
+    case 'treemap':
+// Structurally required for TypeScript's own exhaustiveness checking
+// (every switch must return on every code path), but genuinely
+// unreachable at runtime — every real extension kind is already
+// handled by one of the cases above, and `ensureChartKindRegistered`
+// never calls this function at all for a built-in kind. Confirmed
+// via a real `test:coverage` run flagging this exact line, not
+// assumed.
+//
+// The `/* v8 ignore next 2 */` marker below must sit immediately
+// above the `default:`/`throw` pair it's meant to exempt — a real
+// mistake found and fixed here: an earlier version placed the
+// marker four comment lines above instead, which meant it exempted
+// two of *those* comment lines (which needed no coverage anyway)
+// rather than the actual unreachable statement pair, so `test:
+// coverage` kept flagging this line regardless of the marker's
+// presence — confirmed via a real coverage run before and after
+// this fix.
+// Stryker disable all: genuinely unreachable, see the comment above —
+// confirmed via a real mutation run showing both the `default:` case
+// itself and its own throw message as "NoCoverage" (no test can ever
+// reach code that never executes, by definition), not "Survived".
+/* v8 ignore next 2 */
     // Structurally required for TypeScript's own exhaustiveness checking
     // (every switch must return on every code path), but genuinely
killedBy: ensureChartKindRegistered registers treemap on first use, with both of its expected exports
statusReason: keystone-chartjs-core: no extension package registered for chart kind "treemap"
