[Killed] BlockStatement
src/controller.ts:14:70
  * controller's job is registering every kind actually present, not just
  * the top-level one.
  */
-function collectChartKinds(payload: ChartUpdatePayload): ChartKind[] {
-  const kinds = new Set<ChartKind>([payload.type]);
-  const datasets = (payload.data as { datasets?: Array<{ type?: ChartKind }> }).datasets ?? [];
-  for (const dataset of datasets) {
-    if (dataset.type) kinds.add(dataset.type);
-  }
-  return [...kinds];
-}
+function collectChartKinds(payload: ChartUpdatePayload): ChartKind[] {}
 
 async function ensureKindsRegistered(payload: ChartUpdatePayload): Promise<void> {
killedBy: createChartController — mount constructs a Chart.js instance with the given type/data/options
statusReason: Cannot read properties of undefined (reading 'map')

[Killed] LogicalOperator
src/controller.ts:16:20
  */
 function collectChartKinds(payload: ChartUpdatePayload): ChartKind[] {
   const kinds = new Set<ChartKind>([payload.type]);
-  const datasets = (payload.data as { datasets?: Array<{ type?: ChartKind }> }).datasets ?? [];
+  const datasets = (payload.data as {
+  datasets?: Array<{
+    type?: ChartKind;
+  }>;
+}).datasets && [];
   for (const dataset of datasets) {
     if (dataset.type) kinds.add(dataset.type);
killedBy: createChartController — mount tolerates a data object with no datasets key at all (falls back to an empty list when collecting mixed-chart kinds)
statusReason: datasets is not iterable

[Killed] BlockStatement
src/controller.ts:17:35
 function collectChartKinds(payload: ChartUpdatePayload): ChartKind[] {
   const kinds = new Set<ChartKind>([payload.type]);
   const datasets = (payload.data as { datasets?: Array<{ type?: ChartKind }> }).datasets ?? [];
-  for (const dataset of datasets) {
-    if (dataset.type) kinds.add(dataset.type);
-  }
+  for (const dataset of datasets) {}
   return [...kinds];
 }
killedBy: createChartController — mount registers every kind present across mixed-chart datasets, not just the top-level type
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/controller.ts:18:9
   const kinds = new Set<ChartKind>([payload.type]);
   const datasets = (payload.data as { datasets?: Array<{ type?: ChartKind }> }).datasets ?? [];
   for (const dataset of datasets) {
-    if (dataset.type) kinds.add(dataset.type);
+    if (true) kinds.add(dataset.type);
   }
   return [...kinds];
killedBy: createChartController — mount does not attempt to register a kind for a dataset with no type property at all
statusReason: expected "ensureChartKindRegistered" to be called 2 times, but got 3 times

[Killed] ConditionalExpression
src/controller.ts:18:9
   const kinds = new Set<ChartKind>([payload.type]);
   const datasets = (payload.data as { datasets?: Array<{ type?: ChartKind }> }).datasets ?? [];
   for (const dataset of datasets) {
-    if (dataset.type) kinds.add(dataset.type);
+    if (false) kinds.add(dataset.type);
   }
   return [...kinds];
killedBy: createChartController — mount registers every kind present across mixed-chart datasets, not just the top-level type
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/controller.ts:23:82
   return [...kinds];
 }
 
-async function ensureKindsRegistered(payload: ChartUpdatePayload): Promise<void> {
-  await Promise.all(collectChartKinds(payload).map((kind) => ensureChartKindRegistered(kind)));
-}
+async function ensureKindsRegistered(payload: ChartUpdatePayload): Promise<void> {}
 
 function toConfig(payload: ChartUpdatePayload): ChartConfiguration {
killedBy: createChartController — mount registers every kind present across mixed-chart datasets, not just the top-level type
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/controller.ts:24:52
 }
 
 async function ensureKindsRegistered(payload: ChartUpdatePayload): Promise<void> {
-  await Promise.all(collectChartKinds(payload).map((kind) => ensureChartKindRegistered(kind)));
+  await Promise.all(collectChartKinds(payload).map(() => undefined));
 }
 
killedBy: createChartController — mount registers every kind present across mixed-chart datasets, not just the top-level type
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/controller.ts:27:68
   await Promise.all(collectChartKinds(payload).map((kind) => ensureChartKindRegistered(kind)));
 }
 
-function toConfig(payload: ChartUpdatePayload): ChartConfiguration {
-  return {
-    type: payload.type,
-    data: payload.data,
-    options: payload.options,
-    // Passed through untouched — Chart.js's own `ChartConfiguration.plugins`
-    // field is a real, distinct array of per-chart-instance plugin objects,
-    // separate from `options.plugins.<id>` config (which this library's own
-    // 3 official opt-in props handle). `undefined` here is fine: Chart.js
-    // simply omits the field from its own internal config when absent.
-    plugins: payload.plugins,
-  } as ChartConfiguration;
-}
+function toConfig(payload: ChartUpdatePayload): ChartConfiguration {}
 
 /**
killedBy: createChartController — mount constructs a Chart.js instance with the given type/data/options
statusReason: Cannot read properties of undefined (reading 'data')

[Killed] BlockStatement
src/controller.ts:55:47
 function mergeOptionsOneLevel(
   base: NonNullable<ChartConfiguration['options']>,
   patch: NonNullable<ChartConfiguration['options']>,
-): NonNullable<ChartConfiguration['options']> {
-  return { ...base, ...patch };
-}
+): NonNullable<ChartConfiguration['options']> {}
 
 /**
killedBy: createChartController — applyTheme merges the patch into chart.options (one level deep) and calls chart.update(), without touching data
statusReason: Cannot read properties of undefined (reading 'color')

[Killed] ObjectLiteral
src/controller.ts:56:10
   base: NonNullable<ChartConfiguration['options']>,
   patch: NonNullable<ChartConfiguration['options']>,
 ): NonNullable<ChartConfiguration['options']> {
-  return { ...base, ...patch };
+  return {};
 }
 
killedBy: createChartController — applyTheme merges the patch into chart.options (one level deep) and calls chart.update(), without touching data
statusReason: expected undefined to be '#fff' // Object.is equality

[Killed] LogicalOperator
src/controller.ts:102:24
   // destroy-and-recreate even when `type` itself hasn't changed.
   let currentPlugins: ChartConfiguration['plugins'] = initial.plugins;
 
-  const resizeTarget = canvas.parentElement ?? canvas;
+  const resizeTarget = canvas.parentElement && canvas;
   let resizeObserver: ResizeObserver | undefined;
   if (typeof ResizeObserver !== 'undefined') {
killedBy: createChartController — update re-wires the ResizeObserver on the new instance after a plugins-change recreate
statusReason: expected 2nd "spy" call to have been called with [ <div><canvas></canvas></div> ]

[Killed] EqualityOperator
src/controller.ts:104:7
 
   const resizeTarget = canvas.parentElement ?? canvas;
   let resizeObserver: ResizeObserver | undefined;
-  if (typeof ResizeObserver !== 'undefined') {
+  if (typeof ResizeObserver === 'undefined') {
     resizeObserver = new ResizeObserver(() => chart.resize());
     resizeObserver.observe(resizeTarget);
killedBy: createChartController — mount constructs a Chart.js instance with the given type/data/options
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/controller.ts:104:46
 
   const resizeTarget = canvas.parentElement ?? canvas;
   let resizeObserver: ResizeObserver | undefined;
-  if (typeof ResizeObserver !== 'undefined') {
-    resizeObserver = new ResizeObserver(() => chart.resize());
-    resizeObserver.observe(resizeTarget);
-  }
+  if (typeof ResizeObserver !== 'undefined') {}
 
   const handle: ChartControllerHandle = {
killedBy: createChartController — mount constructs a Chart.js instance with the given type/data/options
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/controller.ts:105:41
   const resizeTarget = canvas.parentElement ?? canvas;
   let resizeObserver: ResizeObserver | undefined;
   if (typeof ResizeObserver !== 'undefined') {
-    resizeObserver = new ResizeObserver(() => chart.resize());
+    resizeObserver = new ResizeObserver(() => undefined);
     resizeObserver.observe(resizeTarget);
   }
killedBy: createChartController — resize wires a ResizeObserver on the canvas parent that calls chart.resize() when triggered
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/controller.ts:110:17
   }
 
   const handle: ChartControllerHandle = {
-    get chart() {
-      return chart;
-    },
+    get chart() {},
 
     async update(next: ChartUpdatePayload): Promise<void> {
killedBy: createChartController — mount constructs a Chart.js instance with the given type/data/options
statusReason: Cannot read properties of undefined (reading 'config')

[Killed] ConditionalExpression
src/controller.ts:121:11
       // controller.
       await ensureKindsRegistered(next);
 
-      if (next.type === currentType) {
+      if (true) {
         // In place: same top-level type — per the acceptance criterion in
         // docs/IMPLEMENTATION_PLAN.md Phase 1 ("only rebuild when type
killedBy: createChartController — update destroys and reconstructs when the top-level type changes
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/controller.ts:121:11
       // controller.
       await ensureKindsRegistered(next);
 
-      if (next.type === currentType) {
+      if (false) {
         // In place: same top-level type — per the acceptance criterion in
         // docs/IMPLEMENTATION_PLAN.md Phase 1 ("only rebuild when type
killedBy: createChartController — update updates in place (same Chart.js instance, chart.update() called) when the top-level type is unchanged
statusReason: expected MockChart2{ config: { …(4) }, …(5) } to be MockChart2{ config: { …(4) }, …(5) } // Object.is equality

[Killed] ConditionalExpression
src/controller.ts:132:13
         // destroy+reconstruct here would reset animation/interaction
         // state for no reason.
         chart.data = next.data as ChartConfiguration['data'];
-        if (next.options) chart.options = next.options as never;
+        if (true) chart.options = next.options as never;
 
         // Inline plugins can't be patched on a live instance — if they
killedBy: createChartController — update leaves options untouched when the update payload does not include any
statusReason: expected undefined to deeply equal { responsive: true }

[Killed] ConditionalExpression
src/controller.ts:132:13
         // destroy+reconstruct here would reset animation/interaction
         // state for no reason.
         chart.data = next.data as ChartConfiguration['data'];
-        if (next.options) chart.options = next.options as never;
+        if (false) chart.options = next.options as never;
 
         // Inline plugins can't be patched on a live instance — if they
killedBy: createChartController — update applies new options when the in-place update payload does include them
statusReason: expected { responsive: true } to deeply equal { responsive: false }

[Killed] ConditionalExpression
src/controller.ts:136:13
 
         // Inline plugins can't be patched on a live instance — if they
         // changed (by reference), rebuild even though `type` didn't.
-        if (next.plugins !== currentPlugins) {
+        if (true) {
           resizeObserver?.disconnect();
           chart.destroy();
killedBy: createChartController — update updates in place (same Chart.js instance, chart.update() called) when the top-level type is unchanged
statusReason: expected MockChart2{ config: { …(4) }, …(5) } to be MockChart2{ config: { …(4) }, …(5) } // Object.is equality

[Killed] EqualityOperator
src/controller.ts:136:13
 
         // Inline plugins can't be patched on a live instance — if they
         // changed (by reference), rebuild even though `type` didn't.
-        if (next.plugins !== currentPlugins) {
+        if (next.plugins === currentPlugins) {
           resizeObserver?.disconnect();
           chart.destroy();
killedBy: createChartController — update updates in place (same Chart.js instance, chart.update() called) when the top-level type is unchanged
statusReason: expected MockChart2{ config: { …(4) }, …(5) } to be MockChart2{ config: { …(4) }, …(5) } // Object.is equality

[Killed] OptionalChaining
src/controller.ts:137:11
         // Inline plugins can't be patched on a live instance — if they
         // changed (by reference), rebuild even though `type` didn't.
         if (next.plugins !== currentPlugins) {
-          resizeObserver?.disconnect();
+          resizeObserver.disconnect();
           chart.destroy();
           chart = new Chart<ChartType>(canvas, toConfig(next));
killedBy: createChartController — update does not throw when a plugins-change recreate happens in an environment with no ResizeObserver at all
statusReason: Cannot read properties of undefined (reading 'disconnect')

[Killed] ConditionalExpression
src/controller.ts:141:15
           chart.destroy();
           chart = new Chart<ChartType>(canvas, toConfig(next));
           currentPlugins = next.plugins;
-          if (typeof ResizeObserver !== 'undefined') {
+          if (true) {
             resizeObserver = new ResizeObserver(() => chart.resize());
             resizeObserver.observe(resizeTarget);
killedBy: createChartController — update does not throw when a plugins-change recreate happens in an environment with no ResizeObserver at all
statusReason: ResizeObserver is not a constructor

[Killed] EqualityOperator
src/controller.ts:141:15
           chart.destroy();
           chart = new Chart<ChartType>(canvas, toConfig(next));
           currentPlugins = next.plugins;
-          if (typeof ResizeObserver !== 'undefined') {
+          if (typeof ResizeObserver === 'undefined') {
             resizeObserver = new ResizeObserver(() => chart.resize());
             resizeObserver.observe(resizeTarget);
killedBy: createChartController — update re-wires the ResizeObserver on the new instance after a plugins-change recreate
statusReason: expected "spy" to be called 2 times, but got 1 times

[Killed] OptionalChaining
src/controller.ts:155:7
       // The chart's own top-level type changed — Chart.js has no
       // supported way to swap a live instance's default controller type
       // in place, so destroy and rebuild.
-      resizeObserver?.disconnect();
+      resizeObserver.disconnect();
       chart.destroy();
       chart = new Chart<ChartType>(canvas, toConfig(next));
killedBy: createChartController — resize does not throw in an environment with no ResizeObserver, and every method still works
statusReason: Cannot read properties of undefined (reading 'disconnect')

[Killed] BlockStatement
src/controller.ts:160:50
       chart = new Chart<ChartType>(canvas, toConfig(next));
       currentType = next.type;
       currentPlugins = next.plugins;
-      if (typeof ResizeObserver !== 'undefined') {
-        resizeObserver = new ResizeObserver(() => chart.resize());
-        resizeObserver.observe(resizeTarget);
-      }
+      if (typeof ResizeObserver !== 'undefined') {}
     },
 
killedBy: createChartController — resize re-wires the ResizeObserver on the new instance after a type-change recreate
statusReason: expected "spy" to be called 2 times, but got 1 times

[Killed] BlockStatement
src/controller.ts:166:20
       }
     },
 
-    resize(): void {
-      chart.resize();
-    },
+    resize(): void {},
 
     applyTheme(patch: NonNullable<ChartConfiguration['options']>): void {
killedBy: createChartController — resize resize() calls chart.resize() directly, independent of the observer
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/controller.ts:170:73
       chart.resize();
     },
 
-    applyTheme(patch: NonNullable<ChartConfiguration['options']>): void {
-      chart.options = mergeOptionsOneLevel((chart.options ?? {}) as NonNullable<ChartConfiguration['options']>, patch) as never;
-      chart.update();
-    },
+    applyTheme(patch: NonNullable<ChartConfiguration['options']>): void {},
 
     destroy(): void {
killedBy: createChartController — applyTheme merges the patch into chart.options (one level deep) and calls chart.update(), without touching data
statusReason: expected undefined to be '#fff' // Object.is equality

[Killed] BlockStatement
src/controller.ts:175:21
       chart.update();
     },
 
-    destroy(): void {
-      resizeObserver?.disconnect();
-      chart.destroy();
-    },
+    destroy(): void {},
   };
 
killedBy: createChartController — resize does not throw in an environment with no ResizeObserver, and every method still works
statusReason: expected false to be true // Object.is equality

[Killed] OptionalChaining
src/controller.ts:176:7
     },
 
     destroy(): void {
-      resizeObserver?.disconnect();
+      resizeObserver.disconnect();
       chart.destroy();
     },
killedBy: createChartController — resize does not throw in an environment with no ResizeObserver, and every method still works
statusReason: Cannot read properties of undefined (reading 'disconnect')
