[Killed] BlockStatement
src/imageLabelPlugin.ts:34:73
  * @param imageUrl - The image URL to look up.
  * @returns The cached `HTMLImageElement`, or `undefined` if not yet loaded.
  */
-function getCachedImage(imageUrl: string): HTMLImageElement | undefined {
-  return loadedImages.get(imageUrl);
-}
+function getCachedImage(imageUrl: string): HTMLImageElement | undefined {}
 
 /**
killedBy: imageLabelPlugin caches a loaded image by URL — a second draw of the same URL draws immediately from cache
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/imageLabelPlugin.ts:48:70
  * @param imageUrl - The URL the image was loaded from.
  * @param image - The loaded `HTMLImageElement` to cache.
  */
-function cacheImage(imageUrl: string, image: HTMLImageElement): void {
-  if (loadedImages.size >= MAX_CACHED_IMAGES) {
-    const oldestKey = loadedImages.keys().next().value;
-    if (oldestKey !== undefined) loadedImages.delete(oldestKey);
-  }
-  loadedImages.set(imageUrl, image);
-}
+function cacheImage(imageUrl: string, image: HTMLImageElement): void {}
 
 /**
killedBy: imageLabelPlugin caches a loaded image by URL — a second draw of the same URL draws immediately from cache
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] BlockStatement
src/imageLabelPlugin.ts:49:47
  * @param image - The loaded `HTMLImageElement` to cache.
  */
 function cacheImage(imageUrl: string, image: HTMLImageElement): void {
-  if (loadedImages.size >= MAX_CACHED_IMAGES) {
-    const oldestKey = loadedImages.keys().next().value;
-    if (oldestKey !== undefined) loadedImages.delete(oldestKey);
-  }
+  if (loadedImages.size >= MAX_CACHED_IMAGES) {}
   loadedImages.set(imageUrl, image);
 }

[Survived] ConditionalExpression
src/imageLabelPlugin.ts:49:7
  * @param image - The loaded `HTMLImageElement` to cache.
  */
 function cacheImage(imageUrl: string, image: HTMLImageElement): void {
-  if (loadedImages.size >= MAX_CACHED_IMAGES) {
+  if (true) {
     const oldestKey = loadedImages.keys().next().value;
     if (oldestKey !== undefined) loadedImages.delete(oldestKey);

[Survived] EqualityOperator
src/imageLabelPlugin.ts:51:9
 function cacheImage(imageUrl: string, image: HTMLImageElement): void {
   if (loadedImages.size >= MAX_CACHED_IMAGES) {
     const oldestKey = loadedImages.keys().next().value;
-    if (oldestKey !== undefined) loadedImages.delete(oldestKey);
+    if (oldestKey === undefined) loadedImages.delete(oldestKey);
   }
   loadedImages.set(imageUrl, image);

[Survived] ConditionalExpression
src/imageLabelPlugin.ts:51:9
 function cacheImage(imageUrl: string, image: HTMLImageElement): void {
   if (loadedImages.size >= MAX_CACHED_IMAGES) {
     const oldestKey = loadedImages.keys().next().value;
-    if (oldestKey !== undefined) loadedImages.delete(oldestKey);
+    if (false) loadedImages.delete(oldestKey);
   }
   loadedImages.set(imageUrl, image);

[Killed] BlockStatement
src/imageLabelPlugin.ts:69:88
  * @param imageUrl - The image URL to load.
  * @param onReady - Called with the loaded image once available.
  */
-function loadImage(imageUrl: string, onReady: (image: HTMLImageElement) => void): void {
-  const cached = getCachedImage(imageUrl);
-  if (cached) {
-    onReady(cached);
-    return;
-  }
-
-  const image = new Image();
-  image.onload = () => {
-    cacheImage(imageUrl, image);
-    onReady(image);
-  };
-  image.onerror = () => {
-    console.warn(`keystone-chartjs-core: imageLabel plugin failed to load image "${imageUrl}"`);
-  };
-  image.src = imageUrl;
-}
+function loadImage(imageUrl: string, onReady: (image: HTMLImageElement) => void): void {}
 
 /**
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] BlockStatement
src/imageLabelPlugin.ts:71:15
  */
 function loadImage(imageUrl: string, onReady: (image: HTMLImageElement) => void): void {
   const cached = getCachedImage(imageUrl);
-  if (cached) {
-    onReady(cached);
-    return;
-  }
+  if (cached) {}
 
   const image = new Image();
killedBy: imageLabelPlugin caches a loaded image by URL — a second draw of the same URL draws immediately from cache
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ConditionalExpression
src/imageLabelPlugin.ts:71:7
  */
 function loadImage(imageUrl: string, onReady: (image: HTMLImageElement) => void): void {
   const cached = getCachedImage(imageUrl);
-  if (cached) {
+  if (true) {
     onReady(cached);
     return;
killedBy: imageLabelPlugin logs a warning and does not draw when the image fails to load
statusReason: expected "warn" to be called with arguments: [ StringContaining{…} ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/imageLabelPlugin.ts:77:24
   }
 
   const image = new Image();
-  image.onload = () => {
-    cacheImage(imageUrl, image);
-    onReady(image);
-  };
+  image.onload = () => {};
   image.onerror = () => {
     console.warn(`keystone-chartjs-core: imageLabel plugin failed to load image "${imageUrl}"`);
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] BlockStatement
src/imageLabelPlugin.ts:81:25
     cacheImage(imageUrl, image);
     onReady(image);
   };
-  image.onerror = () => {
-    console.warn(`keystone-chartjs-core: imageLabel plugin failed to load image "${imageUrl}"`);
-  };
+  image.onerror = () => {};
   image.src = imageUrl;
 }
killedBy: imageLabelPlugin logs a warning and does not draw when the image fails to load
statusReason: expected "warn" to be called with arguments: [ StringContaining{…} ]

Received: 



Number of calls: 0

[Killed] StringLiteral
src/imageLabelPlugin.ts:82:18
     onReady(image);
   };
   image.onerror = () => {
-    console.warn(`keystone-chartjs-core: imageLabel plugin failed to load image "${imageUrl}"`);
+    console.warn(``);
   };
   image.src = imageUrl;
killedBy: imageLabelPlugin logs a warning and does not draw when the image fails to load
statusReason: expected "warn" to be called with arguments: [ StringContaining{…} ]

Received: 

  1st warn call:

  Array [
-   StringContaining "fails-0.9322027343230994.png",

[Killed] BlockStatement
src/imageLabelPlugin.ts:95:60
  * @param value - The value to check.
  * @returns `true` if `value` is an `ArcElement`.
  */
-function isArcElement(value: unknown): value is ArcElement {
-  return value instanceof ArcElement;
-}
+function isArcElement(value: unknown): value is ArcElement {}
 
 /**
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] BlockStatement
src/imageLabelPlugin.ts:114:11
   innerRadius: number,
   outerRadius: number,
   imageRadius: number,
-): number {
-  switch (verticalAlign) {
-    case 'top':
-      return outerRadius - imageRadius;
-    case 'bottom':
-      return innerRadius + imageRadius;
-    case 'middle':
-    default:
-      return innerRadius + (outerRadius - innerRadius) / 2;
-  }
-}
+): number {}
 
 /**
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected NaN to be close to 1, received difference is NaN, but expected 0.000005

[Killed] ConditionalExpression
src/imageLabelPlugin.ts:116:5
   imageRadius: number,
 ): number {
   switch (verticalAlign) {
-    case 'top':
-      return outerRadius - imageRadius;
+    case 'top':
     case 'bottom':
       return innerRadius + imageRadius;
killedBy: imageLabelPlugin positions using verticalAlign: top/bottom and horizontalAlign: start/end, not just the untested default middle/middle
statusReason: expected 124.80494168073322 to be close to 134.72691835302652, received difference is 9.921976672293297, but expected 0.000005

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:117:14
 ): number {
   switch (verticalAlign) {
     case 'top':
-      return outerRadius - imageRadius;
+      return outerRadius + imageRadius;
     case 'bottom':
       return innerRadius + imageRadius;
killedBy: imageLabelPlugin positions using verticalAlign: top/bottom and horizontalAlign: start/end, not just the untested default middle/middle
statusReason: expected 144.6488950253198 to be close to 134.72691835302652, received difference is 9.921976672293283, but expected 0.000005

[Killed] ConditionalExpression
src/imageLabelPlugin.ts:118:5
   switch (verticalAlign) {
     case 'top':
       return outerRadius - imageRadius;
-    case 'bottom':
-      return innerRadius + imageRadius;
+    case 'bottom':
     case 'middle':
     default:
killedBy: imageLabelPlugin positions using verticalAlign: bottom and horizontalAlign: end, the other untested case of each switch
statusReason: expected 103.74024200155684 to be close to 103.1168683346307, received difference is 0.6233736669261418, but expected 0.000005

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:119:14
     case 'top':
       return outerRadius - imageRadius;
     case 'bottom':
-      return innerRadius + imageRadius;
+      return innerRadius - imageRadius;
     case 'middle':
     default:
killedBy: imageLabelPlugin positions using verticalAlign: bottom and horizontalAlign: end, the other untested case of each switch
statusReason: expected 101.87012100077841 to be close to 103.1168683346307, received difference is 1.2467473338522836, but expected 0.000005

[Killed] ConditionalExpression
src/imageLabelPlugin.ts:121:5
     case 'bottom':
       return innerRadius + imageRadius;
     case 'middle':
-    default:
-      return innerRadius + (outerRadius - innerRadius) / 2;
+    default:
   }
 }
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected NaN to be close to 1, received difference is NaN, but expected 0.000005

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:122:29
       return innerRadius + imageRadius;
     case 'middle':
     default:
-      return innerRadius + (outerRadius - innerRadius) / 2;
+      return innerRadius + (outerRadius + innerRadius) / 2;
   }
 }
killedBy: imageLabelPlugin fix #2: positions using the arc's own real, already-computed geometry, not recomputed slice angles
statusReason: expected 142.1341716182545 to be close to 134.4805029709527, received difference is 7.653668647301799, but expected 0.000005

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:122:28
       return innerRadius + imageRadius;
     case 'middle':
     default:
-      return innerRadius + (outerRadius - innerRadius) / 2;
+      return innerRadius + (outerRadius - innerRadius) * 2;
   }
 }
killedBy: imageLabelPlugin fix #2: positions using the arc's own real, already-computed geometry, not recomputed slice angles
statusReason: expected 145.9610059419054 to be close to 134.4805029709527, received difference is 11.4805029709527, but expected 0.000005

[Killed] BlockStatement
src/imageLabelPlugin.ts:145:11
   imageRadius: number,
   outerRadius: number,
   offsetRadian: number,
-): number {
-  switch (horizontalAlign) {
-    case 'start':
-      return startAngle + imageRadius / outerRadius + offsetRadian;
-    case 'end':
-      return endAngle - imageRadius / outerRadius - offsetRadian;
-    case 'middle':
-    default:
-      return (startAngle + endAngle) / 2;
-  }
-}
+): number {}
 
 interface ImageLabelPosition {
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected NaN to be close to 1, received difference is NaN, but expected 0.000005

[Killed] ConditionalExpression
src/imageLabelPlugin.ts:147:5
   offsetRadian: number,
 ): number {
   switch (horizontalAlign) {
-    case 'start':
-      return startAngle + imageRadius / outerRadius + offsetRadian;
+    case 'start':
     case 'end':
       return endAngle - imageRadius / outerRadius - offsetRadian;
killedBy: imageLabelPlugin positions using verticalAlign: top/bottom and horizontalAlign: start/end, not just the untested default middle/middle
statusReason: expected 104.36361566848296 to be close to 134.72691835302652, received difference is 30.363302684543555, but expected 0.000005

[Killed] StringLiteral
src/imageLabelPlugin.ts:147:10
   offsetRadian: number,
 ): number {
   switch (horizontalAlign) {
-    case 'start':
+    case "":
       return startAngle + imageRadius / outerRadius + offsetRadian;
     case 'end':
killedBy: imageLabelPlugin positions using verticalAlign: top/bottom and horizontalAlign: start/end, not just the untested default middle/middle
statusReason: expected 124.74873734152916 to be close to 134.72691835302652, received difference is 9.978181011497355, but expected 0.000005

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:148:14
 ): number {
   switch (horizontalAlign) {
     case 'start':
-      return startAngle + imageRadius / outerRadius + offsetRadian;
+      return startAngle + imageRadius / outerRadius - offsetRadian;
     case 'end':
       return endAngle - imageRadius / outerRadius - offsetRadian;
killedBy: imageLabelPlugin applies options.offset as an additional angular offset — untested by every other test, which all omit it
statusReason: expected 129.91566454336623 to be close to 128.42952179244446, received difference is 1.486142750921772, but expected 0.000005

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:148:27
 ): number {
   switch (horizontalAlign) {
     case 'start':
-      return startAngle + imageRadius / outerRadius + offsetRadian;
+      return startAngle + imageRadius * outerRadius + offsetRadian;
     case 'end':
       return endAngle - imageRadius / outerRadius - offsetRadian;
killedBy: imageLabelPlugin positions using verticalAlign: top/bottom and horizontalAlign: start/end, not just the untested default middle/middle
statusReason: expected 117.05156862524521 to be close to 134.72691835302652, received difference is 17.67534972778131, but expected 0.000005

[Killed] ConditionalExpression
src/imageLabelPlugin.ts:149:5
   switch (horizontalAlign) {
     case 'start':
       return startAngle + imageRadius / outerRadius + offsetRadian;
-    case 'end':
-      return endAngle - imageRadius / outerRadius - offsetRadian;
+    case 'end':
     case 'middle':
     default:
killedBy: imageLabelPlugin positions using verticalAlign: bottom and horizontalAlign: end, the other untested case of each switch
statusReason: expected 117.67766952966369 to be close to 103.1168683346307, received difference is 14.560801195032994, but expected 0.000005

[Killed] StringLiteral
src/imageLabelPlugin.ts:149:10
   switch (horizontalAlign) {
     case 'start':
       return startAngle + imageRadius / outerRadius + offsetRadian;
-    case 'end':
+    case "":
       return endAngle - imageRadius / outerRadius - offsetRadian;
     case 'middle':
killedBy: imageLabelPlugin positions using verticalAlign: bottom and horizontalAlign: end, the other untested case of each switch
statusReason: expected 117.67766952966369 to be close to 103.1168683346307, received difference is 14.560801195032994, but expected 0.000005

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:150:14
     case 'start':
       return startAngle + imageRadius / outerRadius + offsetRadian;
     case 'end':
-      return endAngle - imageRadius / outerRadius - offsetRadian;
+      return endAngle + imageRadius / outerRadius - offsetRadian;
     case 'middle':
     default:
killedBy: imageLabelPlugin positions using verticalAlign: bottom and horizontalAlign: end, the other untested case of each switch
statusReason: expected 96.8831316653693 to be close to 103.1168683346307, received difference is 6.23373666926139, but expected 0.000005

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:150:25
     case 'start':
       return startAngle + imageRadius / outerRadius + offsetRadian;
     case 'end':
-      return endAngle - imageRadius / outerRadius - offsetRadian;
+      return endAngle - imageRadius * outerRadius - offsetRadian;
     case 'middle':
     default:
killedBy: imageLabelPlugin positions using verticalAlign: bottom and horizontalAlign: end, the other untested case of each switch
statusReason: expected 78.1675675696502 to be close to 103.1168683346307, received difference is 24.949300764980492, but expected 0.000005

[Survived] StringLiteral
src/imageLabelPlugin.ts:151:10
       return startAngle + imageRadius / outerRadius + offsetRadian;
     case 'end':
       return endAngle - imageRadius / outerRadius - offsetRadian;
-    case 'middle':
+    case "":
     default:
       return (startAngle + endAngle) / 2;

[Killed] ConditionalExpression
src/imageLabelPlugin.ts:152:5
     case 'end':
       return endAngle - imageRadius / outerRadius - offsetRadian;
     case 'middle':
-    default:
-      return (startAngle + endAngle) / 2;
+    default:
   }
 }
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected NaN to be close to 1, received difference is NaN, but expected 0.000005

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:153:14
       return endAngle - imageRadius / outerRadius - offsetRadian;
     case 'middle':
     default:
-      return (startAngle + endAngle) / 2;
+      return (startAngle + endAngle) * 2;
   }
 }
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected 51 to be close to 1, received difference is 50, but expected 0.000005

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:153:15
       return endAngle - imageRadius / outerRadius - offsetRadian;
     case 'middle':
     default:
-      return (startAngle + endAngle) / 2;
+      return (startAngle - endAngle) / 2;
   }
 }
killedBy: imageLabelPlugin fix #2: positions using the arc's own real, already-computed geometry, not recomputed slice angles
statusReason: expected 150.7163859753386 to be close to 134.4805029709527, received difference is 16.235883004385897, but expected 0.000005

[Killed] BlockStatement
src/imageLabelPlugin.ts:182:23
   verticalAlign: NonNullable<ImageLabelPluginOptions['verticalAlign']>,
   horizontalAlign: NonNullable<ImageLabelPluginOptions['horizontalAlign']>,
   offset: number | undefined,
-): ImageLabelPosition {
-  const { startAngle, endAngle, innerRadius, outerRadius } = arc;
-  const { x: centerX, y: centerY } = arc.getCenterPoint(false);
-  const imageRadius = Math.min(imageWidth, imageHeight) / 2;
-  const offsetRadian = offset ? offset / outerRadius : 0;
-
-  const distanceFromCenter = computeDistanceFromCenter(verticalAlign, innerRadius, outerRadius, imageRadius);
-  const angleForImage = computeAngleForImage(horizontalAlign, startAngle, endAngle, imageRadius, outerRadius, offsetRadian);
-
-  const imageCenterX = centerX + distanceFromCenter * Math.cos(angleForImage);
-  const imageCenterY = centerY + distanceFromCenter * Math.sin(angleForImage);
-
-  return {
-    imageCenterX,
-    imageCenterY,
-    imageX: imageCenterX - imageWidth / 2,
-    imageY: imageCenterY - imageHeight / 2,
-  };
-}
+): ImageLabelPosition {}
 
 /**
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times

[Survived] BooleanLiteral
src/imageLabelPlugin.ts:184:57
   offset: number | undefined,
 ): ImageLabelPosition {
   const { startAngle, endAngle, innerRadius, outerRadius } = arc;
-  const { x: centerX, y: centerY } = arc.getCenterPoint(false);
+  const { x: centerX, y: centerY } = arc.getCenterPoint(true);
   const imageRadius = Math.min(imageWidth, imageHeight) / 2;
   const offsetRadian = offset ? offset / outerRadius : 0;

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:185:23
 ): ImageLabelPosition {
   const { startAngle, endAngle, innerRadius, outerRadius } = arc;
   const { x: centerX, y: centerY } = arc.getCenterPoint(false);
-  const imageRadius = Math.min(imageWidth, imageHeight) / 2;
+  const imageRadius = Math.min(imageWidth, imageHeight) * 2;
   const offsetRadian = offset ? offset / outerRadius : 0;
 
killedBy: imageLabelPlugin positions using verticalAlign: top/bottom and horizontalAlign: start/end, not just the untested default middle/middle
statusReason: expected 117.55165123780745 to be close to 134.72691835302652, received difference is 17.17526711521907, but expected 0.000005

[Survived] MethodExpression
src/imageLabelPlugin.ts:185:23
 ): ImageLabelPosition {
   const { startAngle, endAngle, innerRadius, outerRadius } = arc;
   const { x: centerX, y: centerY } = arc.getCenterPoint(false);
-  const imageRadius = Math.min(imageWidth, imageHeight) / 2;
+  const imageRadius = Math.max(imageWidth, imageHeight) / 2;
   const offsetRadian = offset ? offset / outerRadius : 0;
 

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:186:33
   const { startAngle, endAngle, innerRadius, outerRadius } = arc;
   const { x: centerX, y: centerY } = arc.getCenterPoint(false);
   const imageRadius = Math.min(imageWidth, imageHeight) / 2;
-  const offsetRadian = offset ? offset / outerRadius : 0;
+  const offsetRadian = offset ? offset * outerRadius : 0;
 
   const distanceFromCenter = computeDistanceFromCenter(verticalAlign, innerRadius, outerRadius, imageRadius);
killedBy: imageLabelPlugin applies options.offset as an additional angular offset — untested by every other test, which all omit it
statusReason: expected 128.5010280341299 to be close to 128.42952179244446, received difference is 0.07150624168542663, but expected 0.000005

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:191:34
   const distanceFromCenter = computeDistanceFromCenter(verticalAlign, innerRadius, outerRadius, imageRadius);
   const angleForImage = computeAngleForImage(horizontalAlign, startAngle, endAngle, imageRadius, outerRadius, offsetRadian);
 
-  const imageCenterX = centerX + distanceFromCenter * Math.cos(angleForImage);
+  const imageCenterX = centerX + distanceFromCenter / Math.cos(angleForImage);
   const imageCenterY = centerY + distanceFromCenter * Math.sin(angleForImage);
 
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected 816561967659768400 to be close to 1, received difference is 816561967659768400, but expected 0.000005

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:191:24
   const distanceFromCenter = computeDistanceFromCenter(verticalAlign, innerRadius, outerRadius, imageRadius);
   const angleForImage = computeAngleForImage(horizontalAlign, startAngle, endAngle, imageRadius, outerRadius, offsetRadian);
 
-  const imageCenterX = centerX + distanceFromCenter * Math.cos(angleForImage);
+  const imageCenterX = centerX - distanceFromCenter * Math.cos(angleForImage);
   const imageCenterY = centerY + distanceFromCenter * Math.sin(angleForImage);
 
killedBy: imageLabelPlugin fix #2: positions using the arc's own real, already-computed geometry, not recomputed slice angles
statusReason: expected 111.5194970290473 to be close to 134.4805029709527, received difference is 22.9610059419054, but expected 0.000005

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:192:24
   const angleForImage = computeAngleForImage(horizontalAlign, startAngle, endAngle, imageRadius, outerRadius, offsetRadian);
 
   const imageCenterX = centerX + distanceFromCenter * Math.cos(angleForImage);
-  const imageCenterY = centerY + distanceFromCenter * Math.sin(angleForImage);
+  const imageCenterY = centerY - distanceFromCenter * Math.sin(angleForImage);
 
   return {
killedBy: imageLabelPlugin fix #2: positions using the arc's own real, already-computed geometry, not recomputed slice angles
statusReason: expected 428.2836140246614 to be close to 483.7163859753386, received difference is 55.43277195067719, but expected 0.000005

[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:192:34
   const angleForImage = computeAngleForImage(horizontalAlign, startAngle, endAngle, imageRadius, outerRadius, offsetRadian);
 
   const imageCenterX = centerX + distanceFromCenter * Math.cos(angleForImage);
-  const imageCenterY = centerY + distanceFromCenter * Math.sin(angleForImage);
+  const imageCenterY = centerY + distanceFromCenter / Math.sin(angleForImage);
 
   return {
killedBy: imageLabelPlugin fix #2: positions using the arc's own real, already-computed geometry, not recomputed slice angles
statusReason: expected 488.47176600877185 to be close to 483.7163859753386, received difference is 4.755380033433255, but expected 0.000005

[Killed] ObjectLiteral
src/imageLabelPlugin.ts:194:10
   const imageCenterX = centerX + distanceFromCenter * Math.cos(angleForImage);
   const imageCenterY = centerY + distanceFromCenter * Math.sin(angleForImage);
 
-  return {
-    imageCenterX,
-    imageCenterY,
-    imageX: imageCenterX - imageWidth / 2,
-    imageY: imageCenterY - imageHeight / 2,
-  };
+  return {};
 }
 
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected undefined to be close to 1, received difference is NaN, but expected 0.000005

[Survived] ArithmeticOperator
src/imageLabelPlugin.ts:197:13
   return {
     imageCenterX,
     imageCenterY,
-    imageX: imageCenterX - imageWidth / 2,
+    imageX: imageCenterX + imageWidth / 2,
     imageY: imageCenterY - imageHeight / 2,
   };

[Survived] ArithmeticOperator
src/imageLabelPlugin.ts:197:28
   return {
     imageCenterX,
     imageCenterY,
-    imageX: imageCenterX - imageWidth / 2,
+    imageX: imageCenterX - imageWidth * 2,
     imageY: imageCenterY - imageHeight / 2,
   };

[Survived] ArithmeticOperator
src/imageLabelPlugin.ts:198:13
     imageCenterX,
     imageCenterY,
     imageX: imageCenterX - imageWidth / 2,
-    imageY: imageCenterY - imageHeight / 2,
+    imageY: imageCenterY + imageHeight / 2,
   };
 }

[Survived] ArithmeticOperator
src/imageLabelPlugin.ts:198:28
     imageCenterX,
     imageCenterY,
     imageX: imageCenterX - imageWidth / 2,
-    imageY: imageCenterY - imageHeight / 2,
+    imageY: imageCenterY - imageHeight * 2,
   };
 }

[Killed] BlockStatement
src/imageLabelPlugin.ts:217:9
   position: ImageLabelPosition,
   imageWidth: number,
   imageHeight: number,
-): void {
-  const { imageCenterX, imageCenterY, imageX, imageY } = position;
-  ctx.save();
-  ctx.beginPath();
-  ctx.arc(imageCenterX, imageCenterY, imageWidth / 2, 0, Math.PI * 2, false);
-  ctx.clip();
-  ctx.drawImage(image, imageX, imageY, imageWidth, imageHeight);
-  ctx.closePath();
-  ctx.restore();
-}
+): void {}
 
 /**
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times

[Survived] BooleanLiteral
src/imageLabelPlugin.ts:221:71
   const { imageCenterX, imageCenterY, imageX, imageY } = position;
   ctx.save();
   ctx.beginPath();
-  ctx.arc(imageCenterX, imageCenterY, imageWidth / 2, 0, Math.PI * 2, false);
+  ctx.arc(imageCenterX, imageCenterY, imageWidth / 2, 0, Math.PI * 2, true);
   ctx.clip();
   ctx.drawImage(image, imageX, imageY, imageWidth, imageHeight);

[Survived] ArithmeticOperator
src/imageLabelPlugin.ts:221:39
   const { imageCenterX, imageCenterY, imageX, imageY } = position;
   ctx.save();
   ctx.beginPath();
-  ctx.arc(imageCenterX, imageCenterY, imageWidth / 2, 0, Math.PI * 2, false);
+  ctx.arc(imageCenterX, imageCenterY, imageWidth * 2, 0, Math.PI * 2, false);
   ctx.clip();
   ctx.drawImage(image, imageX, imageY, imageWidth, imageHeight);

[Killed] BlockStatement
src/imageLabelPlugin.ts:246:9
   verticalAlign: NonNullable<ImageLabelPluginOptions['verticalAlign']>,
   horizontalAlign: NonNullable<ImageLabelPluginOptions['horizontalAlign']>,
   offset: number | undefined,
-): void {
-  const { imageUrl, imageWidth, imageHeight } = imageInfo;
-  const position = computeImageLabelPosition(arc, imageWidth, imageHeight, verticalAlign, horizontalAlign, offset);
-
-  loadImage(imageUrl, (image) => {
-    drawClippedImage(ctx, image, position, imageWidth, imageHeight);
-  });
-}
+): void {}
 
 /**
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] BlockStatement
src/imageLabelPlugin.ts:250:34
   const { imageUrl, imageWidth, imageHeight } = imageInfo;
   const position = computeImageLabelPosition(arc, imageWidth, imageHeight, verticalAlign, horizontalAlign, offset);
 
-  loadImage(imageUrl, (image) => {
-    drawClippedImage(ctx, image, position, imageWidth, imageHeight);
-  });
+  loadImage(imageUrl, (image) => {});
 }
 
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times

[Survived] StringLiteral
src/imageLabelPlugin.ts:263:7
  * `Chart.register(...)` call.
  */
 export const imageLabelPlugin: Plugin<ChartType, ImageLabelPluginOptions> = {
-  id: 'imageLabel',
+  id: "",
 
   /**
