[Killed] BlockStatement
src/imageLabelPlugin.ts:278:74
    * @param _args - Unused; part of Chart.js's plugin hook signature.
    * @param options - This plugin's own configuration for the current chart.
    */
-  afterDraw(chart: Chart, _args, options: ImageLabelPluginOptions): void {
-    const ctx = chart.ctx;
-    const { verticalAlign = 'middle', horizontalAlign = 'middle', imagesList, offset } = options;
-
-    chart.data.datasets.forEach((_dataset, datasetIndex) => {
-      const meta = chart.getDatasetMeta(datasetIndex);
-      if (meta.type !== 'doughnut' && meta.type !== 'pie') return;
-
-      meta.data.forEach((element, index) => {
-        if (!isArcElement(element)) return;
-
-        const imageInfo = imagesList[index];
-        if (!imageInfo?.imageUrl) return;
-
-        drawArcImageLabel(ctx, element, imageInfo, verticalAlign, horizontalAlign, offset);
-      });
-    });
-  },
+  afterDraw(chart: Chart, _args, options: ImageLabelPluginOptions): void {},
 };
 
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times

[Survived] StringLiteral
src/imageLabelPlugin.ts:280:29
    */
   afterDraw(chart: Chart, _args, options: ImageLabelPluginOptions): void {
     const ctx = chart.ctx;
-    const { verticalAlign = 'middle', horizontalAlign = 'middle', imagesList, offset } = options;
+    const { verticalAlign = "", horizontalAlign = 'middle', imagesList, offset } = options;
 
     chart.data.datasets.forEach((_dataset, datasetIndex) => {

[Killed] BlockStatement
src/imageLabelPlugin.ts:282:61
     const ctx = chart.ctx;
     const { verticalAlign = 'middle', horizontalAlign = 'middle', imagesList, offset } = options;
 
-    chart.data.datasets.forEach((_dataset, datasetIndex) => {
-      const meta = chart.getDatasetMeta(datasetIndex);
-      if (meta.type !== 'doughnut' && meta.type !== 'pie') return;
-
-      meta.data.forEach((element, index) => {
-        if (!isArcElement(element)) return;
-
-        const imageInfo = imagesList[index];
-        if (!imageInfo?.imageUrl) return;
-
-        drawArcImageLabel(ctx, element, imageInfo, verticalAlign, horizontalAlign, offset);
-      });
-    });
+    chart.data.datasets.forEach((_dataset, datasetIndex) => {});
   },
 };
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] EqualityOperator
src/imageLabelPlugin.ts:284:11
 
     chart.data.datasets.forEach((_dataset, datasetIndex) => {
       const meta = chart.getDatasetMeta(datasetIndex);
-      if (meta.type !== 'doughnut' && meta.type !== 'pie') return;
+      if (meta.type === 'doughnut' && meta.type !== 'pie') return;
 
       meta.data.forEach((element, index) => {
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] ConditionalExpression
src/imageLabelPlugin.ts:284:11
 
     chart.data.datasets.forEach((_dataset, datasetIndex) => {
       const meta = chart.getDatasetMeta(datasetIndex);
-      if (meta.type !== 'doughnut' && meta.type !== 'pie') return;
+      if (true) return;
 
       meta.data.forEach((element, index) => {
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] BlockStatement
src/imageLabelPlugin.ts:286:45
       const meta = chart.getDatasetMeta(datasetIndex);
       if (meta.type !== 'doughnut' && meta.type !== 'pie') return;
 
-      meta.data.forEach((element, index) => {
-        if (!isArcElement(element)) return;
-
-        const imageInfo = imagesList[index];
-        if (!imageInfo?.imageUrl) return;
-
-        drawArcImageLabel(ctx, element, imageInfo, verticalAlign, horizontalAlign, offset);
-      });
+      meta.data.forEach((element, index) => {});
     });
   },
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] ConditionalExpression
src/imageLabelPlugin.ts:287:13
       if (meta.type !== 'doughnut' && meta.type !== 'pie') return;
 
       meta.data.forEach((element, index) => {
-        if (!isArcElement(element)) return;
+        if (false) return;
 
         const imageInfo = imagesList[index];
killedBy: imageLabelPlugin skips a dataset element that is not a real ArcElement instance (the instanceof type guard's own real skip path)
statusReason: expected "spy" to be called 1 times, but got 2 times

[Killed] BooleanLiteral
src/imageLabelPlugin.ts:287:13
       if (meta.type !== 'doughnut' && meta.type !== 'pie') return;
 
       meta.data.forEach((element, index) => {
-        if (!isArcElement(element)) return;
+        if (isArcElement(element)) return;
 
         const imageInfo = imagesList[index];
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] BooleanLiteral
src/imageLabelPlugin.ts:290:13
         if (!isArcElement(element)) return;
 
         const imageInfo = imagesList[index];
-        if (!imageInfo?.imageUrl) return;
+        if (imageInfo?.imageUrl) return;
 
         drawArcImageLabel(ctx, element, imageInfo, verticalAlign, horizontalAlign, offset);
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times

[Killed] ConditionalExpression
src/imageLabelPlugin.ts:290:13
         if (!isArcElement(element)) return;
 
         const imageInfo = imagesList[index];
-        if (!imageInfo?.imageUrl) return;
+        if (true) return;
 
         drawArcImageLabel(ctx, element, imageInfo, verticalAlign, horizontalAlign, offset);
killedBy: imageLabelPlugin fix #1: draws labels for every dataset, not just the first — the original's own confirmed bug
statusReason: expected "spy" to be called 2 times, but got 0 times
