[Killed] ConditionalExpression
src/zoomPlugin.ts:253:60
 
 function getScaleUnderPoint(point: ScreenPoint, chart: Chart): LiveScale | null {
   for (const scale of liveScales(chart)) {
-    if (point.y >= scale.top && point.y <= scale.bottom && point.x >= scale.left && point.x <= scale.right) {
+    if (point.y >= scale.top && point.y <= scale.bottom && true && point.x <= scale.right) {
       return scale;
     }
killedBy: zoomPlugin precise mutation-hardening: modifier keys, direction helpers, scale-point geometry getScaleUnderPoint: a false left-edge clause does not incorrectly match via the shortcut
statusReason: expected 19 to be undefined

[Killed] ArithmeticOperator
src/zoomPlugin.ts:287:47
 // ---- zoom/pan math, per scale type ----
 
 function zoomDelta(val: number, min: number, range: number, newRange: number): { min: number; max: number } {
-  const minPercent = Math.max(0, Math.min(1, (val - min) / range || 0));
+  const minPercent = Math.max(0, Math.min(1, (val + min) / range || 0));
   const maxPercent = 1 - minPercent;
   return { min: newRange * minPercent, max: newRange * maxPercent };
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) zoomDelta/linearZoomDelta: a scale with a nonzero min produces the exact hand-computed resu
statusReason: expected 40 to be 20 // Object.is equality

[Killed] ArithmeticOperator
src/zoomPlugin.ts:354:18
 ): { min: number; max: number } {
   let { min, max } = bounds;
   const { minLimit, maxLimit } = bounds;
-  const offset = (range - max + min) / 2;
+  const offset = (range - max + min) * 2;
   min -= offset;
   max += offset;
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) fixRange: minRange forcing a wider span than requested produces a genuinely nonzero, symmet
statusReason: expected -100 to be 20 // Object.is equality

[Killed] EqualityOperator
src/zoomPlugin.ts:393:10
   scaleOpts.min = fixed.min;
   scaleOpts.max = fixed.max;
   state.updatedScaleLimits[scale.id] = fixed;
-  return scale.parse(fixed.min) !== scale.min || scale.parse(fixed.max) !== scale.max;
+  return scale.parse(fixed.min) === scale.min || scale.parse(fixed.max) !== scale.max;
 }
 function zoomNumericalScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
killedBy: zoomPlugin category scale zoom/pan accumulates an unapplied pan delta rather than losing it, for a delta too small to move the range at all
statusReason: expected -10 not to be -10 // Object.is equality

[Killed] EqualityOperator
src/zoomPlugin.ts:393:50
   scaleOpts.min = fixed.min;
   scaleOpts.max = fixed.max;
   state.updatedScaleLimits[scale.id] = fixed;
-  return scale.parse(fixed.min) !== scale.min || scale.parse(fixed.max) !== scale.max;
+  return scale.parse(fixed.min) !== scale.min || scale.parse(fixed.max) === scale.max;
 }
 function zoomNumericalScale(scale: LiveScale, zoomAmount: number, center: ScreenPoint, limits: Record<string, ScaleLimits> | undefined): boolean {
killedBy: zoomPlugin category scale zoom/pan accumulates an unapplied pan delta rather than losing it, for a delta too small to move the range at all
statusReason: expected -10 not to be -10 // Object.is equality

[Killed] EqualityOperator
src/zoomPlugin.ts:644:26
 function panScale(scale: LiveScale, delta: number, limits: Record<string, ScaleLimits> | undefined, state: ZoomPluginState): void {
   const { panDelta } = state;
   const storedDelta = panDelta[scale.id] || 0;
-  const effectiveDelta = Math.sign(storedDelta) === Math.sign(delta) ? delta + storedDelta : delta;
+  const effectiveDelta = Math.sign(storedDelta) !== Math.sign(delta) ? delta + storedDelta : delta;
   const fn = panFunctions[scale.type] ?? panFunctions.default;
   // The `else` branch below (accumulating an unapplied delta for the
killedBy: zoomPlugin category scale zoom/pan accumulates an unapplied pan delta rather than losing it, for a delta too small to move the range at all
statusReason: expected -10 not to be -10 // Object.is equality

[Killed] ArrowFunction
src/zoomPlugin.ts:724:15
 
 // ---- DOM event handling (wheel zoom, drag-to-zoom-rectangle) ----
 
-const clamp = (x: number, from: number, to: number): number => Math.min(to, Math.max(from, x));
+const clamp = () => undefined;
 
 function removeHandler(chart: Chart, type: string): void {
killedBy: zoomPlugin drag-to-zoom-rectangle interaction zooms to the dragged rectangle on mousedown → mousemove → mouseup, past the configured threshold
statusReason: expected NaN to be close to 50, received difference is NaN, but expected 0.000005

[Killed] BlockStatement
src/zoomPlugin.ts:726:58
 
 const clamp = (x: number, from: number, to: number): number => Math.min(to, Math.max(from, x));
 
-function removeHandler(chart: Chart, type: string): void {
-  const { handlers } = getState(chart);
-  const handler = handlers[type] as (EventListener & { target?: EventTarget }) | undefined;
-  if (handler?.target) {
-    handler.target.removeEventListener(type, handler);
-    delete handlers[type];
-  }
-}
+function removeHandler(chart: Chart, type: string): void {}
 function addHandler(chart: Chart, target: EventTarget, type: string, handler: (chart: Chart, event: Event, options: ZoomPluginOptions) => void): void {
   const { handlers, options } = getState(chart);
killedBy: zoomPlugin precise mutation-hardening: event-type isolation (addListeners/removeListeners) disabling drag after it was enabled genuinely detaches mousedown/mousemove/mouseup/keydown (addListeners' own
statusReason: expected 50 to be undefined

[Killed] BlockStatement
src/zoomPlugin.ts:729:24
 function removeHandler(chart: Chart, type: string): void {
   const { handlers } = getState(chart);
   const handler = handlers[type] as (EventListener & { target?: EventTarget }) | undefined;
-  if (handler?.target) {
-    handler.target.removeEventListener(type, handler);
-    delete handlers[type];
-  }
+  if (handler?.target) {}
 }
 function addHandler(chart: Chart, target: EventTarget, type: string, handler: (chart: Chart, event: Event, options: ZoomPluginOptions) => void): void {
killedBy: zoomPlugin precise mutation-hardening: event-type isolation (addListeners/removeListeners) disabling drag after it was enabled genuinely detaches mousedown/mousemove/mouseup/keydown (addListeners' own
statusReason: expected 50 to be undefined

[Killed] ConditionalExpression
src/zoomPlugin.ts:959:7
   // have no mouse-gesture equivalent at all (see this file's own header
   // comment). Explicitly excluding 'mouse' here avoids double-handling
   // the same physical click through two separate event systems.
-  if (pointerEvent.pointerType === 'mouse') return;
+  if (false) return;
   const state = getState(chart);
   const { pointers } = state;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) pointerDown: a mouse-type pointerdown never even reaches setPointerCapture (the real early-return happens before tracking anything at all)
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      1,

[Killed] ConditionalExpression
src/zoomPlugin.ts:962:7
   if (pointerEvent.pointerType === 'mouse') return;
   const state = getState(chart);
   const { pointers } = state;
-  if (pointers.size >= 2) return; // only ever track the first two touches
+  if (false) return; // only ever track the first two touches
   if (chart.legend) {
     // Same real guard mouseDown's own legend check applies for mouse —
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) pointerDown: exactly two already-tracked pointers blocks a third from ever reaching setPointerCapture (the >= 2 boundary, not > 2)
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      3,

[Killed] ConditionalExpression
src/zoomPlugin.ts:1053:7
 }
 function pointerUp(chart: Chart, event: Event): void {
   const pointerEvent = event as PointerEvent;
-  if (pointerEvent.pointerType === 'mouse') return;
+  if (false) return;
   const state = getState(chart);
   const { pointers } = state;
killedBy: zoomPlugin touch pan + pinch-zoom (Pointer Events) ignores a mouse-type pointerup too, not just pointerdown/pointermove (pointerUp's own mouse-exclusion check)
statusReason: expected "spy" to not be called at all, but actually been called 1 times

Received: 

  1st spy call:

    Array [
      Object {

[Killed] ConditionalExpression
src/zoomPlugin.ts:1193:9
   beforeEvent(chart: Chart, args): boolean | void {
     if (isZoomingOrPanning(chart)) return false;
     const event = args.event;
-    if (event.type === 'click' || event.type === 'mouseup') {
+    if (true) {
       const state = getState(chart);
       if (state.filterNextClick) {
killedBy: zoomPlugin precise mutation-hardening: zoom/pan math (zoomDelta, log-scale, fixRange, updateRange, category) beforeEvent: does NOT suppress an event type other than "click"/"mouseup" even with filterN
statusReason: expected false to be undefined
