[Killed] ArithmeticOperator
src/imageLabelPlugin.ts:150:14
     case 'start':
       return startAngle + imageRadius / outerRadius + offsetRadian;
     case 'end':
-      return endAngle - imageRadius / outerRadius - offsetRadian;
+      return endAngle - imageRadius / outerRadius + offsetRadian;
     case 'middle':
     default:
killedBy: imageLabelPlugin positions using verticalAlign: bottom and horizontalAlign: end, combined with a nonzero offset
statusReason: expected 98.12675731818145 to be close to 107.98271964642502, received difference is 9.855962328243578, but expected 0.000005
