[Killed] BlockStatement
src/useChartController.ts:170:53
   // timing.
   let pending: Promise<void> = Promise.resolve();
 
-  function enqueue(task: () => Promise<void>): void {
-    pending = pending.then(task, task);
-    // Marks `pending` as handled immediately, regardless of whether it
-    // rejects — without this, a real run confirmed a genuine gap: if
-    // `task` itself rejects (e.g. `createChartController` throwing), the
-    // resulting `pending` sits unhandled for however long passes before
-    // the *next* `enqueue()` call attaches `.then(task, task)`'s own
-    // real continuation logic, which is exactly what `.then(task, task)`
-    // recovers from — but Node/V8 flags an unhandled rejection based on
-    // whether a handler was EVER attached at all during that gap,
-    // regardless of it eventually being handled later. This empty
-    // `.catch` changes no real behavior (the callback is a true no-op)
-    // and doesn't affect the `pending` reference used for actual
-    // chaining above — it exists purely to suppress that false-positive
-    // warning/failure.
-    pending.catch(() => {});
-  }
+  function enqueue(task: () => Promise<void>): void {}
 
   async function resolveOptionsAndPlugins(): Promise<{
killedBy: Chart — mount mounts a canvas and calls createChartController with type "bar"
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] LogicalOperator
src/useChartController.ts:192:16
     options: ChartConfiguration['options'];
     plugins: ChartConfiguration['plugins'];
   }> {
-    let opts = props.options ?? {};
+    let opts = props.options && {};
     if (props.annotation) {
       opts = await withAnnotation(opts, props.annotation);
killedBy: Chart — mount mounts a canvas and calls createChartController with type "bar"
statusReason: expected "spy" to be called with arguments: [ <canvas></canvas>, …(1) ]

Received: 

  1st spy call:

  Array [
    <canvas>

[Killed] ConditionalExpression
src/useChartController.ts:193:9
     plugins: ChartConfiguration['plugins'];
   }> {
     let opts = props.options ?? {};
-    if (props.annotation) {
+    if (true) {
       opts = await withAnnotation(opts, props.annotation);
     }
killedBy: Chart — mount mounts a canvas and calls createChartController with type "bar"
statusReason: expected "spy" to be called with arguments: [ <canvas></canvas>, …(1) ]

Received: 

  1st spy call:

  Array [
    <canvas>

[Killed] ConditionalExpression
src/useChartController.ts:193:9
     plugins: ChartConfiguration['plugins'];
   }> {
     let opts = props.options ?? {};
-    if (props.annotation) {
+    if (false) {
       opts = await withAnnotation(opts, props.annotation);
     }
killedBy: Chart — plugin opt-ins applies annotation only when given a real config object — no plain-boolean form, unlike zoom/dataLabels
statusReason: expected "spy" to be called with arguments: [ {}, { annotations: { …(1) } } ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/useChartController.ts:196:9
     if (props.annotation) {
       opts = await withAnnotation(opts, props.annotation);
     }
-    if (props.dataLabels) {
+    if (true) {
       opts = await withDataLabels(opts, typeof props.dataLabels === 'object' ? props.dataLabels : undefined);
     }
killedBy: Chart — mount mounts a canvas and calls createChartController with type "bar"
statusReason: expected "spy" to be called with arguments: [ <canvas></canvas>, …(1) ]

Received: 

  1st spy call:

  Array [
    <canvas>

[Killed] BlockStatement
src/useChartController.ts:196:27
     if (props.annotation) {
       opts = await withAnnotation(opts, props.annotation);
     }
-    if (props.dataLabels) {
-      opts = await withDataLabels(opts, typeof props.dataLabels === 'object' ? props.dataLabels : undefined);
-    }
+    if (props.dataLabels) {}
     if (props.timestack) {
       opts = await withTimestack(opts);
killedBy: Chart — plugin opt-ins applies dataLabels with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ {}, undefined ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/useChartController.ts:197:41
       opts = await withAnnotation(opts, props.annotation);
     }
     if (props.dataLabels) {
-      opts = await withDataLabels(opts, typeof props.dataLabels === 'object' ? props.dataLabels : undefined);
+      opts = await withDataLabels(opts, true ? props.dataLabels : undefined);
     }
     if (props.timestack) {
killedBy: Chart — plugin opt-ins applies dataLabels with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ {}, undefined ]

Received: 

  1st spy call:

  Array [
    Object {},

[Killed] EqualityOperator
src/useChartController.ts:197:41
       opts = await withAnnotation(opts, props.annotation);
     }
     if (props.dataLabels) {
-      opts = await withDataLabels(opts, typeof props.dataLabels === 'object' ? props.dataLabels : undefined);
+      opts = await withDataLabels(opts, typeof props.dataLabels !== 'object' ? props.dataLabels : undefined);
     }
     if (props.timestack) {
killedBy: Chart — plugin opt-ins applies dataLabels with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ {}, undefined ]

Received: 

  1st spy call:

  Array [
    Object {},

[Killed] ConditionalExpression
src/useChartController.ts:199:9
     if (props.dataLabels) {
       opts = await withDataLabels(opts, typeof props.dataLabels === 'object' ? props.dataLabels : undefined);
     }
-    if (props.timestack) {
+    if (false) {
       opts = await withTimestack(opts);
     }
killedBy: Chart — plugin opt-ins applies timestack when the prop is `true` — boolean only, no config-object form, same shape as gradient
statusReason: expected "spy" to be called with arguments: [ {} ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/useChartController.ts:199:9
     if (props.dataLabels) {
       opts = await withDataLabels(opts, typeof props.dataLabels === 'object' ? props.dataLabels : undefined);
     }
-    if (props.timestack) {
+    if (true) {
       opts = await withTimestack(opts);
     }
killedBy: Chart — update serializes overlapping prop changes through one promise chain rather than racing
statusReason: expected 1st "spy" call to have been called with [ { type: 'bar', …(2) } ]

[Killed] ConditionalExpression
src/useChartController.ts:202:9
     if (props.timestack) {
       opts = await withTimestack(opts);
     }
-    if (props.hierarchical) {
+    if (true) {
       opts = await withHierarchical(opts);
     }
killedBy: Chart — update serializes overlapping prop changes through one promise chain rather than racing
statusReason: expected 1st "spy" call to have been called with [ { type: 'bar', …(2) } ]

[Killed] ConditionalExpression
src/useChartController.ts:202:9
     if (props.timestack) {
       opts = await withTimestack(opts);
     }
-    if (props.hierarchical) {
+    if (false) {
       opts = await withHierarchical(opts);
     }
killedBy: Chart — plugin opt-ins applies hierarchical when the prop is `true` — boolean only, no config-object form, same shape as gradient/timestack
statusReason: expected "spy" to be called with arguments: [ {} ]

Received: 



Number of calls: 0

[Killed] LogicalOperator
src/useChartController.ts:214:7
     // array).
     let effectivePlugins = props.plugins;
     const inputsChanged =
-      props.plugins !== lastRawPlugins ||
-      props.zoom !== lastZoom ||
-      props.gradient !== lastGradient ||
-      props.imageLabel !== lastImageLabelOptions;
+      (props.plugins !== lastRawPlugins || props.zoom !== lastZoom || props.gradient !== lastGradient) && props.imageLabel !== lastImageLabelOptions;
     if (props.zoom || props.gradient || props.imageLabel) {
       // withZoom/withGradient/withImageLabel are called every time
killedBy: Chart — plugin opt-ins applies zoom with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ Anything, { type: 'bar', …(3) } ]

Received: 

  1st spy call:

  Array [
-   Anything,

[Killed] EqualityOperator
src/useChartController.ts:214:7
     // array).
     let effectivePlugins = props.plugins;
     const inputsChanged =
-      props.plugins !== lastRawPlugins ||
+      props.plugins === lastRawPlugins ||
       props.zoom !== lastZoom ||
       props.gradient !== lastGradient ||
killedBy: Chart — plugin opt-ins reuses the same merged plugins array reference across two separate unrelated updates, rather than rebuilding a fresh one each time
statusReason: expected [ { id: 'image-label-plugin' } ] to be [ { id: 'image-label-plugin' } ] // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: [ { id: 'image-label-plugin' } ]
Received: serializes to the same string

[Killed] EqualityOperator
src/useChartController.ts:215:7
     let effectivePlugins = props.plugins;
     const inputsChanged =
       props.plugins !== lastRawPlugins ||
-      props.zoom !== lastZoom ||
+      props.zoom === lastZoom ||
       props.gradient !== lastGradient ||
       props.imageLabel !== lastImageLabelOptions;
killedBy: Chart — plugin opt-ins reuses the same merged plugins array reference across two separate unrelated updates, rather than rebuilding a fresh one each time
statusReason: expected [ { id: 'image-label-plugin' } ] to be [ { id: 'image-label-plugin' } ] // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: [ { id: 'image-label-plugin' } ]
Received: serializes to the same string

[Survived] ConditionalExpression
src/useChartController.ts:215:7
     let effectivePlugins = props.plugins;
     const inputsChanged =
       props.plugins !== lastRawPlugins ||
-      props.zoom !== lastZoom ||
+      false ||
       props.gradient !== lastGradient ||
       props.imageLabel !== lastImageLabelOptions;

[Killed] EqualityOperator
src/useChartController.ts:216:7
     const inputsChanged =
       props.plugins !== lastRawPlugins ||
       props.zoom !== lastZoom ||
-      props.gradient !== lastGradient ||
+      props.gradient === lastGradient ||
       props.imageLabel !== lastImageLabelOptions;
     if (props.zoom || props.gradient || props.imageLabel) {
killedBy: Chart — plugin opt-ins reuses the same merged plugins array reference across two separate unrelated updates, rather than rebuilding a fresh one each time
statusReason: expected [ { id: 'image-label-plugin' } ] to be [ { id: 'image-label-plugin' } ] // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: [ { id: 'image-label-plugin' } ]
Received: serializes to the same string

[Survived] ConditionalExpression
src/useChartController.ts:216:7
     const inputsChanged =
       props.plugins !== lastRawPlugins ||
       props.zoom !== lastZoom ||
-      props.gradient !== lastGradient ||
+      false ||
       props.imageLabel !== lastImageLabelOptions;
     if (props.zoom || props.gradient || props.imageLabel) {

[Killed] EqualityOperator
src/useChartController.ts:217:7
       props.plugins !== lastRawPlugins ||
       props.zoom !== lastZoom ||
       props.gradient !== lastGradient ||
-      props.imageLabel !== lastImageLabelOptions;
+      props.imageLabel === lastImageLabelOptions;
     if (props.zoom || props.gradient || props.imageLabel) {
       // withZoom/withGradient/withImageLabel are called every time
killedBy: Chart — plugin opt-ins reuses the same merged plugins array reference across two separate unrelated updates, rather than rebuilding a fresh one each time
statusReason: expected [ { id: 'image-label-plugin' } ] to be [ { id: 'image-label-plugin' } ] // Object.is equality

If it should pass with deep equality, replace "toBe" with "toStrictEqual"

Expected: [ { id: 'image-label-plugin' } ]
Received: serializes to the same string

[Survived] ConditionalExpression
src/useChartController.ts:217:7
       props.plugins !== lastRawPlugins ||
       props.zoom !== lastZoom ||
       props.gradient !== lastGradient ||
-      props.imageLabel !== lastImageLabelOptions;
+      false;
     if (props.zoom || props.gradient || props.imageLabel) {
       // withZoom/withGradient/withImageLabel are called every time

[Killed] LogicalOperator
src/useChartController.ts:218:9
       props.zoom !== lastZoom ||
       props.gradient !== lastGradient ||
       props.imageLabel !== lastImageLabelOptions;
-    if (props.zoom || props.gradient || props.imageLabel) {
+    if ((props.zoom || props.gradient) && props.imageLabel) {
       // withZoom/withGradient/withImageLabel are called every time
       // regardless of the cache below — withZoom's/withImageLabel's own
killedBy: Chart — plugin opt-ins applies zoom with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ {}, undefined ]

Received: 



Number of calls: 0

[Killed] LogicalOperator
src/useChartController.ts:218:9
       props.zoom !== lastZoom ||
       props.gradient !== lastGradient ||
       props.imageLabel !== lastImageLabelOptions;
-    if (props.zoom || props.gradient || props.imageLabel) {
+    if (props.zoom && props.gradient || props.imageLabel) {
       // withZoom/withGradient/withImageLabel are called every time
       // regardless of the cache below — withZoom's/withImageLabel's own
killedBy: Chart — plugin opt-ins applies zoom with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ {}, undefined ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/useChartController.ts:228:11
       // gradientPlugin.ts/imageLabelPlugin.ts), so calling these helpers
       // again here is cheap either way.
       const inlinePlugins: unknown[] = [];
-      if (props.zoom) {
+      if (true) {
         const result = await withZoom(opts, typeof props.zoom === 'object' ? props.zoom : undefined);
         opts = result.options;
killedBy: Chart — plugin opt-ins applies gradient when the prop is `true` — boolean only, no config-object form, and merges its own returned plugin object into the effective plugins array
statusReason: expected "spy" to be called with arguments: [ {} ]

Received: 

  1st spy call:

  Array [
-   Object {},

[Killed] ConditionalExpression
src/useChartController.ts:228:11
       // gradientPlugin.ts/imageLabelPlugin.ts), so calling these helpers
       // again here is cheap either way.
       const inlinePlugins: unknown[] = [];
-      if (props.zoom) {
+      if (false) {
         const result = await withZoom(opts, typeof props.zoom === 'object' ? props.zoom : undefined);
         opts = result.options;
killedBy: Chart — plugin opt-ins applies zoom with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ {}, undefined ]

Received: 



Number of calls: 0

[Killed] EqualityOperator
src/useChartController.ts:229:45
       // again here is cheap either way.
       const inlinePlugins: unknown[] = [];
       if (props.zoom) {
-        const result = await withZoom(opts, typeof props.zoom === 'object' ? props.zoom : undefined);
+        const result = await withZoom(opts, typeof props.zoom !== 'object' ? props.zoom : undefined);
         opts = result.options;
         inlinePlugins.push(result.plugin);
killedBy: Chart — plugin opt-ins applies zoom with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ {}, undefined ]

Received: 

  1st spy call:

  Array [
    Object {},

[Killed] ConditionalExpression
src/useChartController.ts:229:45
       // again here is cheap either way.
       const inlinePlugins: unknown[] = [];
       if (props.zoom) {
-        const result = await withZoom(opts, typeof props.zoom === 'object' ? props.zoom : undefined);
+        const result = await withZoom(opts, true ? props.zoom : undefined);
         opts = result.options;
         inlinePlugins.push(result.plugin);
killedBy: Chart — plugin opt-ins applies zoom with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ {}, undefined ]

Received: 

  1st spy call:

  Array [
    Object {},

[Killed] BlockStatement
src/useChartController.ts:233:27
         opts = result.options;
         inlinePlugins.push(result.plugin);
       }
-      if (props.gradient) {
-        const result = await withGradient(opts);
-        opts = result.options;
-        inlinePlugins.push(result.plugin);
-      }
+      if (props.gradient) {}
       if (props.imageLabel) {
         const result = await withImageLabel(opts, props.imageLabel);
killedBy: Chart — plugin opt-ins applies gradient when the prop is `true` — boolean only, no config-object form, and merges its own returned plugin object into the effective plugins array
statusReason: expected "spy" to be called with arguments: [ {} ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/useChartController.ts:233:11
         opts = result.options;
         inlinePlugins.push(result.plugin);
       }
-      if (props.gradient) {
+      if (false) {
         const result = await withGradient(opts);
         opts = result.options;
killedBy: Chart — plugin opt-ins applies gradient when the prop is `true` — boolean only, no config-object form, and merges its own returned plugin object into the effective plugins array
statusReason: expected "spy" to be called with arguments: [ {} ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/useChartController.ts:238:11
         opts = result.options;
         inlinePlugins.push(result.plugin);
       }
-      if (props.imageLabel) {
+      if (false) {
         const result = await withImageLabel(opts, props.imageLabel);
         opts = result.options;
killedBy: Chart — plugin opt-ins applies imageLabel only when given a real config object, and merges its own returned plugin object into the effective plugins array
statusReason: expected "spy" to be called with arguments: [ {}, { imagesList: [ { …(3) } ] } ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/useChartController.ts:238:29
         opts = result.options;
         inlinePlugins.push(result.plugin);
       }
-      if (props.imageLabel) {
-        const result = await withImageLabel(opts, props.imageLabel);
-        opts = result.options;
-        inlinePlugins.push(result.plugin);
-      }
+      if (props.imageLabel) {}
       if (!inputsChanged) {
         // None of props.plugins/props.zoom/props.gradient/props.imageLabel
killedBy: Chart — plugin opt-ins applies imageLabel only when given a real config object, and merges its own returned plugin object into the effective plugins array
statusReason: expected "spy" to be called with arguments: [ {}, { imagesList: [ { …(3) } ] } ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/useChartController.ts:243:11
         opts = result.options;
         inlinePlugins.push(result.plugin);
       }
-      if (!inputsChanged) {
+      if (true) {
         // None of props.plugins/props.zoom/props.gradient/props.imageLabel
         // changed since the last call — reuse the exact same merged array
killedBy: Chart — plugin opt-ins applies zoom with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ Anything, { type: 'bar', …(3) } ]

Received: 

  1st spy call:

  Array [
-   Anything,

[Killed] BooleanLiteral
src/useChartController.ts:243:11
         opts = result.options;
         inlinePlugins.push(result.plugin);
       }
-      if (!inputsChanged) {
+      if (inputsChanged) {
         // None of props.plugins/props.zoom/props.gradient/props.imageLabel
         // changed since the last call — reuse the exact same merged array
killedBy: Chart — plugin opt-ins applies zoom with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ Anything, { type: 'bar', …(3) } ]

Received: 

  1st spy call:

  Array [
-   Anything,

[Killed] BlockStatement
src/useChartController.ts:250:14
         // unrelated update (e.g. `data`) doesn't spuriously force a
         // destroy-and-recreate.
         effectivePlugins = mergedPluginsCache;
-      } else {
-        // Cast needed: withZoom/withGradient/withImageLabel all
-        // deliberately type their own returned plugin as `unknown` (see
-        // plugins.ts), since none is modeled against Chart.js's own
-        // `Plugin<...>` type at the cross-package boundary — safe here
-        // since all three are real, valid Chart.js plugin objects at
-        // runtime (confirmed by each's own dedicated test suite in
-        // packages/core).
-        effectivePlugins = [...(props.plugins ?? []), ...inlinePlugins] as ChartConfiguration['plugins'];
-        mergedPluginsCache = effectivePlugins;
-      }
+      } else {}
     }
     lastRawPlugins = props.plugins;
killedBy: Chart — plugin opt-ins applies zoom with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ Anything, { type: 'bar', …(3) } ]

Received: 

  1st spy call:

  Array [
-   Anything,

[Killed] BlockStatement
src/useChartController.ts:276:41
   // function's enqueued task actually runs, canvasRef.value is always a
   // real element. A real `test:coverage` run against the pre-refactor
   // inline version of this logic confirmed a guard here was dead code.
-  async function mount(): Promise<void> {
-    const { options, plugins } = await resolveOptionsAndPlugins();
-    handle = await createChartController(canvasRef.value!, {
-      type: props.type,
-      data: props.data,
-      options,
-      plugins,
-    });
-    chart.value = handle.chart;
-  }
+  async function mount(): Promise<void> {}
 
   // No "handle is still null" fallback here either, for the identical
killedBy: Chart — mount mounts a canvas and calls createChartController with type "bar"
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/useChartController.ts:292:42
   // (`onMounted` enqueues `mount` first; `watch()`'s callback can only
   // fire on a later reactive tick), and `mount()` always successfully
   // sets `handle` per the note above.
-  async function update(): Promise<void> {
-    const { options, plugins } = await resolveOptionsAndPlugins();
-    await handle!.update({ type: props.type, data: props.data, options, plugins });
-    // handle.chart is a live getter — re-read it after update(), since an
-    // in-place update keeps the same instance but a type-change recreate
-    // swaps it for a new one under the same handle.
-    chart.value = handle!.chart;
-  }
+  async function update(): Promise<void> {}
 
   onMounted(() => {
killedBy: Chart — update updates in place via handle.update when data changes, without calling createChartController again
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/useChartController.ts:301:19
     chart.value = handle!.chart;
   }
 
-  onMounted(() => {
-    enqueue(mount);
-  });
+  onMounted(() => {});
 
   watch(
killedBy: Chart — mount mounts a canvas and calls createChartController with type "bar"
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/useChartController.ts:306:5
   });
 
   watch(
-    () => [
-      props.type,
-      props.data,
-      props.options,
-      props.zoom,
-      props.annotation,
-      props.dataLabels,
-      props.gradient,
-      props.timestack,
-      props.hierarchical,
-      props.imageLabel,
-      props.plugins,
-    ],
+    () => undefined,
     () => {
       enqueue(update);
killedBy: Chart — update updates in place via handle.update when data changes, without calling createChartController again
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ArrayDeclaration
src/useChartController.ts:306:11
   });
 
   watch(
-    () => [
-      props.type,
-      props.data,
-      props.options,
-      props.zoom,
-      props.annotation,
-      props.dataLabels,
-      props.gradient,
-      props.timestack,
-      props.hierarchical,
-      props.imageLabel,
-      props.plugins,
-    ],
+    () => [],
     () => {
       enqueue(update);
killedBy: Chart — update updates in place via handle.update when data changes, without calling createChartController again
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/useChartController.ts:319:11
       props.imageLabel,
       props.plugins,
     ],
-    () => {
-      enqueue(update);
-    },
+    () => {},
     { deep: true },
   );
killedBy: Chart — update updates in place via handle.update when data changes, without calling createChartController again
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/useChartController.ts:325:25
     { deep: true },
   );
 
-  onBeforeUnmount(() => {
-    enqueue(async () => {
-      handle?.destroy();
-      handle = null;
-      chart.value = null;
-    });
-  });
+  onBeforeUnmount(() => {});
 
   return { chart };
killedBy: Chart — unmount destroys the handle exactly once on unmount
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/useChartController.ts:326:25
   );
 
   onBeforeUnmount(() => {
-    enqueue(async () => {
-      handle?.destroy();
-      handle = null;
-      chart.value = null;
-    });
+    enqueue(async () => {});
   });
 
killedBy: Chart — unmount destroys the handle exactly once on unmount
statusReason: expected "spy" to be called 1 times, but got 0 times

[Survived] OptionalChaining
src/useChartController.ts:327:7
 
   onBeforeUnmount(() => {
     enqueue(async () => {
-      handle?.destroy();
+      handle.destroy();
       handle = null;
       chart.value = null;

[Killed] ObjectLiteral
src/useChartController.ts:333:10
     });
   });
 
-  return { chart };
+  return {};
 }
 
killedBy: Chart — update re-reads handle.chart after update, since a type-change recreate swaps the underlying instance under the same handle
statusReason: expected undefined to be { id: 'new-fake-chart' } // Object.is equality
