[Killed] BlockStatement
src/useChartController.ts:131:75
     pending.catch(() => {});
   }
 
-  async function resolveOptions(): Promise<ChartConfiguration['options']> {
-    let opts = props.options ?? {};
-    if (props.zoom) {
-      opts = await withZoom(opts, typeof props.zoom === 'object' ? props.zoom : undefined);
-    }
-    if (props.annotation) {
-      opts = await withAnnotation(opts, props.annotation);
-    }
-    if (props.dataLabels) {
-      opts = await withDataLabels(opts, typeof props.dataLabels === 'object' ? props.dataLabels : undefined);
-    }
-    if (props.gradient) {
-      opts = await withGradient(opts);
-    }
-    if (props.timestack) {
-      opts = await withTimestack(opts);
-    }
-    if (props.hierarchical) {
-      opts = await withHierarchical(opts);
-    }
-    return opts;
-  }
+  async function resolveOptions(): Promise<ChartConfiguration['options']> {}
 
   // No "canvasRef is still null" guard here — genuinely unreachable, not
killedBy: Chart — mount mounts a canvas and calls createChartController with type "bar"
statusReason: expected "spy" to be called with arguments: [ <canvas></canvas>, …(1) ]

Received: 

  1st spy call:

  Array [
    <canvas>

[Killed] LogicalOperator
src/useChartController.ts:132:16
   }
 
   async function resolveOptions(): Promise<ChartConfiguration['options']> {
-    let opts = props.options ?? {};
+    let opts = props.options && {};
     if (props.zoom) {
       opts = await withZoom(opts, typeof props.zoom === 'object' ? props.zoom : undefined);
killedBy: Chart — mount mounts a canvas and calls createChartController with type "bar"
statusReason: expected "spy" to be called with arguments: [ <canvas></canvas>, …(1) ]

Received: 

  1st spy call:

  Array [
    <canvas>

[Killed] ConditionalExpression
src/useChartController.ts:133:9
 
   async function resolveOptions(): Promise<ChartConfiguration['options']> {
     let opts = props.options ?? {};
-    if (props.zoom) {
+    if (true) {
       opts = await withZoom(opts, typeof props.zoom === 'object' ? props.zoom : undefined);
     }
killedBy: Chart — mount mounts a canvas and calls createChartController with type "bar"
statusReason: expected "spy" to be called with arguments: [ <canvas></canvas>, …(1) ]

Received: 

  1st spy call:

  Array [
    <canvas>

[Killed] ConditionalExpression
src/useChartController.ts:133:9
 
   async function resolveOptions(): Promise<ChartConfiguration['options']> {
     let opts = props.options ?? {};
-    if (props.zoom) {
+    if (false) {
       opts = await withZoom(opts, typeof props.zoom === 'object' ? props.zoom : undefined);
     }
killedBy: Chart — plugin opt-ins applies zoom with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ {}, undefined ]

Received: 



Number of calls: 0

[Killed] EqualityOperator
src/useChartController.ts:134:35
   async function resolveOptions(): Promise<ChartConfiguration['options']> {
     let opts = props.options ?? {};
     if (props.zoom) {
-      opts = await withZoom(opts, typeof props.zoom === 'object' ? props.zoom : undefined);
+      opts = await withZoom(opts, typeof props.zoom !== 'object' ? props.zoom : undefined);
     }
     if (props.annotation) {
killedBy: Chart — plugin opt-ins applies zoom with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ {}, undefined ]

Received: 

  1st spy call:

  Array [
    Object {},

[Killed] ConditionalExpression
src/useChartController.ts:134:35
   async function resolveOptions(): Promise<ChartConfiguration['options']> {
     let opts = props.options ?? {};
     if (props.zoom) {
-      opts = await withZoom(opts, typeof props.zoom === 'object' ? props.zoom : undefined);
+      opts = await withZoom(opts, true ? props.zoom : undefined);
     }
     if (props.annotation) {
killedBy: Chart — plugin opt-ins applies zoom with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ {}, undefined ]

Received: 

  1st spy call:

  Array [
    Object {},

[Killed] ConditionalExpression
src/useChartController.ts:136:9
     if (props.zoom) {
       opts = await withZoom(opts, typeof props.zoom === 'object' ? props.zoom : undefined);
     }
-    if (props.annotation) {
+    if (true) {
       opts = await withAnnotation(opts, props.annotation);
     }
killedBy: Chart — mount mounts a canvas and calls createChartController with type "bar"
statusReason: expected "spy" to be called with arguments: [ <canvas></canvas>, …(1) ]

Received: 

  1st spy call:

  Array [
    <canvas>

[Killed] ConditionalExpression
src/useChartController.ts:136:9
     if (props.zoom) {
       opts = await withZoom(opts, typeof props.zoom === 'object' ? props.zoom : undefined);
     }
-    if (props.annotation) {
+    if (false) {
       opts = await withAnnotation(opts, props.annotation);
     }
killedBy: Chart — plugin opt-ins applies annotation only when given a real config object — no plain-boolean form, unlike zoom/dataLabels
statusReason: expected "spy" to be called with arguments: [ {}, { annotations: { …(1) } } ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/useChartController.ts:139:9
     if (props.annotation) {
       opts = await withAnnotation(opts, props.annotation);
     }
-    if (props.dataLabels) {
+    if (false) {
       opts = await withDataLabels(opts, typeof props.dataLabels === 'object' ? props.dataLabels : undefined);
     }
killedBy: Chart — plugin opt-ins applies dataLabels with no extra config when the prop is `true`
statusReason: expected "spy" to be called with arguments: [ {}, undefined ]

Received: 



Number of calls: 0

[Killed] ConditionalExpression
src/useChartController.ts:140:41
       opts = await withAnnotation(opts, props.annotation);
     }
     if (props.dataLabels) {
-      opts = await withDataLabels(opts, typeof props.dataLabels === 'object' ? props.dataLabels : undefined);
+      opts = await withDataLabels(opts, false ? props.dataLabels : undefined);
     }
     if (props.gradient) {
killedBy: Chart — plugin opt-ins applies dataLabels with the given config object
statusReason: expected "spy" to be called with arguments: [ {}, { color: '#fff' } ]

Received: 

  1st spy call:

  Array [
    Object {},

[Killed] BlockStatement
src/useChartController.ts:142:25
     if (props.dataLabels) {
       opts = await withDataLabels(opts, typeof props.dataLabels === 'object' ? props.dataLabels : undefined);
     }
-    if (props.gradient) {
-      opts = await withGradient(opts);
-    }
+    if (props.gradient) {}
     if (props.timestack) {
       opts = await withTimestack(opts);
killedBy: Chart — plugin opt-ins applies gradient when the prop is `true` — boolean only, no config-object form
statusReason: expected "spy" to be called with arguments: [ {} ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/useChartController.ts:145:26
     if (props.gradient) {
       opts = await withGradient(opts);
     }
-    if (props.timestack) {
-      opts = await withTimestack(opts);
-    }
+    if (props.timestack) {}
     if (props.hierarchical) {
       opts = await withHierarchical(opts);
killedBy: Chart — plugin opt-ins applies timestack when the prop is `true` — boolean only, no config-object form, same shape as gradient
statusReason: expected "spy" to be called with arguments: [ {} ]

Received: 



Number of calls: 0

[Killed] BlockStatement
src/useChartController.ts:161:41
   // function's enqueued task actually runs, canvasRef.value is always a
   // real element. A real `test:coverage` run against the pre-refactor
   // inline version of this logic confirmed a guard here was dead code.
-  async function mount(): Promise<void> {
-    const options = await resolveOptions();
-    handle = await createChartController(canvasRef.value!, {
-      type: props.type,
-      data: props.data,
-      options,
-      plugins: props.plugins,
-    });
-    chart.value = handle.chart;
-  }
+  async function mount(): Promise<void> {}
 
   // No "handle is still null" fallback here either, for the identical
killedBy: Chart — mount mounts a canvas and calls createChartController with type "bar"
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] BlockStatement
src/useChartController.ts:177:42
   // (`onMounted` enqueues `mount` first; `watch()`'s callback can only
   // fire on a later reactive tick), and `mount()` always successfully
   // sets `handle` per the note above.
-  async function update(): Promise<void> {
-    const options = await resolveOptions();
-    await handle!.update({ type: props.type, data: props.data, options, plugins: props.plugins });
-    // handle.chart is a live getter — re-read it after update(), since an
-    // in-place update keeps the same instance but a type-change recreate
-    // swaps it for a new one under the same handle.
-    chart.value = handle!.chart;
-  }
+  async function update(): Promise<void> {}
 
   onMounted(() => {
killedBy: Chart — update updates in place via handle.update when data changes, without calling createChartController again
statusReason: expected "spy" to be called 1 times, but got 0 times

[Killed] ArrowFunction
src/useChartController.ts:191:5
   });
 
   watch(
-    () => [
-      props.type,
-      props.data,
-      props.options,
-      props.zoom,
-      props.annotation,
-      props.dataLabels,
-      props.gradient,
-      props.timestack,
-      props.hierarchical,
-      props.plugins,
-    ],
+    () => undefined,
     () => {
       enqueue(update);
killedBy: Chart — update updates in place via handle.update when data changes, without calling createChartController again
statusReason: expected "spy" to be called 1 times, but got 0 times
